Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/contributor/testing/index.po
Languages: es

source: Testing
es: Pruebas

source: Testing guide for Construbot contributors.
es: Guía de pruebas para colaboradores de Construbot.

source: Running Tests
es: Ejecución de pruebas

source: **Full test suite:**
es: **Suite de pruebas completa:**

source: **Specific tests:**
es: **Pruebas específicas:**

source: **With coverage:**
es: **Con cobertura:**

source: Writing Tests
es: Pruebas de escritura

source: **Test structure:**
es: **Estructura de prueba:**

source: **Use factories:**
es: **Usar fábricas:**

source: Best Practices
es: Mejores prácticas

source: ✅ Test one thing per test
es: ✅ Pruebe una cosa por prueba

source: ✅ Use descriptive test names
es: ✅ Utilice nombres de prueba descriptivos

source: ✅ Isolate tests (don't depend on other tests)
es: ✅ Pruebas de aislamiento (no depender de otras pruebas)

source: ✅ Use fixtures for common setup
es: ✅ Utilice accesorios para una configuración común

source: ✅ Tag work-in-progress tests with ``@tag('current')``
es: ✅ Etiquete las pruebas de trabajo en progreso con ``@tag('current')``

source: Test Coverage
es: Cobertura de prueba

source: **Target:** >80% coverage
es: **Objetivo:** >80% de cobertura

source: **Check coverage:**
es: **Consulta cobertura:**

source: See Also
es: Ver también
