Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/deployment/aws-ec2.po
Languages: es

source: AWS EC2 Deployment
es: Implementación de AWS EC2

source: Complete guide to deploying Construbot on Amazon Web Services EC2 instances.
es: Guía completa para implementar Construbot en instancias EC2 de Amazon Web Services.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: This guide covers deploying Construbot to AWS EC2 using Docker Compose. This setup is suitable for small to medium deployments (up to several thousand users).
es: Esta guía cubre la implementación de Construbot en AWS EC2 utilizando Docker Compose. Esta configuración es adecuada para implementaciones pequeñas y medianas (hasta varios miles de usuarios).

source: **What you'll build:**
es: **Qué construirás:**

source: EC2 instance running Ubuntu 22.04
es: Instancia EC2 que ejecuta Ubuntu 22.04

source: Docker Compose orchestrating all services
es: Docker Compose orquestando todos los servicios

source: RDS PostgreSQL database (recommended) or self-hosted
es: Base de datos RDS PostgreSQL (recomendada) o autohospedada

source: ElastiCache Redis (optional) or self-hosted
es: ElastiCache Redis (opcional) o autohospedado

source: S3 for media file storage
es: S3 para almacenamiento de archivos multimedia

source: Route 53 for DNS (optional)
es: Ruta 53 para DNS (opcional)

source: SSL certificate from Let's Encrypt
es: Certificado SSL de Let's Encrypt

source: **Estimated cost:** $20-80/month depending on instance sizes
es: **Costo estimado:** $20-80/mes dependiendo del tamaño de las instancias

source: Prerequisites
es: Requisitos previos

source: AWS Account Setup
es: Configuración de la cuenta de AWS

source: **Install AWS CLI:**
es: **Instalar AWS CLI:**

source: Local Requirements
es: Requisitos locales

source: Step 1: Launch EC2 Instance
es: Paso 1: iniciar la instancia EC2

source: Instance Selection
es: Selección de instancia

source: **Recommended specs:**
es: **Especificaciones recomendadas:**

source: **Instance Type:** t3.small (2 vCPU, 2 GB RAM) minimum, t3.medium (2 vCPU, 4 GB RAM) recommended
es: **Tipo de instancia:** t3.small (2 vCPU, 2 GB de RAM) mínimo, t3.medium (2 vCPU, 4 GB de RAM) recomendado

source: **OS:** Ubuntu Server 22.04 LTS
es: **SO:** Servidor Ubuntu 22.04 LTS

source: **Storage:** 30 GB gp3 SSD minimum
es: **Almacenamiento:** 30 GB gp3 SSD mínimo

source: **Region:** Choose closest to your users
es: **Región:** Elija la más cercana a sus usuarios

source: **Via AWS Console:**
es: **A través de la consola de AWS:**

source: Navigate to EC2 Dashboard
es: Navegue al Panel de EC2

source: Click "Launch Instance"
es: Haga clic en "Iniciar instancia"

source: Choose "Ubuntu Server 22.04 LTS (HVM), SSD Volume Type"
es: Elija "Ubuntu Server 22.04 LTS (HVM), tipo de volumen SSD"

source: Select instance type (t3.small or larger)
es: Seleccione el tipo de instancia (t3.small o mayor)

source: Configure storage (30 GB minimum)
es: Configurar el almacenamiento (30 GB mínimo)

source: Add tags: Name=construbot-production
es: Agregar etiquetas: Nombre=construbot-producción

source: Configure Security Group (see below)
es: Configurar el grupo de seguridad (ver más abajo)

source: Review and Launch
es: Revisión y lanzamiento

source: **Via AWS CLI:**
es: **A través de AWS CLI:**

source: Security Group Configuration
es: Configuración del grupo de seguridad

source: **Required rules:**
es: **Reglas requeridas:**

source: EC2 Dashboard → Security Groups → Create Security Group
es: Panel EC2 → Grupos de seguridad → Crear grupo de seguridad

source: Add inbound rules as above
es: Agregue reglas de entrada como se indica arriba

source: Name: construbot-sg
es: Nombre: construbot-sg

source: Elastic IP
es: IP elástica

source: **Assign static IP:**
es: **Asignar IP estática:**

source: **Elastic IP charges:** You are charged when the IP is allocated but the instance is stopped. Release unused Elastic IPs to avoid charges.
es: **Cargos de IP elástica:** Se le cobra cuando se asigna la IP pero se detiene la instancia. Libere las IP elásticas no utilizadas para evitar cargos.

source: Step 2: Connect to Instance
es: Paso 2: conectarse a la instancia

source: SSH Connection
es: Conexión SSH

source: **First time connection:**
es: **Conexión por primera vez:**

source: You'll see a message about host authenticity. Type ``yes`` to continue.
es: Verás un mensaje sobre la autenticidad del host. Escriba ``sí`` para continuar.

source: Step 3: Server Setup
es: Paso 3: configuración del servidor

source: System Updates
es: Actualizaciones del sistema

source: Install Docker
es: Instalar ventana acoplable

source: Configure Firewall
es: Configurar cortafuegos

source: Step 4: Deploy Application
es: Paso 4: implementar la aplicación

source: Clone Repository
es: Repositorio de clones

source: Configure Environment
es: Configurar el entorno

source: **Minimal production .env:**
es: **Producción mínima .env:**

source: Build and Start
es: Construir y comenzar

source: Initialize Database
es: Inicializar base de datos

source: Step 5: Configure Domain and SSL
es: Paso 5: configurar el dominio y SSL

source: DNS Configuration
es: Configuración de DNS

source: **Using Route 53:**
es: **Usando la Ruta 53:**

source: **Using other DNS providers:**
es: **Usando otros proveedores de DNS:**

source: Add A record pointing to your Elastic IP:
es: Agregue un registro que apunte a su IP elástica:

source: SSL Certificate (Let's Encrypt)
es: Certificado SSL (Vamos a cifrar)

source: **Update docker-compose.yml to mount certificates:**
es: **Actualice docker-compose.yml para montar certificados:**

source: **Restart nginx:**
es: **Reiniciar nginx:**

source: Step 6: Configure AWS Services
es: Paso 6: configurar los servicios de AWS

source: RDS PostgreSQL (Recommended)
es: RDS PostgreSQL (recomendado)

source: **Benefits:**
es: **Beneficios:**

source: Automated backups
es: Copias de seguridad automatizadas

source: High availability (Multi-AZ)
es: Alta disponibilidad (Multi-AZ)

source: Automatic failover
es: Conmutación por error automática

source: Managed updates
es: Actualizaciones administradas

source: **Create RDS instance:**
es: **Crear instancia RDS:**

source: **Update .env:**
es: **Actualizar .env:**

source: **Remove postgres from docker-compose.yml.**
es: **Elimine postgres de docker-compose.yml.**

source: ElastiCache Redis (Optional)
es: ElastiCache Redis (opcional)

source: S3 for Media Files
es: S3 para archivos multimedia

source: Step 7: Automate Startup
es: Paso 7: automatizar el inicio

source: Systemd Service
es: Servicio Systemd

source: Create ``/etc/systemd/system/construbot.service``:
es: Cree ``/etc/systemd/system/construbot.service``:

source: **Enable service:**
es: **Habilitar servicio:**

source: **Application now starts automatically on boot.**
es: **La aplicación ahora se inicia automáticamente al arrancar.**

source: Step 8: Monitoring and Maintenance
es: Paso 8: Monitoreo y Mantenimiento

source: CloudWatch Monitoring
es: Monitoreo de CloudWatch

source: **Enable detailed monitoring:**
es: **Habilitar monitoreo detallado:**

source: **Create CloudWatch alarms:**
es: **Crear alarmas de CloudWatch:**

source: Automated Backups
es: Copias de seguridad automatizadas

source: **Create backup script** ``/opt/construbot/scripts/backup.sh``:
es: **Crear script de respaldo** ``/opt/construbot/scripts/backup.sh``:

source: **Schedule with cron:**
es: **Programar con cron:**

source: Log Management
es: Gestión de registros

source: **Ship logs to CloudWatch:**
es: **Enviar registros a CloudWatch:**

source: Step 9: Scaling
es: Paso 9: Escalar

source: Vertical Scaling
es: Escalado vertical

source: Horizontal Scaling
es: Escala horizontal

source: For multi-instance deployment:
es: Para implementación de múltiples instancias:

source: Use Application Load Balancer (ALB)
es: Utilice el equilibrador de carga de aplicaciones (ALB)

source: Create Auto Scaling Group
es: Crear grupo de Auto Scaling

source: Use RDS for database (required)
es: Utilice RDS para la base de datos (obligatorio)

source: Use ElastiCache for Redis (required)
es: Utilice ElastiCache para Redis (obligatorio)

source: Use S3 for media files (required)
es: Utilice S3 para archivos multimedia (obligatorio)

source: **This is beyond single-server scope** - consider using ECS or EKS for container orchestration.
es: **Esto va más allá del alcance de un solo servidor**: considere usar ECS o EKS para la orquestación de contenedores.

source: Troubleshooting
es: Solución de problemas

source: Instance Not Accessible
es: Instancia no accesible

source: Application Not Starting
es: La aplicación no se inicia

source: Out of Disk Space
es: Sin espacio en disco

source: Cost Optimization
es: Optimización de costos

source: Reduce Costs
es: Reducir costos

source: **Use Reserved Instances** - Save up to 75% for 1-3 year commitment
es: **Utilice instancias reservadas**: ahorre hasta un 75 % con un compromiso de 1 a 3 años

source: **Right-size instances** - Monitor and adjust based on actual usage
es: **Instancias del tamaño adecuado**: supervise y ajuste según el uso real

source: **Use Spot Instances** - Save up to 90% (for non-critical workloads)
es: **Utilice instancias puntuales**: ahorre hasta un 90 % (para cargas de trabajo no críticas)

source: **Enable S3 Intelligent Tiering** - Automatic cost optimization
es: **Habilitar niveles inteligentes de S3**: optimización automática de costos

source: **Set up Budget Alerts** - Monitor spending
es: **Configurar alertas de presupuesto** - Supervisar el gasto

source: **Estimated monthly costs (us-east-1):**
es: **Costos mensuales estimados (us-east-1):**

source: See Also
es: Ver también

source: `AWS EC2 Documentation <https://docs.aws.amazon.com/ec2/>`_
es: `Documentación de AWS EC2 <https://docs.aws.amazon.com/ec2/>`_
