Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/deployment/docker-compose.po
Languages: es

source: Docker Compose for Production
es: Docker Compose para producción

source: Production Docker Compose configuration for deploying Construbot.
es: Configuración de Production Docker Compose para implementar Construbot.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot includes Docker Compose configurations for both development and production:
es: Construbot incluye configuraciones de Docker Compose tanto para desarrollo como para producción:

source: ``docker-compose.yml`` - Default configuration (can be used for production)
es: ``docker-compose.yml`` - Configuración predeterminada (se puede utilizar para producción)

source: ``compose/production/`` - Production-specific Dockerfiles
es: ``compose/production/`` - Dockerfiles específicos de producción

source: This guide covers deploying Construbot using Docker Compose on a single server or multiple servers.
es: Esta guía cubre la implementación de Construbot usando Docker Compose en uno o varios servidores.

source: Production Architecture
es: Arquitectura de producción

source: Single Server Setup
es: Configuración de servidor único

source: **Suitable for:** <1000 users, small deployments
es: **Adecuado para:** <1000 usuarios, implementaciones pequeñas

source: Multi-Server Setup
es: Configuración de múltiples servidores

source: **Suitable for:** >1000 users, high availability needs
es: **Adecuado para:** >1000 usuarios, necesidades de alta disponibilidad

source: Docker Compose Configuration
es: Configuración de composición de Docker

source: Production docker-compose.yml
es: Producción docker-compose.yml

source: The included ``docker-compose.yml`` can be used for production with proper environment configuration:
es: El ``docker-compose.yml`` incluido se puede utilizar para producción con la configuración de entorno adecuada:

source: **Key services:**
es: **Servicios clave:**

source: Environment Configuration
es: Configuración del entorno

source: Production .env File
es: Archivo .env de producción

source: Create ``.env`` with production settings:
es: Cree ``.env`` con la configuración de producción:

source: Building for Production
es: Edificio para la producción

source: Initial Build
es: Construcción inicial

source: **What happens:**
es: **Lo que sucede:**

source: Builds production Docker images
es: Crea imágenes Docker de producción.

source: Starts all services in detached mode
es: Inicia todos los servicios en modo independiente

source: Creates volumes for persistent data
es: Crea volúmenes para datos persistentes.

source: Database Setup
es: Configuración de la base de datos

source: Nginx Configuration
es: Configuración de Nginx

source: Production Nginx Setup
es: Configuración de producción de Nginx

source: Create ``compose/production/nginx/nginx.conf``:
es: Cree ``componer/producción/nginx/nginx.conf``:

source: SSL Certificate
es: Certificado SSL

source: **Using Let's Encrypt:**
es: **Usando Let's Encrypt:**

source: **Mount certificates in docker-compose.yml:**
es: **Montar certificados en docker-compose.yml:**

source: Gunicorn Configuration
es: Configuración de Gunicorn

source: Production Gunicorn Settings
es: Configuración de producción de Gunicorn

source: Create ``compose/production/django/gunicorn_config.py``:
es: Cree ``compose/production/django/gunicorn_config.py``:

source: **Start command** in ``compose/production/django/start``:
es: **Iniciar comando** en ``compose/production/django/start``:

source: Managing Services
es: Servicios de gestión

source: Starting and Stopping
es: Iniciar y detener

source: Viewing Logs
es: Ver registros

source: Restarting Services
es: Reiniciar servicios

source: Scaling Services
es: Servicios de escalamiento

source: Updating Application
es: Actualización de aplicación

source: Deployment Process
es: Proceso de implementación

source: Zero-Downtime Deployment
es: Implementación sin tiempo de inactividad

source: Data Management
es: Gestión de datos

source: Database Backups
es: Copias de seguridad de bases de datos

source: **Automated backup script:**
es: **Script de copia de seguridad automatizado:**

source: **Schedule with cron:**
es: **Programar con cron:**

source: Restore Database
es: Restaurar base de datos

source: Volume Management
es: Gestión de volumen

source: **List volumes:**
es: **Listar volúmenes:**

source: **Backup volume:**
es: **Volumen de copia de seguridad:**

source: **Restore volume:**
es: **Restaurar volumen:**

source: Monitoring
es: Escucha

source: Health Checks
es: Controles de salud

source: Add health checks to ``docker-compose.yml``:
es: Agregue comprobaciones de estado a ``docker-compose.yml``:

source: Resource Usage
es: Uso de recursos

source: Logs
es: Registros

source: **Configure log rotation** in ``/etc/docker/daemon.json``:
es: **Configure la rotación de registros** en ``/etc/docker/daemon.json``:

source: Troubleshooting
es: Solución de problemas

source: Container Won't Start
es: El contenedor no arranca

source: Database Connection Issues
es: Problemas de conexión a la base de datos

source: Out of Disk Space
es: Sin espacio en disco

source: Performance Issues
es: Problemas de rendimiento

source: See Also
es: Ver también
