Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/deployment/environment-variables.po
Languages: es

source: Environment Variables
es: Variables de entorno

source: Complete reference for all environment variables used in production deployments.
es: Referencia completa para todas las variables de entorno utilizadas en implementaciones de producción.

source: Overview
es: Descripción general

source: Construbot uses environment variables for configuration following the `Twelve-Factor App <https://12factor.net/config>`_ methodology. Variables are loaded from:
es: Construbot utiliza variables de entorno para la configuración siguiendo la metodología `Twelve-Factor App <https://12factor.net/config>`_. Las variables se cargan desde:

source: ``.env`` file (development/Docker)
es: Archivo ``.env`` (desarrollo/Docker)

source: System environment (production servers)
es: Entorno del sistema (servidores de producción)

source: Container environment (Docker/Kubernetes)
es: Entorno de contenedores (Docker/Kubernetes)

source: This document focuses on **production-specific** variables. For development configuration, see :doc:`../installation/configuration`.
es: Este documento se centra en variables **específicas de la producción**. Para la configuración de desarrollo, consulte :doc:`../installation/configuration`.

source: Required Variables
es: Variables requeridas

source: Django Core
es: Núcleo de Django

source: **Type:** String
es: **Tipo:** Cadena

source: **Required:** Yes
es: **Requerido:** Sí

source: **Description:** Python path to settings module
es: **Descripción:** Ruta de Python al módulo de configuración

source: **Production value:**
es: **Valor de producción:**

source: **Values:**
es: **Valores:**

source: ``construbot.config.settings.local`` - Development
es: ``construbot.config.settings.local`` - Desarrollo

source: ``construbot.config.settings.test`` - Testing
es: ``construbot.config.settings.test`` - Pruebas

source: ``construbot.config.settings.production`` - Production
es: ``construbot.config.settings.production`` - Producción

source: **Type:** String (50+ characters)
es: **Tipo:** Cadena (más de 50 caracteres)

source: **Description:** Cryptographic signing key for sessions, cookies, CSRF tokens
es: **Descripción:** Clave de firma criptográfica para sesiones, cookies, tokens CSRF

source: **Never commit SECRET_KEY to version control!** Use different keys for dev/prod.
es: **¡Nunca envíe SECRET_KEY al control de versiones!** Utilice claves diferentes para desarrollo/producción.

source: **Generate:**
es: **Generar:**

source: **Example:**
es: **Ejemplo:**

source: **Type:** Boolean
es: **Tipo:** Booleano

source: **Description:** Enable/disable debug mode
es: **Descripción:** Activar/desactivar el modo de depuración

source: **MUST be False in production!** Debug mode exposes sensitive information.
es: **¡DEBE ser Falso en producción!** El modo de depuración expone información confidencial.

source: **Effects when True:**
es: **Efectos cuando es Verdadero:**

source: Detailed error pages with tracebacks
es: Páginas de error detalladas con rastreos

source: Exposes settings and environment variables
es: Expone configuraciones y variables de entorno.

source: Shows SQL queries
es: Muestra consultas SQL

source: Serves static files via Django (slow)
es: Sirve archivos estáticos a través de Django (lento)

source: Disables template caching
es: Deshabilita el almacenamiento en caché de plantillas

source: **Type:** Comma-separated string
es: **Tipo:** Cadena separada por comas

source: **Required:** Yes (when DEBUG=False)
es: **Obligatorio:** Sí (cuando DEBUG=False)

source: **Description:** Hosts/domains that Django serves
es: **Descripción:** Hosts/dominios a los que sirve Django

source: **Include:**
es: **Incluir:**

source: Root domain
es: Dominio raíz

source: www subdomain
es: subdominio www

source: API subdomain (if separate)
es: Subdominio API (si está separado)

source: Load balancer hostname
es: Nombre de host del equilibrador de carga

source: **Validation:**
es: **Validación:**

source: Database
es: Base de datos

source: DATABASE_URL
es: BASE DE DATOS_URL

source: **Type:** PostgreSQL connection string
es: **Tipo:** Cadena de conexión PostgreSQL

source: **Description:** Complete database connection URL
es: **Descripción:** URL completa de conexión a la base de datos

source: **Format:**
es: **Formato:**

source: **Examples:**
es: **Ejemplos:**

source: **SSL modes:**
es: **Modos SSL:**

source: ``disable`` - No SSL (not recommended for production)
es: ``disable`` - Sin SSL (no recomendado para producción)

source: ``require`` - SSL required (recommended)
es: ``require`` - Se requiere SSL (recomendado)

source: ``verify-ca`` - Verify certificate authority
es: ``verify-ca`` - Verificar autoridad de certificación

source: ``verify-full`` - Full certificate verification
es: ``verify-full`` - Verificación completa del certificado

source: Cache and Queue
es: Caché y cola

source: **Type:** Redis connection string
es: **Tipo:** Cadena de conexión de Redis

source: **Description:** Redis for caching and Celery broker
es: **Descripción:** Redis para almacenamiento en caché y corredor de apio

source: **Database numbers:**
es: **Números de base de datos:**

source: ``/0`` - Cache and sessions
es: ``/0`` - Caché y sesiones

source: ``/1`` - Celery broker (optional separation)
es: ``/1`` - Corredor de apio (separación opcional)

source: ``/2`` - Celery results (optional separation)
es: ``/2`` - Resultados de apio (separación opcional)

source: Security Settings
es: Configuración de seguridad

source: **Default:** False
es: **Predeterminado:** Falso

source: **Description:** Redirect all HTTP requests to HTTPS
es: **Descripción:** Redirigir todas las solicitudes HTTP a HTTPS

source: **Requires:**
es: **Requiere:**

source: Valid SSL certificate
es: Certificado SSL válido

source: HTTPS configured on web server/load balancer
es: HTTPS configurado en el servidor web/equilibrador de carga

source: **Type:** Tuple (header name, header value)
es: **Tipo:** Tupla (nombre del encabezado, valor del encabezado)

source: **Default:** None
es: **Predeterminado:** Ninguno

source: **Description:** Trust X-Forwarded-Proto header from proxy/load balancer
es: **Descripción:** Confiar en el encabezado X-Forwarded-Proto del proxy/equilibrador de carga

source: **When to use:**
es: **Cuándo utilizar:**

source: Behind nginx reverse proxy
es: Detrás del proxy inverso de nginx

source: Behind AWS ALB/ELB
es: Detrás de AWS ALB/ELB

source: Behind CloudFlare
es: Detrás de CloudFlare

source: HSTS (HTTP Strict Transport Security)
es: HSTS (Seguridad de transporte estricta HTTP)

source: **Type:** Integer (seconds)
es: **Tipo:** Entero (segundos)

source: **Default:** 0 (disabled)
es: **Predeterminado:** 0 (deshabilitado)

source: **Description:** Browser should only access via HTTPS for this many seconds
es: **Descripción:** El navegador solo debe acceder a través de HTTPS durante estos segundos.

source: **Test carefully before enabling!** Once set, browsers refuse HTTP connections.
es: **¡Pruébelo cuidadosamente antes de habilitarlo!** Una vez configurado, los navegadores rechazan las conexiones HTTP.

source: **Description:** Apply HSTS to all subdomains
es: **Descripción:** Aplicar HSTS a todos los subdominios

source: **Requires:** All subdomains support HTTPS
es: **Requiere:** Todos los subdominios admiten HTTPS

source: **Description:** Allow adding to browser HSTS preload lists
es: **Descripción:** Permitir agregar a las listas de precarga HSTS del navegador

source: **After enabling:**
es: **Después de habilitar:**

source: Submit domain to https://hstspreload.org/
es: Envíe el dominio a https://hstspreload.org/

source: Cookie Security
es: Seguridad de cookies

source: **Description:** Only send session cookie over HTTPS
es: **Descripción:** Enviar solo cookie de sesión a través de HTTPS

source: **Default:** True
es: **Predeterminado:** Verdadero

source: **Description:** Prevent JavaScript access to session cookie
es: **Descripción:** Impedir el acceso de JavaScript a la cookie de sesión

source: **Description:** Only send CSRF cookie over HTTPS
es: **Descripción:** Enviar solo cookie CSRF a través de HTTPS

source: **Description:** Prevent JavaScript access to CSRF cookie
es: **Descripción:** Impedir el acceso de JavaScript a la cookie CSRF

source: Content Security
es: Seguridad del contenido

source: **Description:** Prevent MIME type sniffing
es: **Descripción:** Evitar el rastreo de tipos MIME

source: **Description:** Enable browser XSS filter
es: **Descripción:** Habilitar el filtro XSS del navegador

source: **Default:** DENY
es: **Predeterminado:** NEGAR

source: **Description:** Control iframe embedding
es: **Descripción:** Controlar la incrustación de iframe

source: ``DENY`` - Cannot be embedded (recommended)
es: ``DENY`` - No se puede incrustar (recomendado)

source: ``SAMEORIGIN`` - Can embed on same domain
es: ``SAMEORIGIN`` - Se puede incrustar en el mismo dominio

source: ``ALLOW-FROM https://example.com`` - Allow specific domain
es: ``ALLOW-FROM https://example.com`` - Permitir dominio específico

source: Email Configuration
es: Configuración de correo electrónico

source: **Type:** String (Python import path)
es: **Tipo:** Cadena (ruta de importación de Python)

source: **Description:** Email backend to use
es: **Descripción:** Backend de correo electrónico para usar

source: **Production values:**
es: **Valores de producción:**

source: **Required:** If using Mailgun
es: **Requerido:** Si usa Mailgun

source: **Description:** Mailgun API key
es: **Descripción:** Clave API de Mailgun

source: **Get from:** https://app.mailgun.com/app/account/security/api_keys
es: **Obtener de:** https://app.mailgun.com/app/account/security/api_keys

source: **Description:** Verified domain for sending
es: **Descripción:** Dominio verificado para envío

source: **Type:** Email address
es: **Tipo:** Dirección de correo electrónico

source: **Description:** Default sender for emails
es: **Descripción:** Remitente predeterminado para correos electrónicos

source: **Default:** root@localhost
es: **Predeterminado:** raíz@localhost

source: **Description:** Sender for error emails
es: **Descripción:** Remitente de correos electrónicos de error

source: Static and Media Files
es: Archivos estáticos y multimedia

source: **Description:** Use AWS S3 for media file storage
es: **Descripción:** Utilice AWS S3 para el almacenamiento de archivos multimedia

source: **Required:** If USE_S3=True
es: **Obligatorio:** Si USE_S3=Verdadero

source: **Description:** AWS access key with S3 permissions
es: **Descripción:** Clave de acceso de AWS con permisos S3

source: **Description:** AWS secret key
es: **Descripción:** Clave secreta de AWS

source: **Description:** S3 bucket name for media files
es: **Descripción:** Nombre del depósito S3 para archivos multimedia

source: **Default:** us-east-1
es: **Predeterminado:** us-east-1

source: **Description:** AWS region for S3 bucket
es: **Descripción:** Región de AWS para el depósito S3

source: **Default:** None (optional)
es: **Predeterminado:** Ninguno (opcional)

source: **Description:** CloudFront or custom domain for media files
es: **Descripción:** CloudFront o dominio personalizado para archivos multimedia

source: Monitoring and Logging
es: Monitoreo y registro

source: **Type:** String (URL)
es: **Tipo:** Cadena (URL)

source: **Description:** Sentry error tracking DSN
es: **Descripción:** DSN de seguimiento de errores de Sentry

source: **Get from:** Sentry project settings
es: **Obtener de:** Configuración del proyecto Sentry

source: **Default:** production
es: **Predeterminado:** producción

source: **Description:** Environment name in Sentry
es: **Descripción:** Nombre del entorno en Sentry

source: **Type:** Float (0.0 to 1.0)
es: **Tipo:** Flotante (0,0 a 1,0)

source: **Default:** 1.0
es: **Predeterminado:** 1.0

source: **Description:** Percentage of errors to send to Sentry
es: **Descripción:** Porcentaje de errores a enviar a Sentry

source: **Default:** INFO
es: **Predeterminado:** INFORMACIÓN

source: **Description:** Minimum log level to record
es: **Descripción:** Nivel de registro mínimo para registrar

source: ``DEBUG`` - Detailed information (development only)
es: ``DEBUG`` - Información detallada (solo desarrollo)

source: ``INFO`` - General informational messages (production recommended)
es: ``INFO`` - Mensajes informativos generales (se recomienda producción)

source: ``WARNING`` - Warning messages
es: ``WARNING`` - Mensajes de advertencia

source: ``ERROR`` - Error messages only
es: ``ERROR`` - Sólo mensajes de error

source: ``CRITICAL`` - Critical errors only
es: ``CRÍTICO``: solo errores críticos

source: CORS Configuration
es: Configuración CORS

source: **Default:** Empty
es: **Predeterminado:** Vacío

source: **Description:** Allowed origins for CORS requests
es: **Descripción:** Orígenes permitidos para solicitudes CORS

source: **When needed:**
es: **Cuando sea necesario:**

source: API consumed by separate frontend
es: API consumida por una interfaz separada

source: Mobile app accessing API
es: Aplicación móvil accediendo a API

source: Different subdomain for frontend
es: Subdominio diferente para frontend

source: **Description:** Allow CORS from any origin
es: **Descripción:** Permitir CORS desde cualquier origen

source: **Never use in production!** Security risk.
es: **¡Nunca lo use en producción!** Riesgo de seguridad.

source: **Development only:**
es: **Solo desarrollo:**

source: Celery Configuration
es: Configuración de apio

source: **Default:** Uses REDIS_URL
es: **Predeterminado:** Utiliza REDIS_URL

source: **Description:** Celery message broker
es: **Descripción:** Agente de mensajes de apio

source: **Usually same as REDIS_URL** but can use different database number.
es: **Generalmente igual que REDIS_URL** pero puede usar un número de base de datos diferente.

source: **Description:** Celery result storage
es: **Descripción:** Almacenamiento de resultados de apio

source: Optional Variables
es: Variables opcionales

source: Library Mode
es: Modo biblioteca

source: **Description:** Run Construbot as Django app (not standalone)
es: **Descripción:** Ejecute Construbot como aplicación Django (no independiente)

source: **Effects:**
es: **Efectos:**

source: Disables admin interface
es: Deshabilita la interfaz de administración

source: Disables account management URLs
es: Deshabilita las URL de administración de cuentas

source: Disables standalone authentication
es: Deshabilita la autenticación independiente

source: Allows embedding in existing Django project
es: Permite incrustar en un proyecto Django existente.

source: See :doc:`../library-mode` for details.
es: Consulte :doc:`../library-mode` para obtener más detalles.

source: Database Connection Pooling
es: Agrupación de conexiones de bases de datos

source: **Default:** 0 (new connection per request)
es: **Predeterminado:** 0 (nueva conexión por solicitud)

source: **Description:** How long to reuse database connections
es: **Descripción:** ¿Cuánto tiempo se deben reutilizar las conexiones de la base de datos?

source: **Benefits:**
es: **Beneficios:**

source: Reduced database connection overhead
es: Reducción de la sobrecarga de conexión a la base de datos

source: Better performance under load
es: Mejor rendimiento bajo carga

source: Lower database resource usage
es: Menor uso de recursos de la base de datos

source: Session Storage
es: Almacenamiento de sesiones

source: **Default:** django.contrib.sessions.backends.db
es: **Predeterminado:** django.contrib.sessions.backends.db

source: **Description:** Where to store sessions
es: **Descripción:** Dónde almacenar sesiones

source: **Options:**
es: **Opciones:**

source: **Production recommendation:**
es: **Recomendación de producción:**

source: Complete Production Example
es: Ejemplo de producción completo

source: Minimal Production .env
es: Producción mínima .env

source: Comprehensive Production .env
es: Producción Integral .env

source: Validation
es: Validación

source: Check Required Variables
es: Verificar variables requeridas

source: **No warnings should appear.**
es: **No deberían aparecer advertencias.**

source: Test Configuration
es: Configuración de prueba

source: See Also
es: Ver también

source: `Django Settings Reference <https://docs.djangoproject.com/en/3.2/ref/settings/>`_
es: `Referencia de configuración de Django <https://docs.djangoproject.com/en/3.2/ref/settings/>`_
