Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/deployment/index.po
Languages: es

source: Deployment
es: Despliegue

source: Production deployment guides for Construbot on various platforms and infrastructures.
es: Guías de implementación de producción para Construbot en diversas plataformas e infraestructuras.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: This section covers deploying Construbot to production environments. Whether you're deploying to cloud infrastructure, on-premises servers, or Platform-as-a-Service (PaaS) providers, these guides will help you get Construbot running securely and efficiently.
es: Esta sección cubre la implementación de Construbot en entornos de producción. Ya sea que esté implementando en una infraestructura de nube, servidores locales o proveedores de plataforma como servicio (PaaS), estas guías lo ayudarán a lograr que Construbot funcione de manera segura y eficiente.

source: **Production deployment requires careful configuration.** Never use development settings in production. Always follow the security checklist before going live.
es: **La implementación en producción requiere una configuración cuidadosa.** Nunca utilice la configuración de desarrollo en producción. Siga siempre la lista de verificación de seguridad antes de comenzar a funcionar.

source: Deployment Options
es: Opciones de implementación

source: Construbot can be deployed using several approaches:
es: Construbot se puede implementar utilizando varios enfoques:

source: **Docker-based Deployment (Recommended)**
es: **Implementación basada en Docker (recomendada)**

source: Use Docker Compose for production orchestration
es: Utilice Docker Compose para la orquestación de producción

source: Deploy to AWS EC2, DigitalOcean, or any VPS
es: Implemente en AWS EC2, DigitalOcean o cualquier VPS

source: Consistent environment across dev and production
es: Entorno consistente en desarrollo y producción

source: Easy scaling and updates
es: Fácil escalamiento y actualizaciones

source: **Platform-as-a-Service (PaaS)**
es: **Plataforma como servicio (PaaS)**

source: Heroku, Railway, Render
es: Heroku, Ferrocarril, Hacer

source: Managed database and infrastructure
es: Base de datos e infraestructura administradas.

source: Simpler setup, less configuration
es: Configuración más sencilla, menos configuración

source: Higher cost for equivalent resources
es: Mayor costo para recursos equivalentes

source: **Traditional Server Deployment**
es: **Implementación de servidor tradicional**

source: Install directly on Linux server
es: Instalar directamente en el servidor Linux

source: More control over environment
es: Más control sobre el medio ambiente

source: Requires system administration experience
es: Requiere experiencia en administración de sistemas.

source: Manual dependency management
es: Gestión manual de dependencias.

source: Quick Start (Docker + AWS EC2)
es: Inicio rápido (Docker + AWS EC2)

source: For the impatient, here's the minimal steps to deploy:
es: Para los impacientes, estos son los pasos mínimos a seguir:

source: **For detailed instructions, see:** :doc:`aws-ec2`
es: **Para obtener instrucciones detalladas, consulte:** :doc:`aws-ec2`

source: Prerequisites
es: Requisitos previos

source: Before Deployment
es: Antes de la implementación

source: **Required:**
es: **Requerido:**

source: Domain name (for HTTPS and production use)
es: Nombre de dominio (para HTTPS y uso de producción)

source: SSL certificate (Let's Encrypt recommended)
es: Certificado SSL (se recomienda Let's Encrypt)

source: Production database (PostgreSQL 12+)
es: Base de datos de producción (PostgreSQL 12+)

source: Email service (Mailgun, SendGrid, or SES)
es: Servicio de correo electrónico (Mailgun, SendGrid o SES)

source: Basic Linux server administration knowledge
es: Conocimientos básicos de administración de servidores Linux.

source: **Recommended:**
es: **Recomendado:**

source: Redis instance for caching
es: Instancia de Redis para almacenamiento en caché

source: S3 bucket for media files
es: Depósito S3 para archivos multimedia

source: Monitoring service (Sentry)
es: Servicio de vigilancia (Sentry)

source: CDN for static files
es: CDN para archivos estáticos

source: Backup strategy
es: Estrategia de respaldo

source: **Security:**
es: **Seguridad:**

source: Firewall configuration
es: Configuración del cortafuegos

source: SSH key-based authentication
es: Autenticación basada en claves SSH

source: Non-root deployment user
es: Usuario de implementación no root

source: Regular security updates
es: Actualizaciones de seguridad periódicas

source: Infrastructure Options
es: Opciones de infraestructura

source: **Compute:**
es: **Calcular:**

source: AWS EC2 (t2.small minimum, t2.medium recommended)
es: AWS EC2 (t2.small mínimo, t2.medium recomendado)

source: DigitalOcean Droplets ($12-24/month)
es: Gotitas de DigitalOcean ($12-24/mes)

source: Google Cloud Compute Engine
es: Motor de computación en la nube de Google

source: Microsoft Azure VMs
es: Máquinas virtuales de Microsoft Azure

source: **Database:**
es: **Base de datos:**

source: AWS RDS for PostgreSQL (recommended for production)
es: AWS RDS para PostgreSQL (recomendado para producción)

source: Managed PostgreSQL (DigitalOcean, Heroku Postgres)
es: PostgreSQL administrado (DigitalOcean, Heroku Postgres)

source: Self-hosted PostgreSQL on VPS
es: PostgreSQL autohospedado en VPS

source: Minimum: db.t3.micro (AWS RDS)
es: Mínimo: db.t3.micro (AWS RDS)

source: **Storage:**
es: **Almacenamiento:**

source: AWS S3 for media files (recommended)
es: AWS S3 para archivos multimedia (recomendado)

source: DigitalOcean Spaces
es: Espacios DigitalOceánicos

source: Google Cloud Storage
es: Almacenamiento en la nube de Google

source: Azure Blob Storage
es: Almacenamiento de blobs de Azure

source: Local storage (only for small deployments)
es: Almacenamiento local (solo para implementaciones pequeñas)

source: Deployment Guides
es: Guías de implementación

source: Step-by-Step Process
es: Proceso paso a paso

source: 1. Pre-Deployment
es: 1. Pre-implementación

source: **Review checklist:**
es: **Revisar lista de verificación:**

source: **Key items:**
es: **Elementos clave:**

source: [ ] Set ``DEBUG=False``
es: [] Establecer ``DEBUG=Falso``

source: [ ] Configure ``SECRET_KEY`` (unique, strong)
es: [] Configurar ``SECRET_KEY`` (único, fuerte)

source: [ ] Set ``ALLOWED_HOSTS``
es: [] Establecer ``ALLOWED_HOSTS``

source: [ ] Configure production database
es: [] Configurar la base de datos de producción

source: [ ] Set up email service
es: [] Configurar el servicio de correo electrónico

source: [ ] Configure static/media file storage
es: [] Configurar el almacenamiento de archivos estáticos/media

source: [ ] Enable HTTPS/SSL
es: [] Habilitar HTTPS/SSL

source: [ ] Set up monitoring (Sentry)
es: [] Configurar monitoreo (Sentry)

source: 2. Infrastructure Setup
es: 2. Configuración de la infraestructura

source: **Create server instance:**
es: **Crear instancia de servidor:**

source: Choose cloud provider (AWS, DigitalOcean, etc.)
es: Elija el proveedor de la nube (AWS, DigitalOcean, etc.)

source: Select Ubuntu 22.04 LTS
es: Seleccione Ubuntu 22.04 LTS

source: Minimum: 2 CPU, 4 GB RAM
es: Mínimo: 2 CPU, 4 GB de RAM

source: Attach storage volume for database (if self-hosting)
es: Adjunte un volumen de almacenamiento para la base de datos (si es autohospedado)

source: **Configure domain:**
es: **Configurar dominio:**

source: Point A record to server IP
es: Apunte un registro a la IP del servidor

source: Configure DNS (www and root domain)
es: Configurar DNS (www y dominio raíz)

source: Set up SSL certificate (Let's Encrypt)
es: Configurar el certificado SSL (Let's Encrypt)

source: 3. Server Preparation
es: 3. Preparación del servidor

source: **Install dependencies:**
es: **Instalar dependencias:**

source: **Create deployment user:**
es: **Crear usuario de implementación:**

source: 4. Application Deployment
es: 4. Implementación de aplicaciones

source: **Clone and configure:**
es: **Clonar y configurar:**

source: **Build and run:**
es: **Construir y ejecutar:**

source: **Start services:**
es: **Iniciar servicios:**

source: 5. Post-Deployment
es: 5. Post-implementación

source: **Verify functionality:**
es: **Verificar funcionalidad:**

source: [ ] Access application via domain
es: [] Acceder a la aplicación a través del dominio

source: [ ] Test user login
es: [] Probar el inicio de sesión del usuario

source: [ ] Create test project/contract
es: [ ] Crear proyecto/contrato de prueba

source: [ ] Generate PDF report
es: [] Generar informe en PDF

source: [ ] Send test email
es: [] Enviar correo electrónico de prueba

source: [ ] Check static files loading
es: [] Verificar la carga de archivos estáticos

source: [ ] Upload test image (media files)
es: [] Cargar imagen de prueba (archivos multimedia)

source: **Set up monitoring:**
es: **Configurar monitoreo:**

source: **Configure backups:**
es: **Configurar copias de seguridad:**

source: Production Architecture
es: Arquitectura de producción

source: Recommended Setup
es: Configuración recomendada

source: **Components:**
es: **Componentes:**

source: **CDN:** Serve static files globally with low latency
es: **CDN:** Sirve archivos estáticos globalmente con baja latencia

source: **Load Balancer:** Distribute traffic, HTTPS termination, health checks
es: **Load Balancer:** Distribuir tráfico, terminación HTTPS, comprobaciones de estado

source: **Web Servers:** Django application + Gunicorn + Nginx
es: **Servidores Web:** Aplicación Django + Gunicorn + Nginx

source: **Database:** Managed PostgreSQL (RDS) with automated backups
es: **Base de datos:** PostgreSQL (RDS) administrado con copias de seguridad automatizadas

source: **Cache:** Redis for caching and Celery broker
es: **Caché:** Redis para almacenamiento en caché y agente de apio

source: **Storage:** S3 for user-uploaded media files
es: **Almacenamiento:** S3 para archivos multimedia subidos por el usuario

source: Single Server Setup
es: Configuración de servidor único

source: For smaller deployments:
es: Para implementaciones más pequeñas:

source: **Suitable for:**
es: **Adecuado para:**

source: <1000 daily active users
es: <1000 usuarios activos diarios

source: Development/staging environments
es: Entornos de desarrollo/puesta en escena

source: Small construction companies
es: Pequeñas empresas constructoras

source: Budget-constrained deployments
es: Implementaciones con presupuesto limitado

source: Backup and Restore
es: Copia de seguridad y restauración

source: Database Backups
es: Copias de seguridad de bases de datos

source: **Automated backups (AWS RDS):**
es: **Copias de seguridad automatizadas (AWS RDS):**

source: RDS automatically creates daily snapshots. Configure:
es: RDS crea automáticamente instantáneas diarias. Configurar:

source: Retention period (7-35 days)
es: Período de retención (7-35 días)

source: Backup window (low-traffic hours)
es: Ventana de respaldo (horas de poco tráfico)

source: Multi-AZ for high availability
es: Multi-AZ para alta disponibilidad

source: **Manual backups (self-hosted):**
es: **Copias de seguridad manuales (autohospedadas):**

source: **Automate with cron:**
es: **Automatizar con cron:**

source: Media File Backups
es: Copias de seguridad de archivos multimedia

source: **If using S3:**
es: **Si usa S3:**

source: Enable S3 versioning
es: Habilitar el control de versiones de S3

source: Configure lifecycle policies
es: Configurar políticas de ciclo de vida

source: Cross-region replication (optional)
es: Replicación entre regiones (opcional)

source: **If using local storage:**
es: **Si usa almacenamiento local:**

source: Restore Process
es: Proceso de restauración

source: **Database restore:**
es: **Restauración de base de datos:**

source: **Media restore:**
es: **Restauración de medios:**

source: Scaling Considerations
es: Consideraciones de escala

source: Vertical Scaling
es: Escalado vertical

source: **When to scale up:**
es: **Cuándo ampliar:**

source: High CPU usage (>70% sustained)
es: Alto uso de CPU (>70% sostenido)

source: Memory pressure
es: Presión de la memoria

source: Slow database queries
es: Consultas lentas a la base de datos.

source: Single server bottleneck
es: Cuello de botella de un solo servidor

source: **How to scale:**
es: **Cómo escalar:**

source: Increase instance size (t2.small → t2.medium → t2.large)
es: Aumentar el tamaño de la instancia (t2.small → t2.medium → t2.large)

source: Add more CPU/RAM
es: Añadir más CPU/RAM

source: Upgrade database instance
es: Actualizar instancia de base de datos

source: Use faster storage (SSD)
es: Utilice un almacenamiento más rápido (SSD)

source: Horizontal Scaling
es: Escala horizontal

source: **When to scale out:**
es: **Cuándo escalar horizontalmente:**

source: >1000 concurrent users
es: >1000 usuarios simultáneos

source: Geographic distribution needed
es: Distribución geográfica necesaria

source: High availability requirements
es: Requisitos de alta disponibilidad

source: Load balancing benefits
es: Beneficios del equilibrio de carga

source: Add more application servers
es: Agregar más servidores de aplicaciones

source: Set up load balancer
es: Configurar el equilibrador de carga

source: Use managed database (RDS)
es: Usar base de datos administrada (RDS)

source: External Redis (ElastiCache)
es: Redis externo (ElastiCache)

source: Performance Optimization
es: Optimización del rendimiento

source: Connection pooling
es: Agrupación de conexiones

source: Query optimization
es: Optimización de consultas

source: Read replicas
es: Leer réplicas

source: Database indexes
es: Índices de bases de datos

source: **Caching:**
es: **Almacenamiento en caché:**

source: Redis for session storage
es: Redis para almacenamiento de sesiones

source: Template fragment caching
es: Almacenamiento en caché de fragmentos de plantilla

source: Database query caching
es: Almacenamiento en caché de consultas de bases de datos

source: Full-page caching (Varnish)
es: Almacenamiento en caché de página completa (barniz)

source: **Static Files:**
es: **Archivos estáticos:**

source: CDN distribution
es: Distribución CDN

source: Gzip compression
es: compresión gzip

source: Browser caching headers
es: Encabezados de almacenamiento en caché del navegador

source: Image optimization
es: Optimización de imagen

source: Security Hardening
es: Refuerzo de seguridad

source: Essential Security Measures
es: Medidas de seguridad esenciales

source: **Application security:**
es: **Seguridad de la aplicación:**

source: **Server security:**
es: **Seguridad del servidor:**

source: Use Let's Encrypt for free certificates
es: Utilice Let's Encrypt para obtener certificados gratuitos

source: Enable HSTS
es: Habilitar HSTS

source: Configure secure ciphers
es: Configurar cifrados seguros

source: Set up certificate auto-renewal
es: Configurar la renovación automática del certificado

source: **Environment secrets:**
es: **Secretos del medio ambiente:**

source: Never commit secrets to git
es: Nunca compartas secretos con git

source: Use environment variables
es: Usar variables de entorno

source: Rotate credentials regularly
es: Rotar las credenciales periódicamente

source: Use secrets management (AWS Secrets Manager)
es: Utilice la gestión de secretos (AWS Secrets Manager)

source: Monitoring and Logging
es: Monitoreo y registro

source: Application Monitoring
es: Monitoreo de aplicaciones

source: **Sentry (Error Tracking):**
es: **Sentry (seguimiento de errores):**

source: **Application Performance Monitoring:**
es: **Supervisión del rendimiento de la aplicación:**

source: New Relic
es: Nueva reliquia

source: DataDog
es: Perro de datos

source: Application Insights
es: Información sobre la aplicación

source: Server Monitoring
es: Monitoreo del servidor

source: **Metrics to monitor:**
es: **Métricas a monitorear:**

source: CPU usage
es: uso de CPU

source: Memory usage
es: Uso de memoria

source: Disk space
es: Espacio en disco

source: Network traffic
es: Tráfico de red

source: Database connections
es: Conexiones de bases de datos

source: Response times
es: Tiempos de respuesta

source: **Tools:**
es: **Herramientas:**

source: CloudWatch (AWS)
es: Vigilancia de la nube (AWS)

source: Prometheus + Grafana
es: Prometeo + Grafana

source: DigitalOcean Monitoring
es: Monitoreo Digital del Océano

source: Netdata
es: datos de red

source: Log Aggregation
es: Agregación de registros

source: **Centralized logging:**
es: **Registro centralizado:**

source: CloudWatch Logs (AWS)
es: Registros de CloudWatch (AWS)

source: Papertrail
es: rastro de papel

source: Loggly
es: Lograr

source: ELK Stack (Elasticsearch, Logstash, Kibana)
es: Pila ELK (Elasticsearch, Logstash, Kibana)

source: **Log rotation:**
es: **Rotación de registros:**

source: Troubleshooting
es: Solución de problemas

source: Common Issues
es: Problemas comunes

source: **Application won't start:**
es: **La aplicación no se inicia:**

source: **502 Bad Gateway:**
es: **502 Puerta de enlace no válida:**

source: Django not running
es: Django no se ejecuta

source: Gunicorn crashed
es: Gunicorn se estrelló

source: Nginx misconfigured
es: Nginx mal configurado

source: **500 Internal Server Error:**
es: **Error interno del servidor 500:**

source: Check Sentry
es: Verificar centinela

source: Review Django logs
es: Revisar los registros de Django

source: Verify database connection
es: Verificar la conexión de la base de datos

source: **Static files not loading:**
es: **Los archivos estáticos no se cargan:**

source: Run collectstatic
es: Ejecute Collectstatic

source: Check STATIC_ROOT/STATIC_URL
es: Verifique STATIC_ROOT/STATIC_URL

source: Verify WhiteNoise configuration
es: Verificar la configuración de WhiteNoise

source: Check CDN configuration
es: Verifique la configuración de CDN

source: **Database connection errors:**
es: **Errores de conexión a la base de datos:**

source: Verify DATABASE_URL
es: Verificar DATABASE_URL

source: Check security group rules
es: Verifique las reglas del grupo de seguridad

source: Confirm database is running
es: Confirmar que la base de datos se está ejecutando

source: Test connection manually
es: Probar la conexión manualmente

source: See Also
es: Ver también

source: `Django Deployment Checklist <https://docs.djangoproject.com/en/3.2/howto/deployment/checklist/>`_
es: `Lista de verificación de implementación de Django <https://docs.djangoproject.com/en/3.2/howto/deployment/checklist/>`_
