Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/deployment/production-checklist.po
Languages: es

source: Production Checklist
es: Lista de verificación de producción

source: Complete pre-deployment checklist to ensure your Construbot installation is production-ready.
es: Complete la lista de verificación previa a la implementación para garantizar que su instalación de Construbot esté lista para producción.

source: Table of Contents
es: Tabla de contenido

source: **DO NOT deploy to production without completing this checklist!** Skipping items can lead to security vulnerabilities, data loss, or application downtime.
es: **¡NO implemente en producción sin completar esta lista de verificación!** Omitir elementos puede provocar vulnerabilidades de seguridad, pérdida de datos o tiempo de inactividad de la aplicación.

source: Overview
es: Descripción general

source: This checklist covers all critical configuration items for production deployment. Work through each section systematically and verify each item before going live.
es: Esta lista de verificación cubre todos los elementos de configuración críticos para la implementación de producción. Trabaje en cada sección de forma sistemática y verifique cada elemento antes de publicarlo.

source: **Estimated time:** 2-4 hours for first deployment
es: **Tiempo estimado:** 2-4 horas para la primera implementación

source: Critical Settings
es: Configuraciones críticas

source: DEBUG Mode
es: Modo DEPURACIÓN

source: **Verify:**
es: **Verificar:**

source: **Never run production with DEBUG=True!** This exposes:
es: **¡Nunca ejecute la producción con DEBUG=True!** Esto expone:

source: Full tracebacks with code
es: Rastreos completos con código

source: SQL queries and database schema
es: Consultas SQL y esquema de base de datos.

source: Environment variables and secrets
es: Variables de entorno y secretos.

source: Internal file paths
es: Rutas de archivos internos

source: **Test:**
es: **Prueba:**

source: **Generate:**
es: **Generar:**

source: **Set in .env:**
es: **Establecido en .env:**

source: **Set:**
es: **Colocar:**

source: Settings Module
es: Módulo de configuración

source: Security Configuration
es: Configuración de seguridad

source: **Environment variables:**
es: **Variables ambientales:**

source: **HSTS (HTTP Strict Transport Security):**
es: **HSTS (Seguridad de transporte estricta HTTP):**

source: **Test HSTS carefully!** Once enabled with preload, browsers will refuse non-HTTPS connections even if you disable it.
es: **¡Prueba HSTS cuidadosamente!** Una vez habilitado con precarga, los navegadores rechazarán conexiones que no sean HTTPS incluso si lo desactivas.

source: Cookie Security
es: Seguridad de cookies

source: Content Security
es: Seguridad del contenido

source: **Run Django security check:**
es: **Ejecute la comprobación de seguridad de Django:**

source: Expected output should have **no warnings**.
es: El resultado esperado debe tener **sin advertencias**.

source: Database Configuration
es: Configuración de base de datos

source: PostgreSQL Setup
es: Configuración de PostgreSQL

source: **Verify connection:**
es: **Verificar conexión:**

source: Database Migrations
es: Migraciones de bases de datos

source: **Apply migrations:**
es: **Aplicar migraciones:**

source: **Check status:**
es: **Verificar estado:**

source: All migrations should show ``[X]`` (applied).
es: Todas las migraciones deben mostrar ``[X]`` (aplicado).

source: Backup Strategy
es: Estrategia de respaldo

source: Enable automated backups
es: Habilitar copias de seguridad automáticas

source: Set backup window (low-traffic time)
es: Establecer ventana de respaldo (tiempo de poco tráfico)

source: Configure backup retention (7-35 days)
es: Configurar la retención de copias de seguridad (7-35 días)

source: Enable Multi-AZ for high availability
es: Habilite Multi-AZ para alta disponibilidad

source: **Self-hosted:**
es: **Autohospedado:**

source: Static and Media Files
es: Archivos estáticos y multimedia

source: Static Files
es: Archivos estáticos

source: **Collect static files:**
es: **Recopilar archivos estáticos:**

source: **WhiteNoise** is configured by default in ``construbot.config.settings.production``.
es: **WhiteNoise** está configurado de forma predeterminada en ``construbot.config.settings.production``.

source: Media Files
es: Archivos multimedia

source: **Using AWS S3:**
es: **Usando AWS S3:**

source: **S3 Bucket Configuration:**
es: **Configuración del depósito S3:**

source: Create S3 bucket
es: Crear depósito S3

source: Block public access (use signed URLs)
es: Bloquear el acceso público (use URL firmadas)

source: Configure CORS if needed
es: Configure CORS si es necesario

source: Set up lifecycle policies for old files
es: Configurar políticas de ciclo de vida para archivos antiguos

source: **Test upload:**
es: **Carga de prueba:**

source: Email Configuration
es: Configuración de correo electrónico

source: Email Service
es: Servicio de correo electrónico

source: **Using Mailgun (recommended):**
es: **Usando Mailgun (recomendado):**

source: **Using Amazon SES:**
es: **Usando Amazon SES:**

source: Email Testing
es: Prueba de correo electrónico

source: Check your inbox and spam folder.
es: Revisa tu bandeja de entrada y carpeta de spam.

source: Caching and Performance
es: Almacenamiento en caché y rendimiento

source: Redis Configuration
es: Configuración de Redis

source: **Using AWS ElastiCache:**
es: **Usando AWS ElastiCache:**

source: **Test connection:**
es: **Conexión de prueba:**

source: Celery Configuration
es: Configuración de apio

source: **Start Celery worker:**
es: **Iniciar trabajador de apio:**

source: Monitoring and Logging
es: Monitoreo y registro

source: Error Tracking
es: Seguimiento de errores

source: **Set up Sentry:**
es: **Configurar centinela:**

source: Check Sentry dashboard for the message.
es: Consulte el panel de Sentry para ver el mensaje.

source: Application Logging
es: Registro de aplicaciones

source: **Set log level:**
es: **Establecer nivel de registro:**

source: **Log aggregation options:**
es: **Opciones de agregación de registros:**

source: CloudWatch Logs (AWS)
es: Registros de CloudWatch (AWS)

source: Papertrail
es: rastro de papel

source: Loggly
es: Lograr

source: ELK Stack
es: Pila de alces

source: Server Monitoring
es: Monitoreo del servidor

source: **Uptime monitoring:**
es: **Supervisión del tiempo de actividad:**

source: UptimeRobot (free)
es: UptimeRobot (gratis)

source: StatusCake
es: pastel de estado

source: **Performance monitoring:**
es: **Monitoreo de rendimiento:**

source: New Relic
es: Nueva reliquia

source: DataDog
es: Perro de datos

source: Application Insights
es: Información sobre la aplicación

source: **Server monitoring:**
es: **Monitoreo del servidor:**

source: CloudWatch (AWS)
es: Vigilancia de la nube (AWS)

source: DigitalOcean Monitoring
es: Monitoreo Digital del Océano

source: Prometheus + Grafana
es: Prometeo + Grafana

source: Infrastructure
es: Infraestructura

source: Server Configuration
es: Configuración del servidor

source: **Firewall (UFW):**
es: **Cortafuegos (UFW):**

source: **SSH hardening:**
es: **Endurecimiento SSH:**

source: DNS Configuration
es: Configuración de DNS

source: **Example DNS records:**
es: **Ejemplos de registros DNS:**

source: Load Balancer (Optional)
es: Balanceador de carga (opcional)

source: Application Testing
es: Pruebas de aplicaciones

source: Functionality Tests
es: Pruebas de funcionalidad

source: **Checklist:**
es: **Lista de verificación:**

source: [ ] Homepage loads
es: [] Se carga la página de inicio

source: [ ] User login works
es: [] El inicio de sesión del usuario funciona

source: [ ] Dashboard displays correctly
es: [] El panel se muestra correctamente

source: [ ] Create new client (Contraparte)
es: [ ] Crear nuevo cliente (Contraparte)

source: [ ] Create new contract (Contrato)
es: [ ] Crear nuevo contrato (Contrato)

source: [ ] Add concepts (Conceptos) to contract
es: [ ] Agregar conceptos (Conceptos) al contrato

source: [ ] Create estimate (Estimación)
es: [ ] Crear presupuesto (Estimación)

source: [ ] Generate PDF document
es: [] Generar documento PDF

source: [ ] Upload image to media library
es: [] Subir imagen a la biblioteca multimedia

source: [ ] Receive email notification
es: [] Recibir notificación por correo electrónico

source: Performance Testing
es: Pruebas de rendimiento

source: **Tools:**
es: **Herramientas:**

source: Security Testing
es: Pruebas de seguridad

source: **Django security check:**
es: **Comprobación de seguridad de Django:**

source: **OWASP ZAP scan:**
es: **Escaneo OWASP ZAP:**

source: Final Verification
es: Verificación final

source: Pre-Launch Checklist
es: Lista de verificación previa al lanzamiento

source: **Critical (must be complete):**
es: **Crítico (debe estar completo):**

source: [ ] DEBUG=False
es: [] DEPURACIÓN = Falso

source: [ ] Unique, strong SECRET_KEY
es: [] Único y fuerte SECRET_KEY

source: [ ] ALLOWED_HOSTS configured
es: [] ALLOWED_HOSTS configurado

source: [ ] Production database configured
es: [ ] Base de datos de producción configurada

source: [ ] SSL certificate installed
es: [ ] Certificado SSL instalado

source: [ ] Static files collected
es: [] Archivos estáticos recopilados

source: [ ] Media storage configured
es: [] Almacenamiento de medios configurado

source: [ ] Email service working
es: [ ] Servicio de correo electrónico funcionando

source: [ ] Backups configured
es: [ ] Copias de seguridad configuradas

source: [ ] Error tracking (Sentry) configured
es: [] Seguimiento de errores (Sentry) configurado

source: **Important (strongly recommended):**
es: **Importante (muy recomendable):**

source: [ ] HSTS enabled
es: [] HSTS habilitado

source: [ ] Cookie security enabled
es: [] Seguridad de cookies habilitada

source: [ ] Redis configured
es: [] Redis configurado

source: [ ] Celery worker running
es: [] Trabajador del apio corriendo

source: [ ] Monitoring set up
es: [ ] Configuración de monitoreo

source: [ ] Logs configured
es: [ ] Registros configurados

source: [ ] DNS configured
es: [ ] DNS configurado

source: [ ] Firewall configured
es: [] Cortafuegos configurado

source: **Optional (nice to have):**
es: **Opcional (es bueno tenerlo):**

source: [ ] CDN for static files
es: [] CDN para archivos estáticos

source: [ ] CDN for media files
es: [] CDN para archivos multimedia

source: [ ] Load balancer
es: [] Equilibrador de carga

source: [ ] Multiple servers
es: [] Múltiples servidores

source: [ ] Read replicas
es: [] Leer réplicas

source: Launch Day
es: Día de lanzamiento

source: **Deployment steps:**
es: **Pasos de implementación:**

source: Backup current database
es: Copia de seguridad de la base de datos actual

source: Put application in maintenance mode
es: Poner la aplicación en modo de mantenimiento

source: Pull latest code
es: Extraer el código más reciente

source: Run migrations
es: Ejecutar migraciones

source: Collect static files
es: Recopilar archivos estáticos

source: Restart services
es: Reiniciar servicios

source: Verify functionality
es: Verificar funcionalidad

source: Remove maintenance mode
es: Eliminar el modo de mantenimiento

source: Monitor logs and Sentry
es: Monitorear registros y Sentry

source: Post-Launch Monitoring
es: Monitoreo posterior al lanzamiento

source: **First 24 hours:**
es: **Primeras 24 horas:**

source: Monitor Sentry for errors every hour
es: Supervise Sentry en busca de errores cada hora

source: Check server resources (CPU, memory, disk)
es: Verificar los recursos del servidor (CPU, memoria, disco)

source: Verify email delivery
es: Verificar la entrega de correo electrónico

source: Check application performance
es: Comprobar el rendimiento de la aplicación

source: Review user feedback
es: Revisar los comentarios de los usuarios

source: **First week:**
es: **Primera semana:**

source: Daily error reviews
es: Revisiones diarias de errores

source: Performance optimization based on real usage
es: Optimización del rendimiento basada en el uso real

source: Database query optimization
es: Optimización de consultas de base de datos

source: Adjust caching as needed
es: Ajuste el almacenamiento en caché según sea necesario

source: **Ongoing:**
es: **En curso:**

source: Weekly security updates
es: Actualizaciones de seguridad semanales

source: Monthly dependency updates
es: Actualizaciones mensuales de dependencia

source: Quarterly disaster recovery drills
es: Simulacros trimestrales de recuperación de desastres

source: Continuous monitoring and optimization
es: Monitoreo y optimización continuos

source: Troubleshooting Common Issues
es: Solución de problemas comunes

source: Application Won't Start
es: La aplicación no se inicia

source: **Check:**
es: **Controlar:**

source: Environment variables set correctly
es: Variables de entorno configuradas correctamente

source: Database accessible
es: Base de datos accesible

source: Redis accessible
es: Redis accesible

source: Migrations applied
es: Migraciones aplicadas

source: No syntax errors in settings
es: Sin errores de sintaxis en la configuración

source: **Debug:**
es: **Depurar:**

source: 502 Bad Gateway
es: 502 Puerta de enlace no válida

source: **Causes:**
es: **Causas:**

source: Gunicorn not running
es: Gunicorn no corre

source: Upstream server timeout
es: Tiempo de espera del servidor ascendente

source: Nginx misconfigured
es: Nginx mal configurado

source: **Fix:**
es: **Arreglar:**

source: 500 Internal Server Error
es: 500 Error interno del servidor

source: Check Sentry for error details
es: Verifique Sentry para obtener detalles del error

source: Review Django logs
es: Revisar los registros de Django

source: Test database connection
es: Probar la conexión de la base de datos

source: Verify all settings correct
es: Verifique que todas las configuraciones sean correctas

source: Static Files Not Loading
es: Los archivos estáticos no se cargan

source: Documentation
es: Documentación

source: Required Documentation
es: Documentación requerida

source: **Runbook should include:**
es: **El runbook debe incluir:**

source: How to deploy updates
es: Cómo implementar actualizaciones

source: How to restart services
es: Cómo reiniciar los servicios

source: How to restore from backup
es: Cómo restaurar desde una copia de seguridad

source: Common troubleshooting steps
es: Pasos comunes para la solución de problemas

source: Emergency contacts
es: Contactos de emergencia

source: See Also
es: Ver también

source: `Django Deployment Checklist <https://docs.djangoproject.com/en/3.2/howto/deployment/checklist/>`_
es: `Lista de verificación de implementación de Django <https://docs.djangoproject.com/en/3.2/howto/deployment/checklist/>`_
