Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/deployment/static-media-files.po
Languages: es

source: Static & Media Files
es: Archivos estáticos y multimedia

source: Configuration for serving static files and user-uploaded media in production.
es: Configuración para servir archivos estáticos y medios cargados por el usuario en producción.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot handles two types of files:
es: Construbot maneja dos tipos de archivos:

source: **Static files** - CSS, JavaScript, images (part of application code)
es: **Archivos estáticos**: CSS, JavaScript, imágenes (parte del código de la aplicación)

source: **Media files** - User uploads (PDFs, images, documents)
es: **Archivos multimedia**: cargas de usuarios (PDF, imágenes, documentos)

source: In production, these should be served differently than in development for performance and scalability.
es: En producción, estos deben servirse de manera diferente que en desarrollo en términos de rendimiento y escalabilidad.

source: Static Files Strategy
es: Estrategia de archivos estáticos

source: WhiteNoise (Recommended for Small Deployments)
es: WhiteNoise (recomendado para implementaciones pequeñas)

source: **What is WhiteNoise:**
es: **¿Qué es WhiteNoise?**

source: Serves static files directly from Django
es: Sirve archivos estáticos directamente desde Django

source: No separate web server configuration needed
es: No se necesita una configuración de servidor web independiente

source: Gzip compression built-in
es: Compresión Gzip incorporada

source: CDN-friendly with far-future cache headers
es: Compatible con CDN con encabezados de caché de futuro lejano

source: **Already configured** in ``construbot.config.settings.production``:
es: **Ya configurado** en ``construbot.config.settings.production``:

source: **Collect static files:**
es: **Recopilar archivos estáticos:**

source: **Verify:**
es: **Verificar:**

source: **Benefits:**
es: **Beneficios:**

source: Simple setup
es: Configuración sencilla

source: No CDN required
es: No se requiere CDN

source: Efficient for <10,000 users
es: Eficiente para <10.000 usuarios

source: Compression and caching built-in
es: Compresión y almacenamiento en caché integrados

source: For higher traffic, serve static files through a CDN:
es: Para mayor tráfico, proporcione archivos estáticos a través de una CDN:

source: **AWS CloudFront setup:**
es: **Configuración de AWS CloudFront:**

source: **Update settings:**
es: **Actualizar configuración:**

source: Global distribution
es: Distribución global

source: Lower latency
es: Menor latencia

source: Offload traffic from application servers
es: Descargar tráfico de los servidores de aplicaciones

source: Reduced bandwidth costs
es: Costos de ancho de banda reducidos

source: Media Files Strategy
es: Estrategia de archivos multimedia

source: Amazon S3 (Recommended)
es: Amazon S3 (recomendado)

source: **Why S3:**
es: **Por qué T3:**

source: Unlimited scalable storage
es: Almacenamiento escalable ilimitado

source: High availability (99.99%)
es: Alta disponibilidad (99,99%)

source: Integrated with Django via django-storages
es: Integrado con Django a través de django-storages

source: Can use CloudFront CDN
es: Puede utilizar CDN de CloudFront

source: Automatic backups with versioning
es: Copias de seguridad automáticas con versionado

source: **Setup S3 bucket:**
es: **Configurar depósito S3:**

source: **Create IAM user:**
es: **Crear usuario de IAM:**

source: **Configure Django:**
es: **Configurar Django:**

source: **Test upload:**
es: **Carga de prueba:**

source: DigitalOcean Spaces
es: Espacios DigitalOceánicos

source: **Alternative to S3:**
es: **Alternativa a S3:**

source: **Cheaper than S3** for high bandwidth usage.
es: **Más barato que S3** para un uso elevado de ancho de banda.

source: Local Storage (Small Deployments)
es: Almacenamiento local (pequeñas implementaciones)

source: For small deployments without cloud storage:
es: Para implementaciones pequeñas sin almacenamiento en la nube:

source: **Configure Nginx** to serve media files:
es: **Configure Nginx** para servir archivos multimedia:

source: **Mount media volume** in docker-compose.yml:
es: **Montar volumen de medios** en docker-compose.yml:

source: **Backup strategy required** - rsync to remote server or S3.
es: **Se requiere estrategia de respaldo** - rsync al servidor remoto o S3.

source: Static Files Configuration
es: Configuración de archivos estáticos

source: Settings Reference
es: Referencia de configuración

source: **production.py:**
es: **producción.py:**

source: Collecting Static Files
es: Recopilar archivos estáticos

source: **During deployment:**
es: **Durante la implementación:**

source: **What happens:**
es: **Lo que sucede:**

source: Gathers all static files from apps and STATICFILES_DIRS
es: Reúne todos los archivos estáticos de aplicaciones y STATICFILES_DIRS

source: Processes them (minification, hashing)
es: Los procesa (minificación, hash)

source: Copies to STATIC_ROOT (``staticfiles/``)
es: Copias a STATIC_ROOT (``staticfiles/``)

source: Creates ``staticfiles.json`` manifest
es: Crea el manifiesto ``staticfiles.json``

source: **Manifest system:**
es: **Sistema de manifiesto:**

source: Cache busting (unique filenames)
es: Eliminación de caché (nombres de archivos únicos)

source: Far-future cache headers
es: Encabezados de caché de futuro lejano

source: Automatic compression (gzip/brotli)
es: Compresión automática (gzip/brotli)

source: Custom Static Files
es: Archivos estáticos personalizados

source: **Add custom CSS/JS:**
es: **Agregar CSS/JS personalizado:**

source: **In templates:**
es: **En plantillas:**

source: **Recollect after changes:**
es: **Recordar después de los cambios:**

source: Media Files Configuration
es: Configuración de archivos multimedia

source: **production.py with S3:**
es: **producción.py con S3:**

source: File Upload Handling
es: Manejo de carga de archivos

source: **In models (example):**
es: **En modelos (ejemplo):**

source: **Upload to S3:**
es: **Subir a S3:**

source: **File URL:**
es: **URL del archivo:**

source: Signed URLs (Private Files)
es: URL firmadas (archivos privados)

source: **For secure file access:**
es: **Para acceso seguro a archivos:**

source: **Configure S3 settings:**
es: **Configurar los ajustes de S3:**

source: Optimization
es: Mejoramiento

source: Image Optimization
es: Optimización de imagen

source: **Install Pillow (already included):**
es: **Instalar almohada (ya incluida):**

source: Compression
es: Compresión

source: **Static files** (WhiteNoise handles automatically):
es: **Archivos estáticos** (WhiteNoise maneja automáticamente):

source: Gzip compression
es: compresión gzip

source: Brotli compression (if installed)
es: Compresión Brotli (si está instalada)

source: **Manual compression:**
es: **Compresión manual:**

source: Caching
es: Almacenamiento en caché

source: **Static files caching:**
es: **Almacenamiento en caché de archivos estáticos:**

source: **Media files caching:**
es: **Almacenamiento en caché de archivos multimedia:**

source: CDN Setup
es: Configuración de CDN

source: CloudFront for S3
es: Nube Frontal para S3

source: **Create distribution:**
es: **Crear distribución:**

source: **Update Django settings:**
es: **Actualizar la configuración de Django:**

source: CloudFlare
es: nubeflare

source: **Setup:**
es: **Configuración:**

source: Add domain to CloudFlare
es: Agregar dominio a CloudFlare

source: Update nameservers
es: Actualizar servidores de nombres

source: Enable caching for static/media paths
es: Habilitar el almacenamiento en caché para rutas estáticas/media

source: Configure page rules
es: Configurar reglas de página

source: **Page rule for static files:**
es: **Regla de página para archivos estáticos:**

source: Backup and Recovery
es: Copia de seguridad y recuperación

source: S3 Versioning
es: Versiones S3

source: S3 Lifecycle Policies
es: Políticas de ciclo de vida de S3

source: **Delete old files automatically:**
es: **Eliminar archivos antiguos automáticamente:**

source: Local Backup
es: Copia de seguridad local

source: **Sync S3 to local:**
es: **Sincronizar S3 con local:**

source: Troubleshooting
es: Solución de problemas

source: Static Files Not Loading
es: Los archivos estáticos no se cargan

source: File Upload Failing
es: Error al cargar el archivo

source: **Check S3 permissions:**
es: **Verifique los permisos de S3:**

source: CORS Errors
es: Errores CORS

source: **Update S3 CORS:**
es: **Actualización S3 CORS:**

source: **Allow your domain** in cors.json AllowedOrigins.
es: **Permita su dominio** en cors.json AllowedOrigins.

source: See Also
es: Ver también

source: `django-storages documentation <https://django-storages.readthedocs.io/>`_
es: `Documentación de django-storages <https://django-storages.readthedocs.io/>`_

source: `WhiteNoise documentation <http://whitenoise.evans.io/>`_
es: `Documentación de WhiteNoise <http://whitenoise.evans.io/>`_
