Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/reference/makefile-commands.po
Languages: es

source: Makefile Commands
es: Comandos de archivos Make

source: Complete reference for development Makefile commands.
es: Referencia completa para el desarrollo de comandos Makefile.

source: Overview
es: Descripción general

source: Construbot includes a Makefile with convenient development commands.
es: Construbot incluye un Makefile con convenientes comandos de desarrollo.

source: **Location:** ``/Makefile`` (project root)
es: **Ubicación:** ``/Makefile`` (raíz del proyecto)

source: Docker Commands
es: Comandos acoplables

source: Development
es: Desarrollo

source: **make dev**
es: **hacer desarrollador**

source: Start development environment
es: Iniciar entorno de desarrollo

source: **make buildev**
es: **hacer buildev**

source: Build and start development environment
es: Construir e iniciar un entorno de desarrollo.

source: **make buildprod**
es: **hacer buildprod**

source: Build production environment
es: Construir un entorno de producción

source: Container Management
es: Gestión de contenedores

source: **make down**
es: **hacer abajo**

source: Stop all containers
es: Detener todos los contenedores

source: **make clean**
es: **hacer limpio**

source: Remove all containers
es: Retire todos los contenedores

source: **make cleandb**
es: **hacer cleandb**

source: Remove database containers and volumes
es: Eliminar contenedores y volúmenes de bases de datos

source: **make cleanhard**
es: **hacer limpio**

source: Remove everything (containers, volumes, images)
es: Eliminar todo (contenedores, volúmenes, imágenes)

source: Database Commands
es: Comandos de base de datos

source: **make migrations**
es: **realizar migraciones**

source: Create and apply migrations
es: Crear y aplicar migraciones

source: **make superuser**
es: **hacer superusuario**

source: Create Django superuser
es: Crear superusuario Django

source: **make poblar**
es: **hacer poblar**

source: Populate database with test data
es: Llenar la base de datos con datos de prueba

source: Development Tools
es: Herramientas de desarrollo

source: **make shell**
es: **hacer concha**

source: Open Django shell
es: Abrir el shell de Django

source: **make runserver**
es: **crear servidor de ejecución**

source: Run server without Docker
es: Ejecutar servidor sin Docker

source: Testing Commands
es: Comandos de prueba

source: **make test**
es: **hacer prueba**

source: Run full test suite with coverage
es: Ejecute un conjunto de pruebas completo con cobertura

source: **make localtest**
es: **hacer prueba local**

source: Run tests locally (no Docker)
es: Ejecute pruebas localmente (sin Docker)

source: **make warningtest**
es: **hacer prueba de advertencia**

source: Run tests with warnings enabled
es: Ejecute pruebas con las advertencias habilitadas

source: **make current**
es: **actualizar**

source: Run tests tagged as 'current'
es: Ejecutar pruebas etiquetadas como 'actuales'

source: Requirements Management
es: Gestión de requisitos

source: **make mkenv**
es: **hacer mkenv**

source: Sync local requirements
es: Sincronizar requisitos locales

source: **make pipcompile**
es: **hacer pipcompile**

source: Compile requirements files
es: Compilar archivos de requisitos

source: Documentation Commands
es: Comandos de documentación

source: These commands are in ``docs/Makefile``:
es: Estos comandos están en ``docs/Makefile``:

source: **make html**
es: **hacer html**

source: Build English documentation
es: Construir documentación en inglés

source: **make html-es**
es: **hacer html-es**

source: Build Spanish documentation
es: Construir documentación en español

source: **make html-all**
es: **hacer html-todo**

source: Build both English and Spanish
es: Construye inglés y español.

source: **make update-translations**
es: **realizar traducciones actualizadas**

source: Update translation files
es: Actualizar archivos de traducción

source: **make livehtml**
es: **hacer livehtml**

source: Auto-rebuild documentation
es: Documentación de reconstrucción automática

source: Common Workflows
es: Flujos de trabajo comunes

source: Fresh Start
es: Nuevo comienzo

source: Daily Development
es: Desarrollo diario

source: Reset Database
es: Restablecer base de datos

source: Update Dependencies
es: Actualizar dependencias

source: Troubleshooting
es: Solución de problemas

source: **Command not found:**
es: **Comando no encontrado:**

source: Ensure you're in project root directory.
es: Asegúrate de estar en el directorio raíz del proyecto.

source: **Permission denied:**
es: **Permiso denegado:**

source: Run with sudo or fix Docker permissions:
es: Ejecute con sudo o corrija los permisos de Docker:

source: **Port already in use:**
es: **Puerto ya en uso:**

source: Stop conflicting services:
es: Detenga los servicios conflictivos:

source: See Also
es: Ver también
