Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/concepts-line-items.po
Languages: es

source: Concepts & Line Items
es: Conceptos y líneas de pedido

source: **Spanish Term:** Concepto
es: **Término en español:** Concepto

source: Understanding concepts (individual work items) in Construbot contract catalogs.
es: Comprensión de conceptos (elementos de trabajo individuales) en los catálogos de contratos de Construbot.

source: Table of Contents
es: Tabla de contenido

source: What is a Concept?
es: ¿Qué es un concepto?

source: A **Concept** (Spanish: **Concepto**) is an individual work item in a construction contract catalog. Concepts represent:
es: Un **Concepto** (español: **Concepto**) es un elemento de trabajo individual en un catálogo de contratos de construcción. Los conceptos representan:

source: Specific types of work to be performed
es: Tipos específicos de trabajo a realizar.

source: Measurable units of construction activities
es: Unidades mensurables de actividades de construcción.

source: Line items for billing and tracking
es: Líneas de pedido para facturación y seguimiento

source: Building blocks of estimates
es: Elementos básicos de las estimaciones

source: **Model:** ``construbot.proyectos.models.Concept``
es: **Modelo:** ``construbot.proyectos.modelos.Concept``

source: **Key Relationship:** Concepts belong to a contract and define what work will be done, at what quantity, and at what price.
es: **Relación clave:** Los conceptos pertenecen a un contrato y definen qué trabajo se realizará, en qué cantidad y a qué precio.

source: Concept Structure
es: Estructura del concepto

source: Basic Information
es: Información básica

source: **Required fields:**
es: **Campos obligatorios:**

source: **Code** (clave) - Unique identifier within contract catalog
es: **Código** (clave) - Identificador único dentro del catálogo de contratos

source: **Description** (concepto) - Description of the work
es: **Descripción** (concepto) - Descripción de la obra

source: **Unit** (unidad) - Unit of measurement
es: **Unidad** (unidad) - Unidad de medida

source: **Quantity** (cantidad) - Total contract quantity
es: **Cantidad** (cantidad) - Cantidad total del contrato

source: **Unit Price** (precio_unitario) - Price per unit
es: **Precio Unitario** (precio_unitario) - Precio por unidad

source: **Contract** (contrato) - Parent contract
es: **Contrato** (contrato) - Contrato matriz

source: **Optional fields:**
es: **Campos opcionales:**

source: **Notes** (notas) - Additional specifications
es: **Notas** (notas) - Especificaciones adicionales

source: **Category** (categoría) - Grouping for organization
es: **Categoría** (categoría) - Agrupación por organización

source: **Order** (orden) - Display sequence
es: **Order** (orden) - Secuencia de visualización

source: **Active** (activo) - Whether concept is currently used
es: **Activo** (activo) - Si el concepto se utiliza actualmente

source: **Calculated fields:**
es: **Campos calculados:**

source: **Total** (importe) - Quantity × Unit Price
es: **Total** (importación) - Cantidad × Precio unitario

source: Example Concept
es: Concepto de ejemplo

source: Units of Measurement
es: Unidades de medida

source: Common Units
es: Unidades comunes

source: Construbot supports various measurement units:
es: Construbot soporta varias unidades de medida:

source: **Linear measures:**
es: **Medidas lineales:**

source: **m** - Meter
es: **m** - Metro

source: **km** - Kilometer
es: **km** - Kilómetro

source: **ft** - Foot
es: **pies** - Pie

source: **Area measures:**
es: **Medidas de área:**

source: **m²** - Square meter
es: **m²** - Metro cuadrado

source: **ft²** - Square foot
es: **ft²** - Pie cuadrado

source: **Volume measures:**
es: **Medidas de volumen:**

source: **m³** - Cubic meter
es: **m³** - Metro cúbico

source: **L** - Liter
es: **L** - Litro

source: **Weight measures:**
es: **Medidas de peso:**

source: **kg** - Kilogram
es: **kg** - Kilogramo

source: **ton** - Metric ton
es: **tonelada** - Tonelada métrica

source: **Count measures:**
es: **Medidas de conteo:**

source: **pza** - Piece (Spanish: pieza)
es: **pza** - Pieza (Español: pieza)

source: **u** - Unit
es: **u** - Unidad

source: **lot** - Lot (complete set)
es: **lote** - Lote (juego completo)

source: **Service measures:**
es: **Medidas de servicio:**

source: **hr** - Hour
es: **hora** - Hora

source: **day** - Day
es: **día** - Día

source: **month** - Month
es: **mes** - Mes

source: **Model:** ``construbot.proyectos.models.Units``
es: **Modelo:** ``construbot.proyectos.modelos.Unidades``

source: Custom Units
es: Unidades personalizadas

source: Add custom units as needed:
es: Agregue unidades personalizadas según sea necesario:

source: Navigate to **Units** management
es: Vaya a administración de **Unidades**

source: Create new unit with abbreviation and description
es: Crear nueva unidad con abreviatura y descripción.

source: Use in concept catalog
es: Uso en catálogo de conceptos

source: Creating Concepts
es: Creando conceptos

source: Method 1: Manual Entry
es: Método 1: entrada manual

source: Step 1: Access Contract Catalog
es: Paso 1: Acceda al catálogo de contratos

source: Navigate to the contract
es: Navegar al contrato

source: Find **"Concepts"** or **"Catálogo de Conceptos"** section
es: Busque la sección **"Conceptos"** o **"Catálogo de Conceptos"**

source: Click **"Add Concept"** or **"Agregar Concepto"**
es: Haga clic en **"Agregar Concepto"** o **"Agregar Concepto"**

source: Step 2: Enter Concept Details
es: Paso 2: Ingrese los detalles del concepto

source: Step 3: Save
es: Paso 3: guardar

source: Click **"Save"** to add this concept to the catalog.
es: Haga clic en **"Guardar"** para agregar este concepto al catálogo.

source: **Repeat** for all concepts in the contract.
es: **Repetir** para todos los conceptos del contrato.

source: Method 2: Excel Import
es: Método 2: Importación de Excel

source: For large contracts with many concepts:
es: Para contratos grandes con muchos conceptos:

source: Step 1: Prepare Excel File
es: Paso 1: preparar el archivo Excel

source: Create spreadsheet with columns:
es: Crear hoja de cálculo con columnas:

source: Step 2: Import to Construbot
es: Paso 2: Importar a Construbot

source: Navigate to contract concepts section
es: Navegar a la sección de conceptos de contrato

source: Click **"Import from Excel"** or **"Importar desde Excel"**
es: Haga clic en **"Importar desde Excel"** o **"Importar desde Excel"**

source: Select your prepared file
es: Seleccione su archivo preparado

source: Map columns (if not auto-detected)
es: Columnas del mapa (si no se detectan automáticamente)

source: Review and confirm import
es: Revisar y confirmar la importación

source: **Benefit:** Quickly populate catalog with dozens or hundreds of concepts.
es: **Beneficio:** Complete rápidamente el catálogo con docenas o cientos de conceptos.

source: Method 3: Copy from Template
es: Método 3: copiar desde plantilla

source: If you have standard catalogs:
es: Si tiene catálogos estándar:

source: Create "template" contract with common concepts
es: Crear contrato "modelo" con conceptos comunes

source: When creating new contract, select **"Copy catalog from..."**
es: Al crear un nuevo contrato, seleccione **"Copiar catálogo de..."**

source: Choose template contract
es: Elija modelo de contrato

source: All concepts copied to new contract
es: Todos los conceptos copiados al nuevo contrato.

source: Edit quantities and prices as needed
es: Edite cantidades y precios según sea necesario

source: **Use case:** Repetitive project types with similar work items.
es: **Caso de uso:** Tipos de proyectos repetitivos con elementos de trabajo similares.

source: Catalog Organization
es: Organización del catálogo

source: Concept Codes
es: Códigos conceptuales

source: Use structured coding system for organization:
es: Utilice un sistema de codificación estructurado para la organización:

source: **Format:** ``[Category]-[Subcategory]-[Sequence]``
es: **Formato:** ``[Categoría]-[Subcategoría]-[Secuencia]``

source: **Examples:**
es: **Ejemplos:**

source: **Benefits:**
es: **Beneficios:**

source: Easy sorting and grouping
es: Fácil clasificación y agrupación

source: Quick reference
es: Referencia rápida

source: Professional appearance on documents
es: Aspecto profesional en los documentos.

source: Categories
es: Categorías

source: Group concepts into categories:
es: Agrupar conceptos en categorías:

source: **Preliminary Work:** Site prep, mobilization
es: **Trabajo preliminar:** Preparación del sitio, movilización

source: **Earthwork:** Excavation, compaction
es: **Movimiento de tierras:** Excavación, compactación

source: **Concrete Work:** Foundations, slabs, columns
es: **Trabajos de Concreto:** Cimentaciones, losas, columnas

source: **Masonry:** Block walls, brick veneer
es: **Albañilería:** Muros de block, enchapado de ladrillo

source: **Finishes:** Flooring, painting, trim
es: **Acabados:** Pisos, pintura, molduras.

source: **MEP:** Mechanical, electrical, plumbing
es: **MEP:** Mecánica, electricidad, fontanería.

source: **Purpose:** Organize large catalogs, generate category subtotals.
es: **Propósito:** Organizar catálogos grandes, generar subtotales de categorías.

source: Display Order
es: Orden de visualización

source: Use the **Order** field to control sequence:
es: Utilice el campo **Pedido** para controlar la secuencia:

source: Lower numbers appear first
es: Los números más bajos aparecen primero

source: Group related concepts together
es: Agrupar conceptos relacionados

source: Match typical construction sequence
es: Coincidir con la secuencia de construcción típica

source: Using Concepts in Estimates
es: Uso de conceptos en estimaciones

source: Concept Selection
es: Selección de conceptos

source: When creating an estimate:
es: Al crear un presupuesto:

source: Choose concepts from contract catalog
es: Elija conceptos del catálogo de contratos

source: Enter quantity completed this period
es: Ingrese la cantidad completada este período

source: System uses unit price from catalog
es: El sistema utiliza el precio unitario del catálogo.

source: Calculate line item subtotal automatically
es: Calcular el subtotal de la línea de pedido automáticamente

source: **Example:**
es: **Ejemplo:**

source: Quantity Tracking
es: Seguimiento de cantidad

source: Construbot tracks for each concept:
es: Pistas de Construbot para cada concepto:

source: **Contract Quantity:** Original scope
es: **Cantidad de contrato:** Alcance original

source: **Billed to Date:** Cumulative from all estimates
es: **Facturado hasta la fecha:** Acumulado de todas las estimaciones

source: **Remaining:** Contract - Billed
es: **Restante:** Contrato - Facturado

source: **Over/Under:** If billed exceeds contract
es: **Más/Menos:** Si la facturación excede el contrato

source: **Status Indicators:**
es: **Indicadores de estado:**

source: ✓ Complete (100% billed)
es: ✓ Completo (100% facturado)

source: ⚠ Over-billed (>100%)
es: ⚠ Sobrefacturado (>100%)

source: ◷ In Progress (<100%)
es: ◷ En curso (<100%)

source: ○ Not Started (0%)
es: ○ No iniciado (0%)

source: Price Changes
es: Cambios de precio

source: Unit Price Adjustments
es: Ajustes de precio unitario

source: If unit price needs to change:
es: Si el precio unitario necesita cambiar:

source: **Option 1: Change Order**
es: **Opción 1: Cambiar orden**

source: Create formal change order
es: Crear orden de cambio formal

source: Update concept unit price
es: Actualizar concepto de precio unitario

source: Document reason in notes
es: Razón del documento en notas.

source: Get client approval
es: Obtenga la aprobación del cliente

source: **Option 2: New Concept**
es: **Opción 2: Nuevo Concepto**

source: Keep original concept as-is
es: Mantenga el concepto original tal cual

source: Create new concept with adjusted price
es: Crear nuevo concepto con precio ajustado

source: Use for future estimates
es: Usar para estimaciones futuras

source: **Best Practice:** Document all price changes with change order references.
es: **Mejores prácticas:** Documente todos los cambios de precios con referencias de órdenes de cambio.

source: Quantity Adjustments
es: Ajustes de cantidad

source: If contract quantity changes:
es: Si la cantidad del contrato cambia:

source: **Increase Quantity:**
es: **Aumentar cantidad:**

source: Update concept quantity
es: Actualizar cantidad de concepto

source: Document change order
es: Orden de cambio de documento

source: Difference becomes additional scope
es: La diferencia se convierte en un alcance adicional

source: **Decrease Quantity:**
es: **Disminuir cantidad:**

source: Adjust estimates if needed
es: Ajustar las estimaciones si es necesario

source: Credit or reduce billing
es: Acreditar o reducir facturación

source: Hierarchical Contracts
es: Contratos jerárquicos

source: Concept Inheritance
es: Herencia del concepto

source: For parent-child contract structures:
es: Para estructuras de contrato entre padres e hijos:

source: **Parent Contract:**
es: **Contrato de padres:**

source: Contains high-level concepts
es: Contiene conceptos de alto nivel.

source: Rolled-up quantities and prices
es: Cantidades y precios acumulados

source: Summary-level tracking
es: Seguimiento a nivel de resumen

source: **Subcontract:**
es: **Subcontratar:**

source: Detailed breakdown of parent concepts
es: Desglose detallado de los conceptos principales

source: Independent catalog
es: Catálogo independiente

source: Separate tracking
es: Seguimiento separado

source: **Relationship:** Subcontract concepts can reference parent concepts for rollup reporting.
es: **Relación:** Los conceptos de subcontrato pueden hacer referencia a conceptos principales para los informes acumulativos.

source: Best Practices
es: Mejores prácticas

source: **1. Use clear, descriptive descriptions:**
es: **1. Utilice descripciones claras y descriptivas:**

source: **2. Include specifications in description:**
es: **2. Incluir especificaciones en la descripción:**

source: Key details like:
es: Detalles clave como:

source: Material grades
es: Grados de materiales

source: Installation methods
es: Métodos de instalación

source: Included components
es: Componentes incluidos

source: **3. Consistent unit usage:**
es: **3. Uso constante de la unidad:**

source: **4. Logical code structure:**
es: **4. Estructura de código lógico:**

source: Use systematic coding for easy reference.
es: Utilice codificación sistemática para facilitar la referencia.

source: **5. One concept = one measurable item:**
es: **5. Un concepto = un elemento medible:**

source: **6. Price verification:**
es: **6. Verificación de precio:**

source: Before importing or saving:
es: Antes de importar o guardar:

source: Verify unit prices match contract
es: Verificar que los precios unitarios coincidan con el contrato

source: Check decimal places
es: comprobar los decimales

source: Confirm total calculations
es: Confirmar cálculos totales

source: **7. Regular catalog review:**
es: **7. Revisión periódica del catálogo:**

source: Remove unused concepts (mark inactive)
es: Eliminar conceptos no utilizados (marcar como inactivos)

source: Update prices for escalation
es: Actualizar precios para escalamiento

source: Correct errors promptly
es: Corregir errores rápidamente

source: Common Scenarios
es: Escenarios comunes

source: Scenario 1: Standard Building Contract
es: Escenario 1: Contrato de construcción estándar

source: **Setup:**
es: **Configuración:**

source: 50 concepts across 8 categories
es: 50 conceptos en 8 categorías

source: Mix of quantities (m³, m², kg, pza)
es: Mezcla de cantidades (m³, m², kg, pza)

source: Total contract value $2,000,000
es: Valor total del contrato $2.000.000

source: **Catalog Structure:**
es: **Estructura del catálogo:**

source: Scenario 2: Unit Price Contract
es: Escenario 2: Contrato de precio unitario

source: Payment based on actual quantities
es: Pago basado en cantidades reales

source: Original quantities are estimates
es: Las cantidades originales son estimaciones.

source: Final billing based on as-built
es: Facturación final basada en obra

source: **Process:**
es: **Proceso:**

source: Set up catalog with estimated quantities
es: Configurar catálogo con cantidades estimadas

source: Bill actual quantities in estimates
es: Facturar cantidades reales en estimaciones

source: Final total may exceed or underbid original estimate
es: El total final puede exceder o ser inferior a la estimación original

source: Document variations with notes
es: Variaciones de documentos con notas.

source: Scenario 3: Lump Sum Items
es: Escenario 3: Artículos de suma global

source: Some work paid as lump sum, not unit price
es: Algunos trabajos se pagan como suma global, no como precio unitario

source: **Configuration:**
es: **Configuración:**

source: **Billing:** Bill 100% in first estimate or progressive percentage.
es: **Facturación:** Factura el 100% en primera estimación o porcentaje progresivo.

source: Reporting
es: Informes

source: Catalog Reports
es: Informes de catálogo

source: Available reports:
es: Informes disponibles:

source: **Complete Catalog:** All concepts with quantities and prices
es: **Catálogo Completo:** Todos los conceptos con cantidades y precios.

source: **Category Summary:** Totals by category
es: **Resumen de categorías:** Totales por categoría

source: **Price List:** Unit prices for reference
es: **Lista de precios:** Precios unitarios como referencia

source: **Quantity Tracking:** Contract vs. billed quantities
es: **Seguimiento de cantidades:** Contrato versus cantidades facturadas

source: Progress Reports
es: Informes de progreso

source: Track project completion:
es: Seguimiento de la finalización del proyecto:

source: **Percentage Complete:** By quantity for each concept
es: **Porcentaje completado:** Por cantidad para cada concepto

source: **Value Complete:** Dollar value billed to date
es: **Valor completo:** Valor en dólares facturado hasta la fecha

source: **Remaining Work:** Unbilled quantities and values
es: **Trabajo restante:** Cantidades y valores no facturados

source: Export Options
es: Opciones de exportación

source: **PDF:** Formatted catalog for printing/sharing
es: **PDF:** Catálogo formateado para imprimir/compartir

source: **Excel:** Editable spreadsheet for analysis
es: **Excel:** Hoja de cálculo editable para análisis

source: **CSV:** For import to estimating software
es: **CSV:** Para importar al software de estimación

source: Troubleshooting
es: Solución de problemas

source: **Concept not appearing in estimate:**
es: **Concepto que no aparece en el presupuesto:**

source: Verify concept is marked "Active"
es: Verifique que el concepto esté marcado como "Activo"

source: Check concept belongs to correct contract
es: El concepto de cheque pertenece al contrato correcto.

source: Confirm concept has quantity > 0
es: Confirmar que el concepto tiene cantidad > 0

source: Ensure user has permission to view
es: Asegúrese de que el usuario tenga permiso para ver

source: **Unit price won't update:**
es: **El precio unitario no se actualizará:**

source: Check if concept is linked to approved estimates
es: Comprobar si el concepto está vinculado a presupuestos aprobados

source: Review permission level (may require higher access)
es: Revisar el nivel de permiso (puede requerir un acceso superior)

source: Confirm change order approval if required
es: Confirmar la aprobación de la orden de cambio si es necesario

source: **Total calculation incorrect:**
es: **Cálculo total incorrecto:**

source: Verify quantity and unit price values
es: Verificar los valores de cantidad y precio unitario.

source: Check for decimal place errors
es: Compruebe si hay errores de decimales

source: Confirm proper unit of measurement
es: Confirmar la unidad de medida adecuada

source: Review for manual overrides
es: Revisión de anulaciones manuales

source: **Import failed:**
es: **Error de importación:**

source: Check Excel file format (must be .xlsx or .xls)
es: Verifique el formato del archivo Excel (debe ser .xlsx o .xls)

source: Verify column headers match expected names
es: Verifique que los encabezados de las columnas coincidan con los nombres esperados

source: Ensure no empty required fields
es: Asegúrese de que no haya campos obligatorios vacíos

source: Review for special characters in text
es: Revisión de caracteres especiales en el texto.

source: **Over-billing warnings:**
es: **Advertencias de sobrefacturación:**

source: Review estimate quantities vs. contract quantities
es: Revisar las cantidades estimadas frente a las cantidades del contrato

source: Check if change orders increased contract scope
es: Comprobar si las órdenes de cambio aumentaron el alcance del contrato

source: Verify cumulative calculations are correct
es: Verificar que los cálculos acumulativos sean correctos

source: Document justification if intentional
es: Justificación del documento si es intencional.

source: Integration with Estimating
es: Integración con la estimación

source: If you use external estimating software:
es: Si utiliza software de estimación externo:

source: **Export from Estimating Tool:**
es: **Exportar desde la herramienta de estimación:**

source: Generate final estimate with quantities and prices
es: Generar presupuesto final con cantidades y precios.

source: Export to Excel format
es: Exportar a formato Excel

source: Import to Construbot as contract catalog
es: Importar a Construbot como catálogo de contratos

source: **Sync Pricing:**
es: **Precios de sincronización:**

source: Keep Construbot catalog as master
es: Mantener el catálogo de Construbot como maestro

source: Export for estimating template
es: Exportar para plantilla de estimación

source: Import updated pricing after bid
es: Importar precios actualizados después de la oferta

source: See Also
es: Ver también
