Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/counterparties.po
Languages: es

source: Counterparties
es: Contrapartes

source: **Spanish Term:** Contraparte
es: **Término en español:** Contraparte

source: Understanding counterparties (business partners) in Construbot.
es: Comprender las contrapartes (socios comerciales) en Construbot.

source: Table of Contents
es: Tabla de contenido

source: What is a Counterparty?
es: ¿Qué es una contraparte?

source: A **Counterparty** (Spanish: **Contraparte**) is any business entity you work with on construction projects. This includes:
es: Una **Contraparte** (español: **Contraparte**) es cualquier entidad comercial con la que trabaja en proyectos de construcción. Esto incluye:

source: **Clients** who hire your company
es: **Clientes** que contratan tu empresa

source: **Subcontractors** who perform specialized work
es: **Subcontratistas** que realizan trabajos especializados

source: **Piecework Contractors** who are paid by completed work
es: **Contratistas a destajo** a quienes se les paga por trabajo completado

source: **Model:** ``construbot.proyectos.models.Contraparte``
es: **Modelo:** ``construbot.proyectos.models.Contraparte``

source: Types of Counterparties
es: Tipos de contrapartes

source: Construbot supports three types of counterparties:
es: Construbot admite tres tipos de contrapartes:

source: 1. Cliente (Client)
es: 1.Cliente (Cliente)

source: **Who they are:**
es: **Quienes son:**

source: Organizations or individuals who hire your company
es: Organizaciones o individuos que contratan su empresa

source: The entity paying for the project
es: La entidad que paga por el proyecto.

source: The contract owner
es: El dueño del contrato

source: **Use for:**
es: **Usar para:**

source: Main construction contracts
es: Principales contratos de construcción

source: Service agreements
es: Acuerdos de servicio

source: Project owners
es: Propietarios del proyecto

source: **Example:** "Acme Corporation hires your company to build a new office building"
es: **Ejemplo:** "Acme Corporation contrata a su empresa para construir un nuevo edificio de oficinas"

source: 2. Subcontratista (Subcontractor)
es: 2. Subcontratista (Subcontratista)

source: Specialized contractors performing specific work
es: Contratistas especializados que realizan trabajos específicos.

source: Hired by your company for projects
es: Contratado por su empresa para proyectos

source: Provide specialized services (electrical, plumbing, etc.)
es: Proporcionar servicios especializados (electricidad, plomería, etc.)

source: Electrical work contracts
es: Contratos de obras electricas

source: Plumbing subcontracts
es: Subcontratos de fontanería

source: HVAC installations
es: Instalaciones de climatización

source: Any specialized trade work
es: Cualquier trabajo de comercio especializado.

source: **Example:** "Your company hires an electrical contractor for building wiring"
es: **Ejemplo:** "Su empresa contrata a un contratista eléctrico para el cableado del edificio"

source: 3. Destajista (Piecework Contractor)
es: 3. Destajista (Contratista a destajo)

source: Contractors paid by completed work units
es: Contratistas pagados por unidades de trabajo completadas

source: Not hourly or salaried
es: No por horas ni asalariados

source: Compensation based on quantity completed
es: Compensación basada en la cantidad completada.

source: Construction work paid by square meter
es: Trabajos de construcción pagados por metro cuadrado.

source: Installations paid per unit
es: Instalaciones pagadas por unidad

source: Any work compensated by output
es: Cualquier trabajo compensado por la producción.

source: **Example:** "Mason paid $50 per square meter of wall built"
es: **Ejemplo:** "Albañil pagó $50 por metro cuadrado de muro construido"

source: Counterparty Information
es: Información de contraparte

source: Each counterparty record includes:
es: Cada registro de contraparte incluye:

source: Basic Information
es: Información básica

source: **Required fields:**
es: **Campos obligatorios:**

source: **Name** (nombre) - Company or individual name
es: **Nombre** (nombre) - Nombre de la empresa o individuo

source: **Type** (tipo) - Cliente, Subcontratista, or Destajista
es: **Type** (tipo) - Cliente, Subcontratista o Destajista

source: **Company** - Your company (for multi-tenant isolation)
es: **Empresa**: su empresa (para aislamiento de múltiples inquilinos)

source: **Optional fields:**
es: **Campos opcionales:**

source: **RFC** - Tax ID number (Mexico)
es: **RFC** - Número de identificación fiscal (México)

source: **Address** (dirección)
es: **Dirección** (dirección)

source: **Phone** (teléfono)
es: **Teléfono** (teléfono)

source: **Email**
es: **Correo electrónico**

source: **Contact person** (persona de contacto)
es: **Persona de contacto** (persona de contacto)

source: **Notes** (notas)
es: **Notas**

source: Creating a Counterparty
es: Crear una contraparte

source: Step 1: Access Counterparty List
es: Paso 1: Acceder a la lista de contrapartes

source: Log in to Construbot
es: Inicia sesión en Construbot

source: Navigate to **Proyectos → Contrapartes**
es: Navegue a **Proyectos → Contrapartes**

source: Click **"New Counterparty"** or **"Agregar Contraparte"**
es: Haga clic en **"Nueva Contraparte"** o **"Agregar Contraparte"**

source: Step 2: Fill Basic Information
es: Paso 2: Complete la información básica

source: Step 3: Add Contact Details
es: Paso 3: agregar detalles de contacto

source: Step 4: Save
es: Paso 4: guardar

source: Click **"Save"** or **"Guardar"** to create the counterparty.
es: Haga clic en **"Guardar"** o **"Guardar"** para crear la contraparte.

source: Using Counterparties
es: Uso de contrapartes

source: In Contracts
es: En contratos

source: When creating a contract (Contrato):
es: Al crear un contrato (Contrato):

source: Select counterparty from dropdown
es: Seleccione la contraparte del menú desplegable

source: Dropdown filtered by: - Your active company - Active counterparties only - Appropriate type for contract
es: Desplegable filtrado por: - Su empresa activa - Solo contrapartes activas - Tipo apropiado de contrato

source: **Example:**
es: **Ejemplo:**

source: **Client contracts:** Only "Cliente" type available
es: **Contratos de clientes:** Solo disponible el tipo "Cliente"

source: **Subcontracts:** Only "Subcontratista" and "Destajista"
es: **Subcontratos:** Sólo "Subcontratista" y "Destajista"

source: In Sites
es: En sitios

source: Sites (Sitios) are linked to **Client** counterparties:
es: Los sitios (Sitios) están vinculados a contrapartes del **Cliente**:

source: Each site belongs to a specific client
es: Cada sitio pertenece a un cliente específico.

source: Multiple sites per client allowed
es: Se permiten múltiples sitios por cliente

source: Sites used for contract location
es: Sitios utilizados para la ubicación del contrato.

source: See :doc:`sites-contacts` for details.
es: Consulte :doc:`sites-contacts` para obtener más detalles.

source: Best Practices
es: Mejores prácticas

source: **1. Use descriptive names:**
es: **1. Utilice nombres descriptivos:**

source: **2. Keep contact information current:**
es: **2. Mantenga la información de contacto actualizada:**

source: Update phone and email when changes occur.
es: Actualizar teléfono y correo electrónico cuando se produzcan cambios.

source: **3. One counterparty per legal entity:**
es: **3. Una contraparte por entidad jurídica:**

source: Don't create duplicates for different contacts at same company.
es: No cree duplicados para diferentes contactos de la misma empresa.

source: **4. Use appropriate type:**
es: **4. Utilice el tipo apropiado:**

source: Cliente: When they're paying you
es: Cliente: Cuando te están pagando

source: Subcontratista: When you're paying them for specialized work
es: Subcontratista: Cuando les pagas por un trabajo especializado

source: Destajista: When payment is unit-based
es: Destajista: Cuando el pago es por unidad

source: **5. Deactivate instead of delete:**
es: **5. Desactivar en lugar de eliminar:**

source: Preserves historical data and relationships.
es: Conserva datos y relaciones históricos.

source: Common Scenarios
es: Escenarios comunes

source: Scenario 1: Client with Multiple Sites
es: Escenario 1: Cliente con múltiples sitios

source: **Setup:**
es: **Configuración:**

source: Create one "Cliente" counterparty for the client
es: Crear una contraparte "Cliente" para el cliente

source: Create multiple sites under that client
es: Crear múltiples sitios bajo ese cliente

source: Create contracts associated with different sites
es: Crear contratos asociados a diferentes sitios.

source: Client: "National Retail Corp"
es: Cliente: "National Retail Corp"

source: Sites: "Store #101 - Dallas", "Store #102 - Houston"
es: Sitios: "Tienda n.° 101 - Dallas", "Tienda n.° 102 - Houston"

source: Contracts: One contract per store
es: Contratos: Un contrato por tienda

source: Scenario 2: Regular Subcontractor
es: Escenario 2: Subcontratista Regular

source: Create "Subcontratista" counterparty
es: Crear contraparte "Subcontratista"

source: Mark as active
es: Marcar como activo

source: Reuse for multiple projects
es: Reutilizar para múltiples proyectos

source: Troubleshooting
es: Solución de problemas

source: **Can't find counterparty in dropdown:**
es: **No se puede encontrar la contraparte en el menú desplegable:**

source: Check counterparty is marked "Active"
es: La contraparte del cheque está marcada como "Activa"

source: Verify counterparty type matches contract type
es: Verificar que el tipo de contraparte coincida con el tipo de contrato

source: Confirm counterparty belongs to your active company
es: Confirme que la contraparte pertenece a su empresa activa

source: **Can't delete counterparty:**
es: **No se puede eliminar la contraparte:**

source: Counterparties with contracts cannot be deleted. Instead:
es: Las contrapartes con contratos no se pueden eliminar. En cambio:

source: Mark as inactive
es: Marcar como inactivo

source: Add note explaining why retired
es: Agregar nota explicando por qué se jubiló

source: See Also
es: Ver también
