Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/estimates.po
Languages: es

source: Estimates
es: Estimaciones

source: **Spanish Term:** Estimación
es: **Término en español:** Estimación

source: Understanding estimates (progress payments) in Construbot.
es: Comprensión de estimaciones (pagos progresivos) en Construbot.

source: Table of Contents
es: Tabla de contenido

source: What is an Estimate?
es: ¿Qué es una estimación?

source: An **Estimate** (Spanish: **Estimación**) is a progress payment request for completed work on a construction project. Estimates document:
es: Una **Estimación** (español: **Estimación**) es una solicitud de pago anticipado por el trabajo completado en un proyecto de construcción. Documento de estimaciones:

source: Work completed during a specific period
es: Trabajo realizado durante un período específico.

source: Quantities of each concept (line item) executed
es: Cantidades de cada concepto (partida) ejecutadas

source: Payment amount owed for the period
es: Monto del pago adeudado por el período

source: Cumulative progress tracking
es: Seguimiento del progreso acumulado

source: **Model:** ``construbot.proyectos.models.Estimate``
es: **Modelo:** ``construbot.proyectos.modelos.Estimate``

source: **Key Concept:** Estimates are tied to contracts and track incremental billing as work progresses. Each estimate builds upon previous estimates to show cumulative project completion.
es: **Concepto clave:** Las estimaciones están vinculadas a los contratos y realizan un seguimiento de la facturación incremental a medida que avanza el trabajo. Cada estimación se basa en estimaciones anteriores para mostrar la finalización acumulada del proyecto.

source: Estimate Components
es: Estimar componentes

source: Basic Information
es: Información básica

source: **Required fields:**
es: **Campos obligatorios:**

source: **Contract** (contrato) - The parent contract being billed
es: **Contrato** (contrato): el contrato principal que se factura

source: **Estimate Number** (consecutive number) - Sequential identifier
es: **Número de estimación** (número consecutivo) - Identificador secuencial

source: **Period Start Date** (fecha_inicio_estimado)
es: **Fecha de inicio del período** (fecha_inicio_estimado)

source: **Period End Date** (fecha_final_estimado)
es: **Fecha de finalización del período** (fecha_final_estimado)

source: **Total Amount** (monto) - Calculated from line items
es: **Importe total** (monto): calculado a partir de partidas individuales

source: **Optional fields:**
es: **Campos opcionales:**

source: **Notes** (notas) - Internal notes about the estimate
es: **Notas** (notas) - Notas internas sobre el presupuesto

source: **Status** - Draft, submitted, approved, paid
es: **Estado** - Borrador, enviado, aprobado, pagado

source: **Approval Date**
es: **Fecha de aprobación**

source: **Payment Date**
es: **Fecha de pago**

source: Line Items (EstimateLineItems)
es: Elementos de línea (EstimateLineItems)

source: Each estimate contains multiple line items tracking individual concept progress:
es: Cada estimación contiene múltiples partidas que rastrean el progreso del concepto individual:

source: **Concept** (concepto) - Reference to catalog concept
es: **Concepto** (concepto) - Referencia al concepto del catálogo

source: **Quantity This Period** (cantidad_estimada) - Work completed this period
es: **Cantidad Este Período** (cantidad_estimada) - Trabajo completado este período

source: **Cumulative Quantity** (cantidad_acumulada) - Total work to date
es: **Cantidad acumulada** (cantidad_acumulada) - Trabajo total hasta la fecha

source: **Unit Price** (precio_unitario) - From contract concept
es: **Precio Unitario** (precio_unitario) - Desde concepto de contrato

source: **Subtotal** (subtotal) - Quantity × Unit Price
es: **Subtotal** (subtotal) - Cantidad × Precio unitario

source: **Related Model:** ``construbot.proyectos.models.EstimateLineItem``
es: **Modelo relacionado:** ``construbot.proyectos.models.EstimateLineItem``

source: Financial Calculations
es: Cálculos financieros

source: Estimate Amount Calculation
es: Cálculo del monto estimado

source: The estimate total is calculated as:
es: El total estimado se calcula como:

source: **Example:**
es: **Ejemplo:**

source: Cumulative Tracking
es: Seguimiento acumulativo

source: Construbot automatically tracks cumulative quantities:
es: Construbot rastrea automáticamente las cantidades acumuladas:

source: **Previous Estimates:** Sum of all prior estimate quantities
es: **Estimaciones anteriores:** Suma de todas las cantidades estimadas anteriores

source: **This Estimate:** New work completed
es: **Esta estimación:** Nuevo trabajo completado

source: **Cumulative Total:** Running total of all work to date
es: **Total acumulado:** Total acumulado de todo el trabajo hasta la fecha

source: **Remaining:** Contract quantity - Cumulative total
es: **Restante:** Cantidad del contrato - Total acumulado

source: This ensures you never over-bill a contract concept.
es: Esto garantiza que nunca sobrefacturarás un concepto de contrato.

source: Retentions (Withholdings)
es: Retenciones (Retenciones)

source: Retentions can be applied to estimates:
es: Se pueden aplicar retenciones a las estimaciones:

source: **Flat percentage:** 10% retention on all work
es: **Porcentaje fijo:** 10% de retención en todo el trabajo

source: **Multiple retentions:** Different percentages for different purposes (warranty, performance)
es: **Retenciones múltiples:** Diferentes porcentajes para diferentes propósitos (garantía, desempeño)

source: **Retention release:** Held until contract completion or milestones
es: **Liberación de retención:** Se mantiene hasta la finalización del contrato o hitos

source: See :doc:`retentions` for detailed information.
es: Consulte :doc:`retenciones` para obtener información detallada.

source: Creating an Estimate
es: Crear una estimación

source: Step 1: Access Contract
es: Paso 1: Contrato de acceso

source: Navigate to **Proyectos → Contratos**
es: Vaya a **Proyectos → Contratos**

source: Select the contract you want to bill
es: Selecciona el contrato que quieres facturar

source: Click **"Create Estimate"** or **"Nueva Estimación"**
es: Haga clic en **"Crear estimación"** o **"Nueva estimación"**

source: Step 2: Set Estimate Period
es: Paso 2: Establecer el período estimado

source: Step 3: Add Line Items
es: Paso 3: agregar líneas de pedido

source: For each concept with work completed:
es: Para cada concepto con trabajo completado:

source: Select the concept from contract catalog
es: Seleccione el concepto del catálogo de contratos

source: Enter **Quantity This Period** (work completed)
es: Ingrese **Cantidad este período** (trabajo completado)

source: System calculates: - Cumulative quantity - Subtotal (quantity × unit price) - Warnings if exceeding contract quantity
es: El sistema calcula: - Cantidad acumulada - Subtotal (cantidad × precio unitario) - Advertencias si se excede la cantidad del contrato

source: **Example Entry:**
es: **Entrada de ejemplo:**

source: Step 4: Review Totals
es: Paso 4: revisar los totales

source: Before saving, review:
es: Antes de guardar, revise:

source: **Subtotal:** Sum of all line items
es: **Subtotal:** Suma de todas las partidas

source: **Retentions:** Applied percentages
es: **Retenciones:** Porcentajes aplicados

source: **Estimate Total:** Amount to be paid
es: **Total estimado:** Monto a pagar

source: **Cumulative Progress:** Overall project completion
es: **Progreso acumulativo:** Finalización general del proyecto

source: Step 5: Save and Generate Documents
es: Paso 5: guardar y generar documentos

source: Click **"Save"** or **"Guardar"**
es: Haga clic en **"Guardar"** o **"Guardar"**

source: Generate PDF estimate document
es: Generar documento de presupuesto en PDF

source: Submit for approval (if workflow configured)
es: Enviar para aprobación (si el flujo de trabajo está configurado)

source: Track payment status
es: Seguimiento del estado de pago

source: Estimate Workflow
es: Estimar el flujo de trabajo

source: Typical Process
es: Proceso típico

source: **Draft:** Initial creation, can be edited
es: **Borrador:** Creación inicial, se puede editar

source: **Submitted:** Sent to client for review
es: **Enviado:** Enviado al cliente para su revisión

source: **Under Review:** Client reviewing estimate
es: **En revisión:** Cliente revisando estimación

source: **Approved:** Client approved, ready for payment
es: **Aprobado:** Cliente aprobado, listo para pago

source: **Paid:** Payment received and recorded
es: **Pagado:** Pago recibido y registrado

source: **Workflow Configuration:** May vary by company and contract type.
es: **Configuración del flujo de trabajo:** Puede variar según la empresa y el tipo de contrato.

source: Revisions and Corrections
es: Revisiones y correcciones

source: If an estimate needs correction:
es: Si una estimación necesita corrección:

source: **Option 1: Edit Draft**
es: **Opción 1: Editar borrador**

source: If status is still "Draft", edit directly
es: Si el estado sigue siendo "Borrador", edítelo directamente

source: Update line item quantities as needed
es: Actualizar las cantidades de artículos en línea según sea necesario

source: **Option 2: Create Adjustment**
es: **Opción 2: Crear ajuste**

source: If estimate is approved, create a new estimate
es: Si se aprueba el presupuesto, cree un nuevo presupuesto.

source: Use negative quantities to reverse errors
es: Utilice cantidades negativas para revertir errores

source: Add corrected quantities in same or next estimate
es: Agregar cantidades corregidas en la misma estimación o en la siguiente

source: **Best Practice:** Add notes explaining any adjustments for audit trail.
es: **Mejores prácticas:** Agregue notas que expliquen cualquier ajuste para el seguimiento de auditoría.

source: Hierarchical Contracts
es: Contratos jerárquicos

source: For subcontracts using hierarchical structure:
es: Para subcontratos que utilicen estructura jerárquica:

source: **Parent Contract Estimate:**
es: **Estimación del contrato para padres:**

source: Parent estimate includes own work + subcontract estimates
es: La estimación de la matriz incluye trabajo propio + estimaciones de subcontratos

source: Subcontract estimates roll up automatically
es: Las estimaciones de subcontratos se acumulan automáticamente

source: System prevents double-counting
es: El sistema evita el doble conteo

source: **Subcontract Estimate:**
es: **Estimación de subcontrato:**

source: Created independently for subcontractor work
es: Creado de forma independiente para trabajos subcontratados.

source: Linked to parent contract estimate
es: Vinculado a la estimación del contrato principal

source: Separate billing and payment tracking
es: Seguimiento separado de facturación y pagos

source: See :doc:`projects-contracts` for hierarchy details.
es: Consulte :doc:`proyectos-contratos` para obtener detalles sobre la jerarquía.

source: Best Practices
es: Mejores prácticas

source: **1. Regular billing cycles:**
es: **1. Ciclos de facturación regulares:**

source: **2. Document justification:**
es: **2. Justificación del documento:**

source: Add notes explaining: - Unusual quantities - Zero-quantity periods (weather delays, etc.) - Adjustments or corrections
es: Agregue notas explicando: - Cantidades inusuales - Períodos de cantidad cero (retrasos climáticos, etc.) - Ajustes o correcciones

source: **3. Review cumulative totals:**
es: **3. Revisar totales acumulados:**

source: Before submitting, verify: - No concepts exceed contract quantity - Cumulative percentages make sense - Previous estimates are correctly summed
es: Antes de enviar, verifique: - Ningún concepto excede la cantidad del contrato - Los porcentajes acumulados tienen sentido - Las estimaciones anteriores se suman correctamente

source: **4. Coordinate with site progress:**
es: **4. Coordinar con el progreso del sitio:**

source: Estimates should reflect actual completed work
es: Las estimaciones deben reflejar el trabajo real completado.

source: Use site photos or daily reports as backup
es: Utilice fotografías del sitio o informes diarios como respaldo

source: Don't estimate work not yet performed
es: No estime el trabajo aún no realizado

source: **5. Track payment timing:**
es: **5. Seguimiento del momento del pago:**

source: Record when estimate submitted
es: Registrar cuando se envía la estimación

source: Follow up on approvals
es: Seguimiento de aprobaciones

source: Document payment receipt
es: Recibo de pago del documento

source: Reporting and Analysis
es: Informes y análisis

source: Estimate Reports
es: Informes de estimación

source: Available reports:
es: Informes disponibles:

source: **Estimate Summary:** Single estimate with all line items
es: **Resumen de estimación:** Estimación única con todos los artículos de línea

source: **Contract Progress:** All estimates for a contract showing cumulative progress
es: **Progreso del contrato:** Todas las estimaciones de un contrato muestran el progreso acumulativo

source: **Payment Schedule:** Estimate amounts vs. payment dates
es: **Calendario de pagos:** Montos estimados versus fechas de pago

source: **Retention Tracking:** Retained amounts and releases
es: **Seguimiento de retención:** Cantidades retenidas y liberaciones

source: **Export Options:** PDF, Excel
es: **Opciones de exportación:** PDF, Excel

source: Financial Metrics
es: Métricas financieras

source: Track project health:
es: Seguimiento del estado del proyecto:

source: **Billing Rate:** Actual billed vs. planned
es: **Tasa de facturación:** Facturado real versus planificado

source: **Payment Lag:** Time from estimate submission to payment
es: **Retraso en el pago:** Tiempo desde el envío del presupuesto hasta el pago

source: **Retention Balance:** Total retained amounts
es: **Saldo de retención:** Montos totales retenidos

source: **Completion Percentage:** Cumulative quantities vs. contract quantities
es: **Porcentaje de finalización:** Cantidades acumuladas versus cantidades del contrato

source: Common Scenarios
es: Escenarios comunes

source: Scenario 1: First Estimate
es: Escenario 1: Primera estimación

source: **Setup:**
es: **Configuración:**

source: New contract with 10 concepts
es: Nuevo contrato con 10 conceptos

source: Work started, first month completed
es: Trabajo iniciado, primer mes completado.

source: 3 concepts have progress
es: 3 conceptos tienen progreso

source: **Process:**
es: **Proceso:**

source: Create Estimate #1 for Month 1
es: Cree la estimación n.º 1 para el mes 1

source: Add 3 line items with quantities
es: Agregue 3 artículos de línea con cantidades

source: Review subtotal and retentions
es: Revisar subtotal y retenciones

source: Generate PDF and submit
es: Generar PDF y enviar

source: **Result:** Establishes baseline for cumulative tracking.
es: **Resultado:** Establece una línea de base para el seguimiento acumulativo.

source: Scenario 2: Zero-Work Period
es: Escenario 2: Período de trabajo cero

source: **Situation:** Weather delay, no work completed in period
es: **Situación:** Retraso climático, no se completó ningún trabajo en el período

source: **Options:**
es: **Opciones:**

source: **Skip estimate:** Don't create estimate for period (creates gap in numbering)
es: **Omitir estimación:** No cree una estimación para el período (crea una brecha en la numeración)

source: **Zero estimate:** Create estimate with explanation in notes
es: **Estimación cero:** Crear estimación con explicación en notas

source: **Recommendation:** Create zero estimate with notes explaining delay for complete audit trail.
es: **Recomendación:** Cree una estimación cero con notas que expliquen el retraso para completar el seguimiento de auditoría.

source: Scenario 3: Over-Billing Prevention
es: Escenario 3: Prevención de sobrefacturación

source: **Situation:** Trying to bill 200 m³ but only 150 m³ remain on contract
es: **Situación:** Intento facturar 200 m³ pero solo quedan 150 m³ en contrato

source: **System Behavior:**
es: **Comportamiento del sistema:**

source: Warning displayed when quantity exceeds remaining
es: Advertencia mostrada cuando la cantidad excede el resto

source: Can still save if justified (change orders, variations)
es: Todavía se puede guardar si está justificado (órdenes de cambio, variaciones)

source: Flags for review
es: Banderas para revisión

source: **Resolution:**
es: **Resolución:**

source: Adjust quantity to 150 m³, or
es: Ajustar la cantidad a 150 m³, o

source: Create change order to increase contract quantity first
es: Crear orden de cambio para aumentar la cantidad del contrato primero

source: Troubleshooting
es: Solución de problemas

source: **Can't create estimate:**
es: **No se puede crear una estimación:**

source: Verify contract has concepts in catalog
es: Verificar que el contrato tenga conceptos en el catálogo.

source: Check contract status is active
es: Comprobar que el estado del contrato está activo

source: Confirm user has permission level (Coordinador or higher)
es: Confirmar que el usuario tiene nivel de permiso (Coordinador o superior)

source: **Quantities not calculating:**
es: **Cantidades no calculadas:**

source: Ensure unit prices are set on contract concepts
es: Garantizar que los precios unitarios se establezcan en los conceptos del contrato.

source: Verify previous estimates are saved and approved
es: Verificar que las estimaciones anteriores estén guardadas y aprobadas

source: Check for database sync issues (rare)
es: Verifique si hay problemas de sincronización de la base de datos (raro)

source: **Retentions incorrect:**
es: **Retenciones incorrectas:**

source: Review retention configuration on contract
es: Revisar la configuración de retención en el contrato

source: Verify retention percentages are current
es: Verificar que los porcentajes de retención estén actualizados

source: Check if retentions should apply to this estimate type
es: Compruebe si se deben aplicar retenciones a este tipo de estimación

source: **PDF generation fails:**
es: **La generación de PDF falla:**

source: Verify template files exist
es: Verificar que existan archivos de plantilla

source: Check media storage permissions
es: Verifique los permisos de almacenamiento de medios

source: Review error logs for specific issue
es: Revisar los registros de errores para problemas específicos

source: See Also
es: Ver también
