Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/index.po
Languages: es

source: Core Concepts
es: Conceptos básicos

source: Understanding Construbot's core concepts is essential for effectively managing your construction projects. This section explains the key entities and how they relate to each other.
es: Comprender los conceptos básicos de Construbot es esencial para gestionar eficazmente sus proyectos de construcción. Esta sección explica las entidades clave y cómo se relacionan entre sí.

source: **Spanish Terms**: Construbot uses Spanish terminology. Each concept includes the Spanish term for reference. See :doc:`/reference/glossary` for complete translations.
es: **Términos en español**: Construbot utiliza terminología en español. Cada concepto incluye el término español de referencia. Consulte :doc:`/reference/glossary` para obtener traducciones completas.

source: Overview
es: Descripción general

source: Construbot organizes construction management around these core entities:
es: Construbot organiza la gestión de la construcción en torno a estas entidades centrales:

source: Entity Relationships
es: Relaciones entre entidades

source: *(Diagram placeholder showing relationships between entities)*
es: *(Marcador de posición del diagrama que muestra las relaciones entre entidades)*

source: Key Entities
es: Entidades clave

source: Understanding how entities connect:
es: Comprender cómo se conectan las entidades:

source: Contracts
es: Contratos

source: A **Contract** (Contrato) is linked to:
es: Un **Contrato** (Contrato) está vinculado a:

source: **Counterparty** (Contraparte) - Who you have the contract with
es: **Contraparte** (Contraparte) - Con quién tiene el contrato

source: **Site** (Sitio) - Where the work happens
es: **Sitio** (Sitio) - Dónde se realiza el trabajo

source: **Concepts** (Conceptos) - What work will be done
es: **Conceptos** (Conceptos) - Qué trabajo se realizará

source: **Estimates** (Estimaciones) - Progress billing
es: **Estimaciones** (Estimaciones) - Facturación en progreso

source: **Users** - Who manages the contract
es: **Usuarios** - Quién gestiona el contrato

source: Counterparties
es: Contrapartes

source: A **Counterparty** (Contraparte) can have:
es: Una **Contraparte** (Contraparte) puede tener:

source: **Sites** (Sitios) - Multiple locations (for Clients only)
es: **Sitios** (Sitios): múltiples ubicaciones (solo para Clientes)

source: **Contacts** (Destinatarios) - People at the organization
es: **Contactos** (Destinatarios) - Personas de la organización

source: **Contracts** (Contratos) - Multiple projects
es: **Contratos** (Contratos) - Múltiples proyectos

source: Estimates
es: Estimaciones

source: An **Estimate** (Estimación) links:
es: Enlaces de **Estimación**:

source: **Contract** (Contrato) - Which project it belongs to
es: **Contrato** (Contrato) - A qué proyecto pertenece

source: **Estimate Concepts** - Quantities completed for each work item
es: **Conceptos de estimación**: cantidades completadas para cada elemento de trabajo

source: **Users** - Who drafted, supervised, and authorized it
es: **Usuarios** - Quién lo redactó, supervisó y autorizó

source: Data Hierarchy
es: Jerarquía de datos

source: Organizational Structure
es: Estructura organizacional

source: Everything is scoped to a **Company** for multi-tenancy support.
es: Todo está dirigido a una **Empresa** para soporte multiinquilino.

source: Contract Hierarchy
es: Jerarquía de contratos

source: Contracts can be hierarchical:
es: Los contratos pueden ser jerárquicos:

source: This allows tracking of subcontractor work separately while rolling up totals to the parent.
es: Esto permite realizar un seguimiento del trabajo de los subcontratistas por separado mientras se acumulan los totales al padre.

source: **Learn more:** :doc:`projects-contracts`
es: **Más información:** :doc:`proyectos-contratos`

source: Financial Flow
es: Flujo financiero

source: Understanding the financial lifecycle:
es: Comprender el ciclo de vida financiero:

source: **Contract Created**
es: **Contrato creado**

source: Total amount (monto) defined
es: Monto total (monto) definido

source: Advance payment % (anticipo) specified
es: % de pago anticipado (anticipo) especificado

source: Retentions (retenciones) configured
es: Retenciones configuradas

source: **Advance Payment**
es: **Anticipo**

source: Client pays initial percentage (e.g., 10%)
es: El cliente paga un porcentaje inicial (por ejemplo, 10%)

source: Funds mobilization and initial costs
es: Movilización de fondos y costos iniciales.

source: **Work Completed**
es: **Trabajo completado**

source: Progress is tracked
es: Se realiza un seguimiento del progreso

source: Estimates document completed work
es: Documento de estimaciones del trabajo completado.

source: **Estimate Created**
es: **Estimación creada**

source: Quantities for each concept recorded
es: Cantidades por cada concepto registrado

source: System calculates:
es: El sistema calcula:

source: Subtotal for completed work
es: Subtotal del trabajo completado

source: Minus: Advance amortization (recovery of advance)
es: Menos: Amortización anticipada (recuperación del anticipo)

source: Minus: Retentions (withholdings)
es: Menos: Retenciones (retenciones)

source: Equals: Net payment due
es: Equivale a: pago neto adeudado

source: **Invoicing & Payment**
es: **Facturación y pago**

source: Estimate marked as invoiced (facturada)
es: Estimación marcada como facturada

source: Payment received
es: Pago recibido

source: Estimate marked as paid (pagada)
es: Estimación marcada como pagada

source: **Final Payment**
es: **Pago final**

source: All work completed
es: Todo el trabajo completado

source: Retained amounts released
es: Cantidades retenidas liberadas

source: Contract closed
es: Contrato cerrado

source: **Learn more:** :doc:`estimates`, :doc:`retentions`
es: **Más información:** :doc:`estimaciones`, :doc:`retenciones`

source: Common Workflows
es: Flujos de trabajo comunes

source: The typical workflow combines these concepts:
es: El flujo de trabajo típico combina estos conceptos:

source: **Project Setup**
es: **Configuración del proyecto**

source: Create Client (Contraparte - Cliente)
es: Crear Cliente (Contraparte - Cliente)

source: Create Site (Sitio)
es: Crear sitio (Sitio)

source: Create Contacts (Destinatarios)
es: Crear Contactos (Destinatarios)

source: Create Contract (Contrato)
es: Crear contrato (Contrato)

source: Add Work Items (Conceptos)
es: Agregar elementos de trabajo (conceptos)

source: Configure Retentions (Retenciones)
es: Configurar Retenciones

source: **Execution**
es: **Ejecución**

source: Complete work on site
es: Trabajo completo en sitio.

source: Create Estimate (Estimación)
es: Crear Estimación

source: Document quantities for each Concept
es: Cantidades de documentos para cada Concepto

source: Generate PDF
es: Generar PDF

source: Submit to client
es: Enviar al cliente

source: **Financial Tracking**
es: **Seguimiento financiero**

source: Mark estimate as Invoiced
es: Marcar estimación como facturada

source: Receive payment
es: Recibir pago

source: Mark estimate as Paid
es: Marcar estimación como pagada

source: Monitor dashboard for outstanding amounts
es: Supervisar el panel de control para detectar importes pendientes

source: Terminology Quick Reference
es: Referencia rápida de terminología

source: Spanish Term
es: Término español

source: English Translation
es: Traducción al inglés

source: Description
es: Descripción

source: Contract / Project
es: Contrato / Proyecto

source: Main construction project
es: Proyecto de construcción principal

source: Counterparty
es: Contraparte

source: Business partner
es: Compañero de negocios

source: Client
es: Cliente

source: Customer paying for work
es: Cliente pagando por el trabajo

source: Piecework Contractor
es: Contratista a destajo

source: Worker paid by task
es: Trabajador pagado por tarea

source: Subcontractor
es: Subcontratista

source: Specialized contractor
es: Contratista especializado

source: Site
es: Sitio

source: Construction location
es: Ubicación de la construcción

source: Destinatario
es: Destinotario

source: Contact / Recipient
es: Contacto / Destinatario

source: Person at organization
es: Persona en la organización

source: Estimate
es: Estimar

source: Progress payment
es: Pago progresivo

source: Concept / Line Item
es: Concepto/línea de pedido

source: Work item
es: Elemento de trabajo

source: Retention
es: Retención

source: Withholding
es: Retención

source: Advance
es: Avance

source: Down payment
es: Depósito

source: Monto
es: monte

source: Amount
es: Cantidad

source: Total value
es: Valor total

source: **Full glossary:** :doc:`/reference/glossary`
es: **Glosario completo:** :doc:`/reference/glossary`

source: Detailed Concepts
es: Conceptos detallados

source: Next Steps
es: Próximos pasos

source: **Understand each concept** by reading the detailed pages
es: **Comprenda cada concepto** leyendo las páginas detalladas

source: **Learn workflows** in :doc:`/user-guide/workflows/index`
es: **Aprende flujos de trabajo** en :doc:`/user-guide/workflows/index`

source: **Explore features** in :doc:`/user-guide/features/index`
es: **Explore funciones** en :doc:`/user-guide/features/index`

source: Start with :doc:`projects-contracts` as it's the central entity in Construbot.
es: Comience con :doc:`proyectos-contratos` ya que es la entidad central en Construbot.
