Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/projects-contracts.po
Languages: es

source: Projects & Contracts
es: Proyectos y Contratos

source: **Spanish Term:** Contrato
es: **Término en español:** Contrato

source: In Construbot, "Contrato" refers to both construction projects and contracts. The system supports hierarchical contracts (sub-contracts).
es: En Construbot, "Contrato" se refiere tanto a proyectos de construcción como a contratos. El sistema soporta contratos jerárquicos (subcontratos).

source: Overview
es: Descripción general

source: A **Contract** (Contrato) is the central entity in Construbot, representing a construction project or agreement. Every aspect of work tracking, billing, and financial management revolves around contracts.
es: Un **Contrato** (Contrato) es la entidad central en Construbot, que representa un proyecto o acuerdo de construcción. Todos los aspectos del seguimiento del trabajo, la facturación y la gestión financiera giran en torno a los contratos.

source: **Key Characteristics:**
es: **Características clave:**

source: Hierarchical structure (parent/child relationships)
es: Estructura jerárquica (relaciones padre/hijo)

source: Associated with a Counterparty (business partner)
es: Asociado con una Contraparte (socio comercial)

source: Linked to a construction Site (location)
es: Vinculado a un sitio de construcción (ubicación)

source: Contains a catalog of work items (Concepts)
es: Contiene un catálogo de elementos de trabajo (Conceptos)

source: Tracks progress through Estimates
es: Realiza un seguimiento del progreso a través de estimaciones

source: Manages financial aspects (amount, advance, retentions)
es: Gestiona aspectos financieros (monto, anticipo, retenciones)

source: What is a Contract?
es: ¿Qué es un contrato?

source: A contract in Construbot represents:
es: Un contrato en Construbot representa:

source: **Legal Agreement**
es: **Acuerdo Legal**

source: The formal contract or agreement with a client, subcontractor, or piecework contractor.
es: El contrato o acuerdo formal con un cliente, subcontratista o contratista a destajo.

source: **Project Container**
es: **Contenedor de proyecto**

source: A project that groups related work, estimates, and financial tracking.
es: Un proyecto que agrupa trabajos relacionados, estimaciones y seguimiento financiero.

source: **Financial Framework**
es: **Marco financiero**

source: Defines the total amount, advance payment, and retention rules.
es: Define el monto total, el pago por adelantado y las reglas de retención.

source: **Work Catalog**
es: **Catálogo de Trabajo**

source: Contains all work items (concepts) to be executed.
es: Contiene todos los elementos de trabajo (conceptos) que se ejecutarán.

source: Contract Components
es: Componentes del contrato

source: Basic Information
es: Información básica

source: **Reference Number** (Folio)
es: **Número de Referencia** (Folio)

source: Sequential ID for contracts within your company (e.g., 1, 2, 3...).
es: ID secuencial para contratos dentro de su empresa (por ejemplo, 1, 2, 3...).

source: **Contract Code** (Código)
es: **Código de contrato** (Código)

source: Your internal code matching the signed contract (e.g., "CONT-2024-001").
es: Su código interno que coincide con el contrato firmado (por ejemplo, "CONT-2024-001").

source: **Contract Name** (Nombre del contrato)
es: **Nombre del contrato** (Nombre del contrato)

source: Full descriptive name used in estimates and reports.
es: Nombre descriptivo completo utilizado en estimaciones e informes.

source: *Example: "Downtown Office Tower - Complete Construction Phase 1"*
es: *Ejemplo: "Torre de oficinas en el centro: finalización de la fase de construcción 1"*

source: **Short Name** (Nombre corto)
es: **Nombre corto** (Nombre corto)

source: Abbreviated name for lists and navigation.
es: Nombre abreviado para listas y navegación.

source: *Example: "Office Tower P1"*
es: *Ejemplo: "Torre de Oficinas P1"*

source: **Date** (Fecha)
es: **Fecha** (Fecha)

source: Contract signing or start date.
es: Firma del contrato o fecha de inicio.

source: Relationships
es: Relaciones

source: **Counterparty** (Contraparte)
es: **Contraparte** (Contraparte)

source: The business partner for this contract. Must be one of:
es: El socio comercial de este contrato. Debe ser uno de:

source: **Client** (Cliente) - If you're performing work for them
es: **Cliente** (Cliente) - Si estás realizando un trabajo para ellos

source: **Subcontractor** (Subcontratista) - If they're performing specialized work for you
es: **Subcontratista** (Subcontratista): si realiza un trabajo especializado para usted

source: **Piecework Contractor** (Destajista) - If they're doing task-based work
es: **Contratista a destajo** (Destajista): si realiza trabajo basado en tareas

source: **Site** (Sitio)
es: **Sitio** (Sitio)

source: The construction location where work will be performed. Must be associated with a Client counterparty.
es: El lugar de construcción donde se realizará el trabajo. Debe estar asociado con una contraparte del Cliente.

source: **Users** (Usuarios)
es: **Usuarios** (Usuarios)

source: Team members assigned to this contract. Only assigned users can view/edit the contract.
es: Miembros del equipo asignados a este contrato. Sólo los usuarios asignados pueden ver/editar el contrato.

source: Financial Fields
es: Campos financieros

source: **Amount** (Monto)
es: **Cantidad** (Monto)

source: Total contract value, typically specified **without VAT/IVA**.
es: Valor total del contrato, normalmente especificado **sin IVA/IVA**.

source: *Example: $1,000,000.00*
es: *Ejemplo: $1,000,000.00*

source: **Advance Payment** (Anticipo)
es: **Pago Anticipado** (Anticipo)

source: Percentage (0-100%) paid upfront by the client for mobilization. This amount will be amortized (recovered) across subsequent estimates.
es: Porcentaje (0-100%) pagado por adelantado por el cliente para la movilización. Este monto será amortizado (recuperado) a través de estimaciones posteriores.

source: *Example: 10% = $100,000.00 advance on a $1,000,000 contract*
es: *Ejemplo: 10% = $100,000.00 de anticipo en un contrato de $1,000,000*

source: **Status** (Status)
es: **Estado** (Estado)

source: Boolean indicating if the project is **ongoing** (active) or **completed** (inactive).
es: Booleano que indica si el proyecto está **en curso** (activo) o **completado** (inactivo).

source: Documents
es: Documentos

source: **Contract PDF** (PDF del Contrato)
es: **PDF del Contrato** (PDF del Contrato)

source: Upload the signed contract document for reference.
es: Cargue el documento del contrato firmado como referencia.

source: Hierarchical Structure
es: Estructura jerárquica

source: One of Construbot's powerful features is **hierarchical contracts** using parent-child relationships.
es: Una de las poderosas características de Construbot son los **contratos jerárquicos** que utilizan relaciones entre padres e hijos.

source: Why Use Hierarchy?
es: ¿Por qué utilizar la jerarquía?

source: **Separate Sub-Contractor Management**
es: **Gestión independiente de subcontratistas**

source: Track work by different subcontractors under a main contract:
es: Seguimiento del trabajo de diferentes subcontratistas bajo un contrato principal:

source: **Consolidated Reporting**
es: **Informes consolidados**

source: Generate reports that roll up totals from all sub-contracts to the parent.
es: Genere informes que resumen los totales de todos los subcontratos al padre.

source: **Different Teams**
es: **Diferentes equipos**

source: Assign different users to different sub-contracts while maintaining overall project visibility.
es: Asigne diferentes usuarios a diferentes subcontratos mientras mantiene la visibilidad general del proyecto.

source: **Clear Financial Separation**
es: **Separación financiera clara**

source: Track costs and progress separately for each specialized area.
es: Realice un seguimiento de los costos y el progreso por separado para cada área especializada.

source: Creating Hierarchy
es: Creando jerarquía

source: **Parent Contract:**
es: **Contrato de padres:**

source: Create a main contract using the standard "Create Contract" form.
es: Cree un contrato principal utilizando el formulario estándar "Crear contrato".

source: **Child Contracts:**
es: **Contratos infantiles:**

source: Use the "Create Sub-Contract" option and select the parent contract.
es: Utilice la opción "Crear subcontrato" y seleccione el contrato principal.

source: **Tree Operations:**
es: **Operaciones de árbol:**

source: Add multiple children to any parent
es: Agregar varios hijos a cualquier padre

source: Add children to children (multi-level hierarchy)
es: Agregar hijos a hijos (jerarquía multinivel)

source: Move contracts within the tree (with caution)
es: Mover contratos dentro del árbol (con precaución)

source: **Deletion Rules**: You cannot delete a parent contract that has children. Delete all child contracts first.
es: **Reglas de eliminación**: No puede eliminar un contrato principal que tenga hijos. Primero elimine todos los contratos secundarios.

source: Contract Lifecycle
es: Ciclo de vida del contrato

source: 1. Creation
es: 1. Creación

source: **Initial Setup:**
es: **Configuración inicial:**

source: Create or select Counterparty
es: Crear o seleccionar Contraparte

source: Create or select Site
es: Crear o seleccionar sitio

source: Define contract details (folio, name, amount, date)
es: Definir detalles del contrato (folio, nombre, monto, fecha)

source: Set advance payment percentage
es: Establecer porcentaje de pago por adelantado

source: Assign users
es: Asignar usuarios

source: Upload signed contract PDF (optional)
es: Cargar el contrato firmado en PDF (opcional)

source: **Result:** Empty contract ready for work catalog.
es: **Resultado:** Contrato vacío listo para catálogo de trabajo.

source: 2. Catalog Definition
es: 2. Definición del catálogo

source: **Add Work Items (Concepts):**
es: **Agregar elementos de trabajo (conceptos):**

source: Manually enter each work item, OR
es: Ingresar manualmente cada elemento de trabajo, O

source: Import from Excel spreadsheet
es: Importar desde hoja de cálculo de Excel

source: **Define Retentions:**
es: **Definir Retenciones:**

source: Add percentage-based retentions (e.g., 5%)
es: Agregar retenciones basadas en porcentajes (por ejemplo, 5%)

source: Add fixed-amount retentions (e.g., $10,000)
es: Agregue retenciones de monto fijo (por ejemplo, $10,000)

source: **Result:** Contract with complete work catalog and retention rules.
es: **Resultado:** Contrato con catálogo de obra completo y reglas de retención.

source: 3. Execution
es: 3. Ejecución

source: **Track Progress:**
es: **Seguimiento del progreso:**

source: Create periodic estimates (Estimaciones)
es: Crear estimaciones periódicas (Estimaciones)

source: Document completed quantities for each concept
es: Documentar cantidades completadas por cada concepto.

source: Generate PDF estimates
es: Generar estimaciones en PDF

source: Submit to client for approval
es: Enviar al cliente para su aprobación

source: **Result:** Work progress documented, payments tracked.
es: **Resultado:** Progreso del trabajo documentado, seguimiento de los pagos.

source: 4. Financial Management
es: 4. Gestión financiera

source: **Payment Tracking:**
es: **Seguimiento de pagos:**

source: Mark estimates as invoiced (facturada)
es: Marcar estimaciones como facturadas (facturadas)

source: Record when payments are received (pagada)
es: Registrar cuando se reciben los pagos (pagada)

source: Monitor outstanding amounts on dashboard
es: Supervise los importes pendientes en el panel de control

source: **Automatic Calculations:**
es: **Cálculos automáticos:**

source: Advance amortization across estimates
es: Amortización anticipada entre estimaciones

source: Retention deductions
es: Deducciones de retención

source: Accumulated totals
es: Totales acumulados

source: **Result:** Clear financial visibility.
es: **Resultado:** Clara visibilidad financiera.

source: 5. Completion
es: 5. Finalización

source: **Project Close:**
es: **Cierre del proyecto:**

source: Final estimate created
es: Estimación final creada

source: All work completed
es: Todo el trabajo completado

source: Final payment received (including retained amounts)
es: Pago final recibido (incluidos los importes retenidos)

source: Contract status set to inactive
es: Estado del contrato establecido en inactivo

source: **Result:** Closed project with complete financial history.
es: **Resultado:** Proyecto cerrado con historial financiero completo.

source: Contract Types by Counterparty
es: Tipos de contrato por contraparte

source: Client Contracts
es: Contratos de clientes

source: **When:** Your company is the contractor performing work.
es: **Cuándo:** Su empresa es el contratista que realiza el trabajo.

source: **Counterparty Type:** Cliente (Client)
es: **Tipo de Contraparte:** Cliente

source: **Financial Flow:** Client pays you for completed work.
es: **Flujo financiero:** El cliente le paga por el trabajo completado.

source: **Example:**
es: **Ejemplo:**

source: *"Office Building Construction for ABC Corp"*
es: *"Construcción de edificio de oficinas para ABC Corp"*

source: Counterparty: ABC Corp (Cliente)
es: Contraparte: ABC Corp (Cliente)

source: Your role: General Contractor
es: Su función: Contratista general

source: Payment: You receive money
es: Pago: Recibes dinero

source: Subcontractor Contracts
es: Contratos de subcontratación

source: **When:** You hire a specialized contractor for part of a project.
es: **Cuándo:** Contratas a un contratista especializado para parte de un proyecto.

source: **Counterparty Type:** Subcontratista (Subcontractor)
es: **Tipo de Contraparte:** Subcontratista

source: **Financial Flow:** You pay the subcontractor for their work.
es: **Flujo financiero:** Pagas al subcontratista por su trabajo.

source: *"Electrical Installation - Subcontracted to XYZ Electric"*
es: *"Instalación Eléctrica - Subcontratada a XYZ Electric"*

source: Counterparty: XYZ Electric (Subcontratista)
es: Contraparte: XYZ Electric (Subcontratista)

source: Your role: General Contractor hiring specialist
es: Su función: especialista en contratación de contratistas generales

source: Payment: You pay money
es: Pago: pagas dinero

source: Typically a **child contract** under a main client contract
es: Normalmente un **contrato secundario** bajo un contrato de cliente principal

source: Piecework Contracts
es: Contratos a destajo

source: **When:** You hire workers paid by completed units (piece rate).
es: **Cuándo:** Usted contrata trabajadores pagados por unidades completadas (a destajo).

source: **Counterparty Type:** Destajista (Piecework Contractor)
es: **Tipo de Contraparte:** Destajista (Contratista a destajo)

source: **Financial Flow:** You pay per completed task/quantity.
es: **Flujo financiero:** Pagas por tarea/cantidad completada.

source: *"Masonry Work - Paid per Square Meter"*
es: *"Trabajos de Albañilería - Pagado por Metro Cuadrado"*

source: Counterparty: José García (Destajista)
es: Contrapartida: José García (Destajista)

source: Payment: You pay based on quantity (e.g., $50/m²)
es: Pago: Usted paga según la cantidad (por ejemplo, $50/m²)

source: Common in Mexican construction industry
es: Común en la industria de la construcción mexicana

source: Financial Calculations
es: Cálculos financieros

source: Understanding Contract Amounts
es: Comprensión de los montos del contrato

source: **Total Contracted** (Importe Total Contratado)
es: **Total Contratado** (Importar Total Contratado)

source: The ``monto`` field - total contract value.
es: El campo ``monto`` - valor total del contrato.

source: **Accumulated Executed** (Ejercido Acumulado)
es: **Acumulado Ejecutado**

source: Sum of all work billed across all estimates to date. Calculated by: ``ejercido_acumulado()`` method.
es: Suma de todo el trabajo facturado en todas las estimaciones hasta la fecha. Calculado mediante: método ``ejercido_acumulado()``.

source: **Remaining** (Por Ejercer)
es: **Restante** (Por Ejercer)

source: Total Contracted minus Accumulated Executed.
es: Total Contratado menos Acumulado Ejecutado.

source: Advance Payment Mechanics
es: Mecánica de pago anticipado

source: **Initial Advance:**
es: **Adelanto inicial:**

source: If ``anticipo = 10%`` on a $1,000,000 contract: Client pays $100,000 upfront.
es: Si ``anticipo = 10%`` en un contrato de $1,000,000: El cliente paga $100,000 por adelantado.

source: **Amortization:**
es: **Amortización:**

source: The $100,000 is recovered across estimates until fully amortized.
es: Los $100,000 se recuperan según las estimaciones hasta que se amorticen por completo.

source: **Example Amortization:**
es: **Ejemplo de Amortización:**

source: Estimate
es: Estimar

source: Work Value
es: Valor del trabajo

source: Amortization
es: Amortización

source: Net Payment
es: Pago Neto

source: Remaining Advance
es: Avance restante

source: The advance is recovered proportionally until the original $100,000 is fully amortized.
es: El anticipo se recupera proporcionalmente hasta amortizar por completo los $100.000 originales.

source: **Learn more:** :doc:`estimates`
es: **Más información:** :doc:`estimaciones`

source: Best Practices
es: Mejores prácticas

source: Naming Conventions
es: Convenciones de nomenclatura

source: ✅ **Good Contract Names:**
es: ✅ **Buenos nombres de contratos:**

source: "Downtown Office Tower - Complete Construction Phase 1"
es: "Torre de oficinas en el centro: finalización de la fase de construcción 1"

source: "Highway 101 Bridge - Structural Steel Installation"
es: "Puente de la Carretera 101 - Instalación de Acero Estructural"

source: "Residential Complex Unit A - Electrical Systems"
es: “Conjunto Residencial Unidad A – Sistemas Eléctricos”

source: ❌ **Avoid:**
es: ❌ **Evitar:**

source: "Project 1" (too generic)
es: "Proyecto 1" (demasiado genérico)

source: "ABC" (unclear)
es: "ABC" (poco claro)

source: Just the contract code without description
es: Solo el código del contrato sin descripción.

source: Organize with Hierarchy
es: Organizar con jerarquía

source: ✅ **Use sub-contracts for:**
es: ✅ **Usar subcontratos para:**

source: Different subcontractors
es: Diferentes subcontratistas

source: Different phases of work
es: Diferentes fases del trabajo.

source: Different buildings/units in a complex
es: Diferentes edificios/unidades en un complejo

source: ✅ **Keep main contract for:**
es: ✅ **Mantener contrato principal por:**

source: Overall client relationship
es: Relación general con el cliente

source: Consolidated reporting
es: Informes consolidados

source: Total project tracking
es: Seguimiento total del proyecto

source: User Assignment
es: Asignación de usuarios

source: ✅ **Assign users who need access:**
es: ✅ **Asignar usuarios que necesitan acceso:**

source: Project Manager (always)
es: Gerente de Proyecto (siempre)

source: Site Supervisor
es: supervisor del sitio

source: Coordinators creating estimates
es: Coordinadores creando presupuestos.

source: Accounting staff tracking payments
es: Personal de contabilidad que sigue los pagos

source: ✅ **Permission levels:**
es: ✅ **Niveles de permiso:**

source: Director (Level 3+): Can create/edit contracts
es: Director (Nivel 3+): puede crear/editar contratos

source: Coordinador (Level 2): Can create estimates
es: Coordinador (Nivel 2): ​​Puede crear estimaciones

source: Auxiliar (Level 1): View-only access
es: Auxiliar (Nivel 1): Acceso de solo visualización

source: Keep Status Updated
es: Mantener el estado actualizado

source: ✅ **Active contracts:**
es: ✅ **Contratos activos:**

source: Set ``status = True`` (ongoing) for projects in progress
es: Establezca ``status = True`` (en curso) para proyectos en progreso

source: Appear in "Active Contracts" dashboard section
es: Aparecer en la sección del panel "Contratos activos"

source: ✅ **Completed contracts:**
es: ✅ **Contratos completados:**

source: Set ``status = False`` when project is finished
es: Establezca ``status = False`` cuando finalice el proyecto

source: Removes from active list but retains all history
es: Se elimina de la lista activa pero conserva todo el historial.

source: Common Scenarios
es: Escenarios comunes

source: Scenario 1: Main Contract with Subcontractors
es: Escenario 1: Contrato principal con subcontratistas

source: **Setup:**
es: **Configuración:**

source: Create main client contract: "Office Building for ABC Corp" ($1,000,000)
es: Crear contrato de cliente principal: "Edificio de Oficinas para ABC Corp" ($1,000,000)

source: Create sub-contracts as children:
es: Crear subcontratos como hijos:

source: "Electrical - XYZ Electric" ($150,000) - Subcontratista
es: "Eléctrico - XYZ Eléctrico" ($150.000) - Subcontratista

source: "Plumbing - AAA Plumbing" ($100,000) - Subcontratista
es: "Plomería - Plomería AAA" ($100.000) - Subcontratista

source: "HVAC - Cool Systems" ($120,000) - Subcontratista
es: "HVAC - Sistemas de refrigeración" ($120.000) - Subcontratista

source: Track work separately for each sub-contract
es: Realice un seguimiento del trabajo por separado para cada subcontrato

source: Generate consolidated report for ABC Corp showing all work
es: Genere un informe consolidado para ABC Corp que muestre todo el trabajo.

source: **Benefit:** Clear separation of subcontractor costs while maintaining overall project view.
es: **Beneficio:** Separación clara de los costos de subcontratistas manteniendo al mismo tiempo la visión general del proyecto.

source: Scenario 2: Multi-Phase Project
es: Escenario 2: Proyecto de múltiples fases

source: Create parent: "Residential Complex - Master Contract"
es: Crear padre: "Complejo Residencial - Contrato Marco"

source: Create children for each phase:
es: Crea hijos para cada fase:

source: "Phase 1 - Foundation & Structure"
es: "Fase 1 - Cimentación y Estructura"

source: "Phase 2 - MEP & Finishes"
es: "Fase 2 - MEP y Acabados"

source: "Phase 3 - Landscaping & Exterior"
es: "Fase 3 - Paisajismo y exterior"

source: Execute phases sequentially or in parallel
es: Ejecutar fases de forma secuencial o en paralelo

source: Track financial progress per phase
es: Seguimiento del progreso financiero por fase

source: **Benefit:** Clear phase separation with consolidated totals.
es: **Beneficio:** Separación clara de fases con totales consolidados.

source: Scenario 3: Multiple Buildings
es: Escenario 3: varios edificios

source: Create parent: "Shopping Center Development"
es: Crear padre: "Desarrollo de centro comercial"

source: Create children for each building:
es: Crea hijos para cada edificio:

source: "Building A - Retail Spaces"
es: "Edificio A - Espacios Comerciales"

source: "Building B - Food Court"
es: "Edificio B - Patio de Comidas"

source: "Building C - Parking Structure"
es: "Edificio C - Estructura de Estacionamiento"

source: Assign different teams to different buildings
es: Asigna diferentes equipos a diferentes edificios.

source: Track progress independently
es: Seguimiento del progreso de forma independiente

source: **Benefit:** Independent management with overall project visibility.
es: **Beneficio:** Gestión independiente con visibilidad general del proyecto.

source: Troubleshooting
es: Solución de problemas

source: Can't Delete a Contract
es: No puedo eliminar un contrato

source: **Problem:** "Cannot be deleted, has concepts that must be deleted first" or has child contracts.
es: **Problema:** "No se puede eliminar, tiene conceptos que se deben eliminar primero" o tiene contratos secundarios.

source: **Solution:**
es: **Solución:**
