Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/projects-contracts.po
Languages: es

source: For concepts: Delete all work items (concepts) from the contract first
es: Para conceptos: elimine primero todos los elementos de trabajo (conceptos) del contrato

source: For children: Delete all sub-contracts first, then delete parent
es: Para niños: primero elimine todos los subcontratos y luego elimine el principal

source: Alternatively: Set contract to inactive instead of deleting
es: Alternativamente: establecer el contrato como inactivo en lugar de eliminarlo

source: Can't See a Contract
es: No puedo ver un contrato

source: **Problem:** Contract doesn't appear in your list.
es: **Problema:** El contrato no aparece en tu lista.

source: **Causes:**
es: **Causas:**

source: You're in the wrong **company** (use Switch Company)
es: Estás en la **empresa** equivocada (usa Cambiar de empresa)

source: You're not **assigned** to the contract (contact admin)
es: No estás **asignado** al contrato (contacta al administrador)

source: Your **permission level** is too low
es: Tu **nivel de permiso** es demasiado bajo

source: Can't Edit Contract
es: No puedo editar el contrato

source: **Problem:** Edit option is disabled.
es: **Problema:** La opción Editar está deshabilitada.

source: **Requirements:**
es: **Requisitos:**

source: Minimum **Director** (Level 3) permission
es: Permiso mínimo de **Director** (Nivel 3)

source: Must be **assigned** to the contract
es: Debe estar **asignado** al contrato

source: Must be in the correct **company**
es: Debe estar en la **empresa** correcta

source: Retentions Not Showing
es: Retenciones que no se muestran

source: **Problem:** Retentions not appearing in estimates.
es: **Problema:** Las retenciones no aparecen en las estimaciones.

source: Navigate to Contract Detail
es: Vaya a Detalles del contrato

source: Click "Retentions" tab
es: Haga clic en la pestaña "Retenciones"

source: Add retention rules (percentage or fixed amount)
es: Agregar reglas de retención (porcentaje o cantidad fija)

source: Retentions will automatically apply to future estimates
es: Las retenciones se aplicarán automáticamente a estimaciones futuras.

source: See Also
es: Ver también

source: **Related Concepts:**
es: **Conceptos relacionados:**

source: **Workflows:**
es: **Flujos de trabajo:**

source: **Features:**
es: **Características:**

source: **Developer Reference:**
es: **Referencia del desarrollador:**
