Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/retentions.po
Languages: es

source: Retentions
es: Retenciones

source: **Spanish Term:** Retención
es: **Término en español:** Retención

source: Understanding retentions (financial withholdings) in Construbot.
es: Entendiendo las retenciones (retenciones financieras) en Construbot.

source: Table of Contents
es: Tabla de contenido

source: What is a Retention?
es: ¿Qué es una retención?

source: A **Retention** (Spanish: **Retención**) is a percentage of payment withheld from estimates or invoices. Retentions serve as:
es: Una **Retención** (español: **Retención**) es un porcentaje del pago retenido de presupuestos o facturas. Las retenciones sirven como:

source: Financial guarantee for contract completion
es: Garantía financiera para la finalización del contrato.

source: Quality assurance holdback
es: Retención de garantía de calidad

source: Warranty or defect correction fund
es: Fondo de garantía o corrección de defectos

source: Performance bond substitute
es: Sustituto de fianza de cumplimiento

source: Tax withholdings (in some jurisdictions)
es: Retenciones fiscales (en algunas jurisdicciones)

source: **Model:** ``construbot.proyectos.models.Retenciones``
es: **Modelo:** ``construbot.proyectos.models.Retenciones``

source: **Key Concept:** Retentions are deducted from estimate payments and held until specific conditions are met (contract completion, warranty period expiration, etc.).
es: **Concepto clave:** Las retenciones se deducen de los pagos estimados y se mantienen hasta que se cumplan condiciones específicas (finalización del contrato, vencimiento del período de garantía, etc.).

source: How Retentions Work
es: Cómo funcionan las retenciones

source: Basic Mechanism
es: Mecanismo básico

source: When an estimate is created:
es: Cuando se crea una estimación:

source: **Subtotal calculated** from line items
es: **Subtotal calculado** a partir de partidas individuales

source: **Retention percentage applied** to subtotal
es: **Porcentaje de retención aplicado** al subtotal

source: **Retention amount withheld** from payment
es: **Monto retenido** del pago

source: **Net payment** = Subtotal - Retention
es: **Pago neto** = Subtotal - Retención

source: **Example:**
es: **Ejemplo:**

source: Multiple Retentions
es: Retenciones Múltiples

source: Contracts can have multiple retention types applied simultaneously:
es: Los contratos pueden tener múltiples tipos de retención aplicados simultáneamente:

source: Each retention may have different release conditions and timing.
es: Cada retención puede tener diferentes condiciones y tiempos de liberación.

source: Retention Information
es: Información de retención

source: **Required fields:**
es: **Campos obligatorios:**

source: **Name** (nombre) - Descriptive name
es: **Name** (nombre) - Nombre descriptivo

source: **Percentage** (porcentaje) - Percentage to withhold (e.g., 10.00)
es: **Porcentaje** (porcentaje) - Porcentaje a retener (p. ej., 10,00)

source: **Contract** (contrato) - Which contract this applies to
es: **Contrato** (contrato) - A qué contrato se aplica

source: **Company** - Your company (for multi-tenant isolation)
es: **Empresa**: su empresa (para aislamiento de múltiples inquilinos)

source: **Optional fields:**
es: **Campos opcionales:**

source: **Description** (descripción) - Purpose and release conditions
es: **Description** (descripción) - Objeto y condiciones de liberación

source: **Release Date** (fecha_liberacion) - When retention will be released
es: **Fecha de lanzamiento** (fecha_liberacion) - Cuándo se liberará la retención

source: **Released** (liberado) - Boolean flag if already released
es: **Liberado** (liberado) - Bandera booleana si ya está liberado

source: **Notes** (notas) - Additional information
es: **Notas** (notas) - Información adicional

source: Types of Retentions
es: Tipos de Retenciones

source: 1. Performance Retentions
es: 1. Retenciones de desempeño

source: **Purpose:** Ensure contract completion according to specifications
es: **Objetivo:** Garantizar la finalización del contrato según las especificaciones.

source: **Typical Percentage:** 5-10%
es: **Porcentaje típico:** 5-10%

source: **Release Condition:**
es: **Condición de lanzamiento:**

source: Contract completion
es: Finalización del contrato

source: Final inspection approval
es: Aprobación de inspección final

source: Punch list items completed
es: Elementos de la lista de tareas pendientes completados

source: 2. Warranty Retentions
es: 2. Retenciones de garantía

source: **Purpose:** Cover defect repairs during warranty period
es: **Propósito:** Cubrir reparaciones de defectos durante el período de garantía.

source: **Typical Percentage:** 5%
es: **Porcentaje típico:** 5%

source: Warranty period expiration (often 1 year)
es: Vencimiento del período de garantía (a menudo 1 año)

source: No outstanding defects
es: Sin defectos destacados

source: Final sign-off from client
es: Aprobación final del cliente

source: 3. Tax Withholdings
es: 3. Retenciones de Impuestos

source: **Purpose:** Government-mandated tax collection
es: **Propósito:** Recaudación de impuestos ordenada por el gobierno

source: **Typical Percentage:** Varies by jurisdiction (1-10%)
es: **Porcentaje típico:** Varía según la jurisdicción (1-10%)

source: Remitted to tax authority
es: Remitido a la autoridad fiscal

source: Not returned to contractor
es: No devuelto al contratista

source: May be creditable against tax liability
es: Puede ser acreditable contra la obligación tributaria

source: **Example (Mexico):**
es: **Ejemplo (México):**

source: 4. Material/Labor Retentions
es: 4. Retenciones de materiales/mano de obra

source: **Purpose:** Ensure subcontractor or supplier payment
es: **Finalidad:** Garantizar el pago a subcontratistas o proveedores

source: Proof of payment to subs/suppliers
es: Comprobante de pago a subscriptores/proveedores

source: Lien waivers received
es: Renuncias de gravamen recibidas

source: No outstanding claims
es: No hay reclamaciones pendientes

source: Creating Retentions
es: Creando retenciones

source: Method 1: Manual Creation
es: Método 1: creación manual

source: Step 1: Access Contract Retentions
es: Paso 1: Acceda a las retenciones de contratos

source: Navigate to the contract
es: Navegar al contrato

source: Find **"Retentions"** or **"Retenciones"** section
es: Busque la sección **"Retenciones"** o **"Retenciones"**

source: Click **"Add Retention"** or **"Agregar Retención"**
es: Haga clic en **"Agregar Retención"** o **"Agregar Retención"**

source: Step 2: Configure Retention
es: Paso 2: configurar la retención

source: Step 3: Save
es: Paso 3: guardar

source: Click **"Save"** to add this retention to the contract.
es: Haga clic en **"Guardar"** para agregar esta retención al contrato.

source: **Result:** This retention will automatically apply to all future estimates for this contract.
es: **Resultado:** Esta retención se aplicará automáticamente a todas las estimaciones futuras para este contrato.

source: Method 2: Excel Import
es: Método 2: Importación de Excel

source: For contracts with standard retention structures:
es: Para contratos con estructuras de retención estándar:

source: Prepare Excel file with retention data:
es: Prepare el archivo Excel con los datos de retención:

source: Navigate to contract retentions section
es: Navegar a la sección de retenciones de contratos

source: Click **"Import from Excel"**
es: Haga clic en **"Importar desde Excel"**

source: Select file and upload
es: Seleccione el archivo y cárguelo

source: **Benefit:** Quickly set up multiple retentions at once.
es: **Beneficio:** Configure rápidamente varias retenciones a la vez.

source: Retention Tracking
es: Seguimiento de retención

source: Cumulative Retention Balance
es: Saldo de retención acumulativo

source: Construbot automatically tracks:
es: Construbot rastrea automáticamente:

source: **Total Retained This Estimate:** Sum of all retention amounts
es: **Total retenido en esta estimación:** Suma de todos los montos retenidos

source: **Cumulative Retained:** Running total of all retained amounts
es: **Retenido acumulado:** Total acumulado de todos los montos retenidos

source: **Released Amounts:** Retentions that have been paid out
es: **Montos liberados:** Retenciones que han sido pagadas

source: **Current Balance:** Total retained - Total released
es: **Saldo actual:** Total retenido - Total liberado

source: **Example Tracking:**
es: **Ejemplo de seguimiento:**

source: Estimate-Level Retention Display
es: Visualización de retención de nivel estimado

source: Each estimate shows:
es: Cada estimación muestra:

source: Subtotal before retentions
es: Subtotal antes de retenciones

source: Each retention type and amount
es: Cada tipo y monto de retención

source: Total retentions
es: Retenciones totales

source: Net amount to pay
es: Monto neto a pagar

source: **Estimate Example:**
es: **Ejemplo de estimación:**

source: Releasing Retentions
es: Liberar retenciones

source: When to Release
es: Cuando liberar

source: Release retentions when conditions are met:
es: Liberar retenciones cuando se cumplan las condiciones:

source: **Contract Completion:** - All work completed - Final inspection passed - Punch list items resolved
es: **Terminación del contrato:** - Todo el trabajo completado - Inspección final aprobada - Elementos de la lista de tareas pendientes resueltos

source: **Warranty Expiration:** - Warranty period ended - No outstanding defects - Client sign-off received
es: **Vencimiento de la garantía:** - Período de garantía finalizado - No hay defectos pendientes - Se recibió la aprobación del cliente

source: **Partial Releases:** - Milestone achievements - Progressive completion - Phase-based releases
es: **Lanzamientos parciales:** - Logros de hitos - Finalización progresiva - Lanzamientos basados ​​en fases

source: Release Process
es: Proceso de liberación

source: Step 1: Verify Release Conditions
es: Paso 1: verificar las condiciones de lanzamiento

source: Confirm all requirements met:
es: Confirmar que se cumplen todos los requisitos:

source: Completion certificates obtained
es: Certificados de finalización obtenidos

source: Client approval documented
es: Aprobación del cliente documentada

source: No outstanding claims or defects
es: Sin reclamaciones ni defectos pendientes

source: All required documentation submitted
es: Toda la documentación requerida presentada.

source: Step 2: Mark Retention as Released
es: Paso 2: marcar la retención como liberada

source: Navigate to contract retention
es: Navegar a retención de contrato

source: Edit the retention record
es: Editar el registro de retención

source: Check **"Released"** flag
es: Marque la marca **"Liberado"**

source: Enter **Release Date**
es: Ingrese **Fecha de lanzamiento**

source: Add notes documenting release justification
es: Agregar notas que documenten la justificación de la liberación

source: Step 3: Generate Release Payment
es: Paso 3: Generar pago de liberación

source: **Option A: Create Final Estimate**
es: **Opción A: Crear estimación final**

source: Create a special estimate with:
es: Crea un presupuesto especial con:

source: No new line items
es: No hay líneas de pedido nuevas

source: Negative retention amounts (to reverse withheld funds)
es: Montos de retención negativos (para revertir fondos retenidos)

source: Notes: "Retention Release - Contract Completion"
es: Notas: "Liberación de retención - Finalización del contrato"

source: **Option B: Separate Payment Record**
es: **Opción B: Registro de pago separado**

source: Record retention release as separate transaction outside estimate system.
es: Liberación de retención de registros como transacción separada fuera del sistema de estimación.

source: Partial Retention Releases
es: Liberaciones de retención parcial

source: For progressive releases:
es: Para lanzamientos progresivos:

source: **Scenario:** 50% of retention released at substantial completion, 50% after warranty
es: **Escenario:** 50 % de la retención se libera al finalizar sustancialmente, 50 % después de la garantía

source: **Create two separate retentions:**
es: **Crear dos retenciones separadas:**

source: **Release independently:**
es: ** Lanzamiento independiente: **

source: Release Retention 1 at substantial completion
es: Retención de liberación 1 al finalizar sustancialmente

source: Release Retention 2 after warranty period
es: Liberación de retención 2 después del período de garantía

source: **Alternative:** Use percentage reduction instead of separate retentions.
es: **Alternativa:** Utilice reducción porcentual en lugar de retenciones separadas.

source: Best Practices
es: Mejores prácticas

source: **1. Document release conditions clearly:**
es: **1. Condiciones de divulgación de documentos claramente:**

source: **2. Use standard percentages:**
es: **2. Utilice porcentajes estándar:**

source: Align with industry standards and contract terms:
es: Alinearse con los estándares de la industria y los términos del contrato:

source: Performance: 10%
es: Rendimiento: 10%

source: Warranty: 5%
es: Garantía: 5%

source: Tax withholding: Per jurisdiction
es: Retención de impuestos: por jurisdicción

source: **3. Set up retentions before first estimate:**
es: **3. Configurar retenciones antes de la primera estimación:**

source: Ensures consistent application across all payments.
es: Garantiza una aplicación coherente en todos los pagos.

source: **4. Track release dates:**
es: **4. Fechas de lanzamiento de la pista:**

source: Add calendar reminders for:
es: Agregue recordatorios de calendario para:

source: Substantial completion date + warranty period
es: Fecha de finalización sustancial + período de garantía

source: Milestone achievement dates
es: Fechas de consecución de hitos

source: Tax filing deadlines
es: Plazos de presentación de impuestos

source: **5. Reconcile regularly:**
es: **5. Conciliar regularmente:**

source: Monthly reconciliation:
es: Conciliación mensual:

source: Verify cumulative retained amounts
es: Verificar montos acumulados retenidos

source: Check against contract terms
es: Verifique los términos del contrato

source: Confirm release dates are current
es: Confirmar que las fechas de lanzamiento estén actualizadas

source: **6. Separate tax withholdings:**
es: **6. Retenciones fiscales separadas:**

source: Keep tax retentions separate from performance/warranty retentions for accounting clarity.
es: Mantenga las retenciones de impuestos separadas de las retenciones de desempeño/garantía para mayor claridad contable.

source: Common Scenarios
es: Escenarios comunes

source: Scenario 1: Standard Construction Contract
es: Escenario 1: Contrato de construcción estándar

source: **Setup:**
es: **Configuración:**

source: $1,000,000 contract
es: Contrato de $1.000.000

source: 10% performance retention
es: 10% de retención del rendimiento

source: 5% warranty retention (released after 1 year)
es: Retención de garantía del 5 % (liberada después de 1 año)

source: **Configuration:**
es: **Configuración:**

source: **Estimate Flow:**
es: **Flujo estimado:**

source: Scenario 2: Subcontractor Agreement
es: Escenario 2: Acuerdo de subcontratista

source: Simple percentage retention
es: Retención porcentual simple

source: Released upon proof of payment to suppliers
es: Liberado previo comprobante de pago a proveedores.

source: **Release Process:**
es: **Proceso de lanzamiento:**

source: Subcontractor submits final lien waivers
es: El subcontratista presenta renuncias finales al gravamen

source: Provides supplier payment receipts
es: Proporciona recibos de pago de proveedores.

source: Retention marked as released
es: Retención marcada como liberada

source: Final payment issued
es: Pago final emitido

source: Scenario 3: Tax Withholding (Mexico Example)
es: Escenario 3: Retención de Impuestos (Ejemplo de México)

source: IVA (VAT) retention required by law
es: Retención de IVA requerida por ley

source: 2/3 of IVA withheld and remitted to SAT
es: 2/3 del IVA retenido y remitido al SAT

source: **Handling:**
es: **Manejo:**

source: Withheld from each estimate
es: Retenido de cada estimación

source: Remitted to tax authority by client
es: Remitido a la autoridad fiscal por el cliente

source: Contractor credits against tax liability
es: Créditos del contratista contra la obligación tributaria

source: Not "released" back to contractor
es: No "entregado" al contratista

source: Reporting
es: Informes

source: Available Reports
es: Informes disponibles

source: **Retention Balance Report:**
es: **Informe de saldo de retención:**

source: Shows current retention balances by:
es: Muestra los saldos de retención actuales por:

source: Contract
es: Contrato

source: Retention type
es: Tipo de retención

source: Client
es: Cliente

source: Status (active vs. released)
es: Estado (activo versus liberado)

source: **Retention Activity Report:**
es: **Informe de actividad de retención:**

source: Tracks retention movements:
es: Realiza un seguimiento de los movimientos de retención:

source: Amounts withheld by period
es: Montos retenidos por período

source: Release transactions
es: Liberar transacciones

source: Cumulative balances over time
es: Saldos acumulados en el tiempo

source: **Client Retention Statement:**
es: **Declaración de retención de clientes:**

source: For client communication:
es: Para comunicación con el cliente:

source: Total retained to date
es: Total retenido hasta la fecha

source: Breakdown by retention type
es: Desglose por tipo de retención

source: Scheduled release dates
es: Fechas de lanzamiento programadas

source: Release conditions status
es: Estado de las condiciones de lanzamiento

source: Export Options
es: Opciones de exportación

source: **PDF:** Formatted retention statements
es: **PDF:** Declaraciones de retención formateadas

source: **Excel:** Detailed retention transaction history
es: **Excel:** Historial detallado de transacciones de retención

source: **CSV:** For import into accounting systems
es: **CSV:** Para importar a sistemas contables

source: Troubleshooting
es: Solución de problemas

source: **Retention not applying to estimates:**
es: **Retención no aplicable a estimaciones:**

source: Verify retention is attached to correct contract
es: Verifique que la retención esté adjunta al contrato correcto

source: Check retention percentage is set (not 0%)
es: El porcentaje de retención de cheques está establecido (no es 0%)

source: Ensure retention is not already marked as "Released"
es: Asegúrese de que la retención no esté marcada como "Liberada"

source: Confirm estimate is for the correct contract
es: Confirmar que la estimación es para el contrato correcto

source: **Retention amount incorrect:**
es: **Monto de retención incorrecto:**

source: Review retention percentage calculation
es: Revisar el cálculo del porcentaje de retención

source: Check if multiple retentions are configured (additive)
es: Comprobar si se configuran múltiples retenciones (aditivas)

source: Verify estimate subtotal is correct
es: Verifique que el subtotal estimado sea correcto

source: Confirm no manual adjustments were made
es: Confirme que no se realizaron ajustes manuales

source: **Can't release retention:**
es: **No se puede liberar la retención:**

source: Verify you have appropriate permission level
es: Verifique que tenga el nivel de permiso apropiado

source: Check release conditions are met and documented
es: Verificar que las condiciones de liberación se cumplan y estén documentadas.

source: Ensure retention is associated with correct contract
es: Asegúrese de que la retención esté asociada con el contrato correcto.

source: Confirm retention hasn't already been released
es: Confirmar que la retención aún no se ha liberado

source: **Multiple retention types confusing:**
es: **Múltiples tipos de retención confunden:**

source: Use clear, descriptive names for each type
es: Utilice nombres claros y descriptivos para cada tipo.

source: Add detailed descriptions explaining release conditions
es: Agregue descripciones detalladas que expliquen las condiciones de publicación.

source: Consider color-coding or tagging retention types
es: Considere los tipos de retención de etiquetas o códigos de colores

source: Document in contract notes which retentions apply
es: Documento en notas de contrato a las que se aplican retenciones

source: Integration with Accounting
es: Integración con Contabilidad

source: Retention accounting considerations:
es: Consideraciones sobre la contabilidad de retención:

source: **Accounts Receivable:**
es: **Cuentas por cobrar:**

source: Retained amounts are:
es: Los montos retenidos son:

source: Still owed to contractor (asset)
es: Aún se le debe al contratista (activo)

source: Recorded as "Retention Receivable"
es: Registrado como "Retención por Cobrar"

source: Recognized as revenue when earned
es: Se reconoce como ingreso cuando se obtiene

source: Collected when released
es: Recogido cuando se libera

source: **Client Perspective:**
es: **Perspectiva del cliente:**

source: Liability to contractor
es: Responsabilidad ante el contratista

source: Recorded as "Retention Payable"
es: Registrado como "Retención por pagar"

source: Held until release conditions met
es: Retenido hasta que se cumplan las condiciones de liberación

source: Paid upon release
es: Pagado al momento de la liberación

source: **Journal Entry (Contractor):**
es: **Entrada del diario (Contratista):**

source: See Also
es: Ver también
