Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/concepts/sites-contacts.po
Languages: es

source: Sites & Contacts
es: Sitios y contactos

source: **Spanish Terms:** Sitio, Destinatario
es: **Términos en español:** Sitio, Destinotario

source: Understanding sites (construction locations) and contacts (recipients) in Construbot.
es: Comprensión de sitios (lugares de construcción) y contactos (destinatarios) en Construbot.

source: Overview
es: Descripción general

source: Construbot uses two related concepts for location and communication:
es: Construbot utiliza dos conceptos relacionados para localización y comunicación:

source: **Sites** (Spanish: **Sitios**) - Physical locations where work is performed
es: **Sitios** (español: **Sitios**): ubicaciones físicas donde se realiza el trabajo.

source: **Contacts** (Spanish: **Destinatarios**) - Individuals who receive documents and communications
es: **Contactos** (Español: **Destinatarios**) - Personas físicas que reciben documentos y comunicaciones

source: Together, these enable proper project location tracking and document routing.
es: Juntos, estos permiten un seguimiento adecuado de la ubicación del proyecto y el enrutamiento de documentos.

source: Sites (Sitios)
es: Sitios (Sitios)

source: What is a Site?
es: ¿Qué es un sitio?

source: A **Site** (Spanish: **Sitio**) is a physical construction location associated with a client. Sites represent:
es: Un **Sitio** (español: **Sitio**) es una ubicación física de construcción asociada con un cliente. Los sitios representan:

source: Specific job sites or work locations
es: Sitios de trabajo o lugares de trabajo específicos

source: Buildings or facilities under construction
es: Edificios o instalaciones en construcción

source: Physical addresses where work occurs
es: Direcciones físicas donde se realiza el trabajo.

source: Locations for contract execution
es: Lugares para la ejecución del contrato.

source: **Model:** ``construbot.proyectos.models.Sitio``
es: **Modelo:** ``construbot.proyectos.models.Sitio``

source: **Key Relationships:**
es: **Relaciones clave:**

source: Each site belongs to exactly one **Client** counterparty
es: Cada sitio pertenece exactamente a una contraparte **Cliente**

source: Multiple sites can belong to the same client
es: Varios sitios pueden pertenecer al mismo cliente

source: Contracts are associated with specific sites
es: Los contratos están asociados con sitios específicos.

source: Sites enable location-based project organization
es: Los sitios permiten la organización de proyectos basada en la ubicación

source: Site Information
es: Información del sitio

source: **Required fields:**
es: **Campos obligatorios:**

source: **Name** (nombre) - Descriptive name of the site
es: **Name** (nombre) - Nombre descriptivo del sitio

source: **Client** (cliente) - The client counterparty who owns this site
es: **Cliente** (cliente): la contraparte del cliente propietaria de este sitio.

source: **Company** - Your company (for multi-tenant isolation)
es: **Empresa**: su empresa (para aislamiento de múltiples inquilinos)

source: **Optional fields:**
es: **Campos opcionales:**

source: **Address** (dirección) - Full street address
es: **Dirección** (dirección) - Dirección completa

source: **City** (ciudad)
es: **Ciudad** (ciudad)

source: **State** (estado)
es: **Estado**

source: **Postal Code** (código postal)
es: **Código Postal** (código postal)

source: **Country** (país)
es: **País** (país)

source: **GPS Coordinates** (latitud, longitud)
es: **Coordenadas GPS** (latitud, longitud)

source: **Contact Phone** (teléfono)
es: **Teléfono de contacto** (teléfono)

source: **Site Manager** - Person responsible for the site
es: **Administrador del sitio** - Persona responsable del sitio

source: **Notes** (notas) - Additional information
es: **Notas** (notas) - Información adicional

source: Creating a Site
es: Creando un sitio

source: Step 1: Navigate to Sites
es: Paso 1: navegue a Sitios

source: Log in to Construbot
es: Inicia sesión en Construbot

source: Navigate to **Proyectos → Sitios**
es: Vaya a **Proyectos → Sitios**

source: Click **"New Site"** or **"Agregar Sitio"**
es: Haga clic en **"Nuevo sitio"** o **"Agregar sitio"**

source: Step 2: Select Client
es: Paso 2: seleccione el cliente

source: Choose the client who owns this site from the dropdown.
es: Elija el cliente propietario de este sitio en el menú desplegable.

source: **Note:** Only **Client** type counterparties appear in this list.
es: **Nota:** En esta lista solo aparecen contrapartes de tipo **Cliente**.

source: Step 3: Enter Site Details
es: Paso 3: Ingrese los detalles del sitio

source: Step 4: Save
es: Paso 4: guardar

source: Click **"Save"** or **"Guardar"** to create the site.
es: Haga clic en **"Guardar"** o **"Guardar"** para crear el sitio.

source: Using Sites
es: Uso de sitios

source: **In Contracts:**
es: **En Contratos:**

source: When creating a contract for a client, select the specific site:
es: Al crear un contrato para un cliente, seleccione el sitio específico:

source: Choose the client counterparty
es: Elija la contraparte del cliente

source: Site dropdown automatically filters to show only that client's sites
es: El menú desplegable del sitio se filtra automáticamente para mostrar solo los sitios de ese cliente

source: Select the appropriate site for this contract
es: Seleccione el sitio apropiado para este contrato

source: **Multiple Contracts per Site:**
es: **Múltiples contratos por sitio:**

source: The same site can have multiple contracts:
es: Un mismo sitio puede tener múltiples contratos:

source: Different phases of work
es: Diferentes fases del trabajo.

source: Separate buildings on same property
es: Edificios separados en la misma propiedad

source: Different trade contracts for same location
es: Diferentes contratos comerciales para la misma ubicación

source: **Site-Based Reporting:**
es: **Informes basados ​​en el sitio:**

source: Generate reports by site to see:
es: Genera informes por sitio para ver:

source: All contracts for a location
es: Todos los contratos para una ubicación.

source: Total project value at site
es: Valor total del proyecto en el sitio

source: Active work at site
es: Trabajo activo en el sitio.

source: Payment history for location
es: Historial de pagos por ubicación

source: Common Site Scenarios
es: Escenarios de sitio comunes

source: **Scenario 1: Single Site Client**
es: **Escenario 1: Cliente de sitio único**

source: Client has one office building
es: El cliente tiene un edificio de oficinas.

source: Create one site: "Main Office Building"
es: Cree un sitio: "Edificio de oficinas principal"

source: All contracts for this client use this site
es: Todos los contratos de este cliente utilizan este sitio.

source: **Scenario 2: Multi-Location Client**
es: **Escenario 2: Cliente de múltiples ubicaciones**

source: National retail chain client
es: Cliente de cadena minorista nacional

source: Create separate sites: - "Store #101 - Dallas TX" - "Store #102 - Houston TX" - "Store #103 - Austin TX"
es: Cree sitios separados: - "Tienda #101 - Dallas TX" - "Tienda #102 - Houston TX" - "Tienda #103 - Austin TX"

source: Each contract specifies which store
es: Cada contrato especifica qué tienda

source: **Scenario 3: Campus or Complex**
es: **Escenario 3: Campus o Complejo**

source: University campus with multiple buildings
es: Campus universitario con varios edificios

source: Options: - **One site:** "University Campus" (simple) - **Multiple sites:** "Science Building", "Library", "Dorms" (detailed)
es: Opciones: - **Un sitio:** "Campus universitario" (simple) - **Múltiples sitios:** "Edificio de ciencias", "Biblioteca", "Dormitorios" (detallado)

source: Choose based on reporting and organization needs.
es: Elija según las necesidades de informes y organización.

source: Contacts (Destinatarios)
es: Contactos (Destinatarios)

source: What is a Contact?
es: ¿Qué es un contacto?

source: A **Contact** (Spanish: **Destinatario**, literally "recipient") is an individual who receives documents or communications related to a contract. Contacts represent:
es: Un **Contacto** (español: **Destinatario**, literalmente "destinatario") es una persona física que recibe documentos o comunicaciones relacionadas con un contrato. Los contactos representan:

source: People who receive estimates, invoices, reports
es: Personas que reciben presupuestos, facturas, informes.

source: Project managers or supervisors
es: Gerentes o supervisores de proyectos

source: Client representatives
es: Representantes del cliente

source: Document approvers
es: Aprobadores de documentos

source: **Model:** ``construbot.proyectos.models.Destinatario``
es: **Modelo:** ``construbot.proyectos.models.Destinatario``

source: **Key Concept:** Contacts are specific to a contract, not global. The same person may be a contact on multiple contracts.
es: **Concepto clave:** Los contactos son específicos de un contrato, no globales. La misma persona puede ser un contacto en múltiples contratos.

source: Contact Information
es: Información del contacto

source: **Name** (nombre) - Full name of the person
es: **Name** (nombre) - Nombre completo de la persona

source: **Contract** (contrato) - Which contract they're associated with
es: **Contrato** (contrato): con qué contrato están asociados.

source: **Position** (puesto) - Job title or role
es: **Position** (puesto) - Título laboral o función

source: **Email** (correo) - Email address
es: **Correo electrónico** (correo) - Dirección de correo electrónico

source: **Phone** (teléfono) - Contact phone number
es: **Phone** (teléfono) - Teléfono de contacto

source: **Department** (departamento) - Organizational unit
es: **Departamento** (departamento) - Unidad organizativa

source: **Active** (activo) - Whether they should receive documents
es: **Active** (activo) - Si deben recibir documentos

source: **Document Delivery:**
es: **Entrega de documentos:**

source: When generating PDFs or sending emails, the system can automatically include all active contacts for a contract.
es: Al generar archivos PDF o enviar correos electrónicos, el sistema puede incluir automáticamente todos los contactos activos de un contrato.

source: Creating a Contact
es: Crear un contacto

source: Step 1: Access Contract
es: Paso 1: Contrato de acceso

source: Contacts are created within a specific contract:
es: Los contactos se crean dentro de un contrato específico:

source: Navigate to the contract
es: Navegar al contrato

source: Find the **"Contacts"** or **"Destinatarios"** section
es: Encuentra la sección **"Contactos"** o **"Destinatarios"**

source: Click **"Add Contact"** or **"Agregar Destinatario"**
es: Haga clic en **"Agregar contacto"** o **"Agregar Destinatario"**

source: Step 2: Enter Contact Details
es: Paso 2: Ingrese los datos de contacto

source: Step 3: Save
es: Paso 3: guardar

source: Click **"Save"** to add this contact to the contract.
es: Haga clic en **"Guardar"** para agregar este contacto al contrato.

source: **Repeat** for additional contacts on the same contract.
es: **Repita** para contactos adicionales en el mismo contrato.

source: Using Contacts
es: Usar contactos

source: **Document Generation:**
es: **Generación de documentos:**

source: When generating estimate PDFs or reports:
es: Al generar informes o PDF de presupuestos:

source: System includes "To:" field with all active contacts
es: El sistema incluye el campo "Para:" con todos los contactos activos

source: Email delivery can CC all contact email addresses
es: La entrega de correo electrónico puede enviar CC a todas las direcciones de correo electrónico de contacto.

source: Each contact receives relevant project documents
es: Cada contacto recibe los documentos relevantes del proyecto.

source: **Communication Tracking:**
es: **Seguimiento de comunicaciones:**

source: Contacts help track:
es: Seguimiento de ayuda de contactos:

source: Who approved estimates
es: ¿Quién aprobó las estimaciones?

source: Who received invoices
es: ¿Quién recibió las facturas?

source: Who to notify of project changes
es: A quién notificar sobre cambios en el proyecto

source: Communication history
es: Historial de comunicación

source: **Multiple Contacts:**
es: **Múltiples contactos:**

source: Contracts can have multiple contacts for different purposes:
es: Los contratos pueden tener múltiples contactos para diferentes propósitos:

source: **Primary Contact:** Main project manager
es: **Contacto principal:** Gerente principal del proyecto

source: **Financial Contact:** Accounts payable person
es: **Contacto financiero:** Persona de cuentas por pagar

source: **Technical Contact:** Site engineer or supervisor
es: **Contacto técnico:** Ingeniero o supervisor de obra

source: Mark all as active or selectively activate based on document type.
es: Marque todo como activo o actívelo selectivamente según el tipo de documento.

source: Best Practices
es: Mejores prácticas

source: Sites
es: Sitios

source: **1. Use descriptive names:**
es: **1. Utilice nombres descriptivos:**

source: **2. Include location identifiers:**
es: **2. Incluir identificadores de ubicación:**

source: For chains or franchises:
es: Para cadenas o franquicias:

source: **3. Keep addresses current:**
es: **3. Mantenga las direcciones actualizadas:**

source: Update addresses if they change or if initial address was incomplete.
es: Actualice las direcciones si cambian o si la dirección inicial estaba incompleta.

source: **4. Use GPS coordinates for remote sites:**
es: **4. Utilice coordenadas GPS para sitios remotos:**

source: Especially useful for:
es: Especialmente útil para:

source: Rural construction sites
es: Sitios de construcción rurales

source: Sites without formal addresses
es: Sitios sin direcciones formales

source: Integration with mapping tools
es: Integración con herramientas de mapeo.

source: **5. One site per distinct location:**
es: **5. Un sitio por ubicación distinta:**

source: Don't create duplicate sites for the same physical location.
es: No cree sitios duplicados para la misma ubicación física.

source: Contacts
es: Contactos

source: **1. Keep contact info current:**
es: **1. Mantenga la información de contacto actualizada:**

source: Update email and phone when:
es: Actualizar correo electrónico y teléfono cuando:

source: Contact person changes roles
es: La persona de contacto cambia de roles

source: New project manager assigned
es: Nuevo jefe de proyecto asignado

source: Contact information changes
es: Cambios en la información de contacto

source: **2. Use position/department fields:**
es: **2. Utilice campos de puesto/departamento:**

source: Helps identify contacts when names change:
es: Ayuda a identificar contactos cuando cambian los nombres:

source: **3. Mark inactive when appropriate:**
es: **3. Marcar como inactivo cuando corresponda:**

source: Don't delete contacts (preserves history), mark as inactive instead:
es: No elimine contactos (conserva el historial), márquelos como inactivos en su lugar:

source: Person leaves company
es: La persona deja la empresa

source: Contract phase changes
es: Cambios de fase del contrato

source: Different person takes over
es: Persona diferente se hace cargo

source: **4. Multiple contacts for different purposes:**
es: **4. Múltiples contactos para diferentes propósitos:**

source: **5. Include mobile numbers:**
es: **5. Incluir números de móvil:**

source: For urgent communication and field contacts.
es: Para comunicaciones urgentes y contactos de campo.

source: Relationship Between Sites and Contacts
es: Relación entre sitios y contactos

source: **Independent but Related:**
es: **Independiente pero relacionado:**

source: **Sites** are associated with **clients** (counterparties)
es: **Los sitios** están asociados con **clientes** (contrapartes)

source: **Contacts** are associated with **contracts**
es: **Los contactos** están asociados con **contratos**

source: A contract links a client (and their site) with specific contacts
es: Un contrato vincula a un cliente (y su sitio) con contactos específicos

source: **Example Flow:**
es: **Flujo de ejemplo:**

source: When you generate an estimate for contract C-2024-001:
es: Al generar un presupuesto para el contrato C-2024-001:

source: **Site information** appears on document header (location)
es: **La información del sitio** aparece en el encabezado del documento (ubicación)

source: **Contact information** appears in "To:" field (recipients)
es: **La información de contacto** aparece en el campo "Para:" (destinatarios)

source: Reporting
es: Informes

source: Site-Based Reports
es: Informes basados ​​en el sitio

source: Generate reports filtered by site:
es: Generar informes filtrados por sitio:

source: **Contracts by Site:** All contracts for a location
es: **Contratos por sitio:** Todos los contratos para una ubicación

source: **Financial Summary by Site:** Total revenue per site
es: **Resumen financiero por sitio:** Ingresos totales por sitio

source: **Active Projects by Site:** Current work at each location
es: **Proyectos activos por sitio:** Trabajo actual en cada ubicación

source: **Site Portfolio:** All sites for a client with contract counts
es: **Cartera de sitios:** Todos los sitios para un cliente con contrato cuentan

source: Contact Reports
es: Informes de contacto

source: **Contact List:** All contacts across contracts
es: **Lista de contactos:** Todos los contactos entre contratos

source: **Document Distribution:** Who received which documents
es: **Distribución de documentos:** Quién recibió qué documentos

source: **Active Contacts:** Currently active recipients
es: **Contactos activos:** Destinatarios actualmente activos

source: **Contact History:** Communication tracking over time
es: **Historial de contactos:** Seguimiento de comunicaciones a lo largo del tiempo

source: Troubleshooting
es: Solución de problemas

source: **Can't find site when creating contract:**
es: **No puedo encontrar el sitio al crear el contrato:**

source: Verify site is associated with correct client counterparty
es: Verificar que el sitio esté asociado con la contraparte del cliente correcta

source: Check that site belongs to your active company
es: Comprueba que el sitio pertenece a tu empresa activa

source: Ensure client is marked as active
es: Asegúrese de que el cliente esté marcado como activo

source: **Duplicate sites appearing:**
es: **Aparecen sitios duplicados:**

source: Review site names and addresses
es: Revisar nombres y direcciones de sitios

source: Consolidate duplicates by: 1. Updating contracts to use correct site 2. Marking duplicate site as inactive 3. Adding notes explaining consolidation
es: Consolide duplicados: 1. Actualizando contratos para usar el sitio correcto 2. Marcando sitio duplicado como inactivo 3. Agregando notas que expliquen la consolidación

source: **Site address changes:**
es: **Cambios de dirección del sitio:**

source: Update site address directly
es: Actualizar la dirección del sitio directamente

source: Existing contracts automatically reference new address
es: Los contratos existentes hacen referencia automáticamente a la nueva dirección

source: Consider adding note about address change date
es: Considere agregar una nota sobre la fecha del cambio de dirección

source: **Contact not receiving documents:**
es: **Contacto que no recibe documentos:**

source: Verify contact is marked as "Active"
es: Verificar que el contacto esté marcado como "Activo"

source: Check email address is correct
es: Verifique que la dirección de correo electrónico sea correcta

source: Confirm contact is associated with correct contract
es: Confirmar que el contacto está asociado con el contrato correcto

source: Review email delivery logs
es: Revisar los registros de entrega de correo electrónico

source: **Wrong contact on documents:**
es: **Contacto incorrecto en los documentos:**

source: Mark incorrect contact as inactive
es: Marcar contacto incorrecto como inactivo

source: Add correct contact with accurate information
es: Agregue el contacto correcto con información precisa

source: Update any pending documents
es: Actualizar cualquier documento pendiente

source: **Contact information outdated:**
es: **Información de contacto desactualizada:**

source: Update contact record directly
es: Actualizar registro de contacto directamente

source: Changes apply to future documents only
es: Los cambios se aplican solo a documentos futuros.

source: Past documents retain historical contact info (as intended)
es: Los documentos anteriores conservan información de contacto histórica (según lo previsto)

source: See Also
es: Ver también
