Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/index.po
Languages: es

source: Developer Documentation
es: Documentación del desarrollador

source: Welcome to the Construbot Developer Documentation! This section provides technical information for developers who want to install, deploy, or extend Construbot.
es: ¡Bienvenido a la documentación para desarrolladores de Construbot! Esta sección proporciona información técnica para desarrolladores que desean instalar, implementar o ampliar Construbot.

source: **Looking for user documentation?** See the :doc:`/user-guide/index` instead.
es: **¿Busca documentación de usuario?** Consulte :doc:`/user-guide/index` en su lugar.

source: Quick Links
es: Enlaces rápidos

source: Technical Overview
es: Descripción técnica

source: **Technology Stack:**
es: **Pila de tecnología:**

source: **Framework:** Django 3.2.19
es: **Marco:** Django 3.2.19

source: **Language:** Python >=3.9.17
es: **Idioma:** Python >=3.9.17

source: **Database:** PostgreSQL
es: **Base de datos:** PostgreSQL

source: **Cache/Queue:** Redis
es: **Caché/Cola:** Redis

source: **Task Queue:** Celery 5.2.7
es: **Cola de tareas:** Apio 5.2.7

source: **API:** Django REST Framework + SimpleJWT
es: **API:** Marco REST de Django + SimpleJWT

source: **Key Features:**
es: **Características clave:**

source: Multi-tenant architecture (Customer → Company → User)
es: Arquitectura multiinquilino (Cliente → Empresa → Usuario)

source: Hierarchical data structures (django-treebeard)
es: Estructuras de datos jerárquicas (django-treebeard)

source: JWT-based API authentication
es: Autenticación API basada en JWT

source: Autocomplete widgets (django-autocomplete-light)
es: Widgets de autocompletar (django-autocomplete-light)

source: PDF generation
es: generación de PDF

source: Excel import/export
es: Importación/exportación de Excel

source: Celery task processing
es: Procesamiento de tareas de apio

source: Project Structure
es: Estructura del proyecto

source: Quick Start
es: Inicio rápido

source: **For Docker:**
es: **Para Docker:**

source: **For Local Development:**
es: **Para Desarrollo Local:**

source: **See:** :doc:`installation/index` for detailed instructions.
es: **Consulte:** :doc:`installation/index` para obtener instrucciones detalladas.

source: Development Workflow
es: Flujo de trabajo de desarrollo

source: **Setup**: Install using Docker or local environment
es: **Configuración**: instalar usando Docker o un entorno local

source: **Configure**: Set environment variables in ``.env``
es: **Configurar**: Establecer variables de entorno en ``.env``

source: **Migrate**: Run database migrations
es: **Migrar**: ejecutar migraciones de bases de datos

source: **Populate**: Use ``make poblar`` for test data
es: **Rellenar**: Utilice ``hacer poblar`` para los datos de prueba

source: **Develop**: Make changes, run tests
es: **Desarrollar**: realizar cambios, ejecutar pruebas

source: **Test**: Run ``make test`` before committing
es: **Prueba**: Ejecute ``hacer prueba`` antes de confirmar

source: **Deploy**: Follow deployment guides
es: **Implementación**: siga las guías de implementación

source: Documentation Sections
es: Secciones de documentación

source: Key Concepts for Developers
es: Conceptos clave para desarrolladores

source: Multi-Tenancy
es: Multi-inquilino

source: Construbot uses a three-level hierarchy:
es: Construbot utiliza una jerarquía de tres niveles:

source: **Customer** (users.models.Customer) - Top-level account
es: **Cliente** (usuarios.modelos.Cliente) - Cuenta de nivel superior

source: **Company** (users.models.Company) - Business entity
es: **Empresa** (usuarios.modelos.Empresa) - Entidad comercial

source: **User** (users.models.User) - Individual with permissions
es: **Usuario** (usuarios.modelos.Usuario) - Individuo con permisos

source: All data models are scoped to a Company for isolation.
es: Todos los modelos de datos tienen como ámbito de aislamiento una empresa.

source: **Learn more:** :doc:`architecture/multi-tenancy`
es: **Más información:** :doc:`arquitectura/multi-inquilino`

source: Custom User Model
es: Modelo de usuario personalizado

source: ``AUTH_USER_MODEL = 'users.User'``
es: ``AUTH_USER_MODEL = 'usuarios.Usuario'``

source: Email-based authentication (not username)
es: Autenticación basada en correo electrónico (no nombre de usuario)

source: Company relationships (ManyToMany)
es: Relaciones con la empresa (muchos a muchos)

source: Permission levels (1-6)
es: Niveles de permiso (1-6)

source: Currently active company tracking
es: Seguimiento de la empresa actualmente activa

source: **Learn more:** :doc:`models/users`
es: **Más información:** :doc:`modelos/usuarios`

source: Settings Structure
es: Estructura de configuración

source: Environment-based settings in ``construbot/config/settings/``:
es: Configuraciones basadas en el entorno en ``construbot/config/settings/``:

source: ``base.py`` - Shared configuration
es: ``base.py`` - Configuración compartida

source: ``local.py`` - Development settings
es: ``local.py`` - Configuración de desarrollo

source: ``test.py`` - Testing configuration
es: ``test.py`` - Configuración de prueba

source: ``production.py`` - Production settings
es: ``producción.py`` - Configuración de producción

source: Controlled via ``DJANGO_SETTINGS_MODULE`` environment variable.
es: Controlado mediante la variable de entorno ``DJANGO_SETTINGS_MODULE``.

source: **Learn more:** :doc:`architecture/settings-structure`
es: **Más información:** :doc:`arquitectura/configuración-estructura`

source: Hierarchical Models
es: Modelos Jerárquicos

source: The Contrato (Contract) model uses django-treebeard's Materialized Path for hierarchical relationships:
es: El modelo Contrato utiliza la Ruta Materializada de django-treebeard para relaciones jerárquicas:

source: Parent contracts with sub-contracts
es: Contratos matrices con subcontratos

source: Tree queries for financial aggregation
es: Consultas de árbol para agregación financiera.

source: Move operations for reorganization
es: Mover operaciones para reorganización

source: **Learn more:** :doc:`models/proyectos`
es: **Más información:** :doc:`modelos/proyectos`

source: API Authentication
es: Autenticación API

source: REST API uses JWT tokens:
es: La API REST utiliza tokens JWT:

source: **Learn more:** :doc:`api/authentication`
es: **Más información:** :doc:`api/authentication`

source: Library Mode
es: Modo biblioteca

source: Set ``CONSTRUBOT_AS_LIBRARY=True`` to:
es: Establezca ``CONSTRUBOT_AS_LIBRARY=True`` en:

source: Disable standalone features (admin, accounts)
es: Deshabilitar funciones independientes (administrador, cuentas)

source: Use Construbot as a Django app in your project
es: Utilice Construbot como una aplicación Django en su proyecto

source: Integrate with existing authentication
es: Integrar con la autenticación existente

source: **Learn more:** :doc:`library-mode`
es: **Más información:** :doc:`modo-biblioteca`

source: Development Tools
es: Herramientas de desarrollo

source: Makefile Commands
es: Comandos de archivos Make

source: The project includes a comprehensive Makefile:
es: El proyecto incluye un Makefile completo:

source: **Full reference:** :doc:`/reference/makefile-commands`
es: **Referencia completa:** :doc:`/reference/makefile-commands`

source: Testing
es: Pruebas

source: **Learn more:** :doc:`/contributor/testing/index`
es: **Más información:** :doc:`/contributor/testing/index`

source: Code Quality
es: Calidad del código

source: **Style**: Follow PEP 8
es: **Estilo**: Sigue PEP 8

source: **Docstrings**: Google/NumPy style
es: **Cadenas de documentos**: estilo Google/NumPy

source: **Type Hints**: Encouraged but not required
es: **Sugerencias de tipo**: recomendado pero no obligatorio

source: **Testing**: Aim for >80% coverage
es: **Pruebas**: Apunta a una cobertura >80%

source: **Learn more:** :doc:`/contributor/code-style`
es: **Más información:** :doc:`/contributor/code-style`

source: Contributing
es: Contribuyendo

source: Want to contribute to Construbot?
es: ¿Quieres contribuir a Construbot?

source: **Fork** the repository
es: **Bifurcar** el repositorio

source: **Clone** your fork
es: **Clonar** tu tenedor

source: **Create** a feature branch
es: **Crear** una rama de funciones

source: **Make** your changes
es: **Haz** tus cambios

source: **Test** thoroughly
es: **Prueba** a fondo

source: **Submit** a pull request
es: **Enviar** una solicitud de extracción

source: **See:** :doc:`/contributor/index` for detailed guidelines.
es: **Consulte:** :doc:`/contributor/index` para obtener pautas detalladas.

source: Support & Resources
es: Soporte y recursos

source: **GitHub Repository**: https://github.com/javier-llamas/construbot
es: **Repositorio GitHub**: https://github.com/javier-llamas/construbot

source: **Issue Tracker**: https://github.com/javier-llamas/construbot/issues
es: **Seguimiento de problemas**: https://github.com/javier-llamas/construbot/issues

source: **License**: GNU Affero General Public License v3 (AGPLv3)
es: **Licencia**: Licencia pública general GNU Affero v3 (AGPLv3)

source: **Documentation**: https://construbot.readthedocs.io
es: **Documentación**: https://construbot.readthedocs.io

source: Need Help?
es: ¿Necesitar ayuda?

source: **Installation Issues**: See :doc:`installation/index`
es: **Problemas de instalación**: consulte :doc:`installation/index`

source: **Deployment Problems**: Check :doc:`deployment/index`
es: **Problemas de implementación**: Verifique :doc:`deployment/index`

source: **API Questions**: Review :doc:`api/index`
es: **Preguntas sobre API**: Revisión :doc:`api/index`

source: **Bug Reports**: :doc:`/contributor/issue-reporting`
es: **Informes de errores**: :doc:`/contributor/issue-reporting`
