Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/library-mode.po
Languages: es

source: Library Mode
es: Modo biblioteca

source: Using Construbot as a Django app within your own project.
es: Usando Construbot como una aplicación Django dentro de tu propio proyecto.

source: Overview
es: Descripción general

source: Construbot can run in two modes:
es: Construbot puede ejecutarse en dos modos:

source: **Standalone Mode** (default) - Full application with admin, accounts, authentication
es: **Modo independiente** (predeterminado): aplicación completa con administrador, cuentas y autenticación

source: **Library Mode** - Django app embedded in your project
es: **Modo Biblioteca** - Aplicación Django integrada en tu proyecto

source: **Enable library mode:**
es: **Habilitar modo biblioteca:**

source: What Changes
es: ¿Qué cambia?

source: **When CONSTRUBOT_AS_LIBRARY=True:**
es: **Cuando CONSTRUBOT_AS_LIBRARY=Verdadero:**

source: ❌ **Disabled:**
es: ❌ **Desactivado:**

source: Django admin interface
es: Interfaz de administración de Django

source: allauth URLs (account management)
es: URL de allauth (administración de cuentas)

source: Standalone authentication views
es: Vistas de autenticación independientes

source: Account configuration app
es: Aplicación de configuración de cuenta

source: ✅ **Still Available:**
es: ✅ **Aún disponible:**

source: Core business models (Contrato, Estimate, etc.)
es: Modelos de negocio principales (Contrato, Estimate, etc.)

source: API endpoints
es: Puntos finales API

source: Business logic and views (if you include URLs)
es: Lógica empresarial y vistas (si incluye URL)

source: Template tags and utilities
es: Etiquetas de plantilla y utilidades

source: Use Cases
es: Casos de uso

source: **When to use library mode:**
es: **Cuándo usar el modo biblioteca:**

source: Integrating Construbot into existing Django project
es: Integrando Construbot en el proyecto Django existente

source: Using your own authentication system
es: Usando su propio sistema de autenticación

source: Customizing admin interface
es: Personalización de la interfaz de administración

source: Building custom frontend
es: Construyendo una interfaz personalizada

source: **When NOT to use:**
es: **Cuándo NO usarlo:**

source: Need complete standalone solution
es: Necesita una solución independiente completa

source: Want built-in authentication
es: Quiere autenticación integrada

source: Using out-of-the-box
es: Uso listo para usar

source: Setup
es: Configuración

source: **1. Install package:**
es: **1. Instalar paquete:**

source: **2. Add to INSTALLED_APPS:**
es: **2. Añadir a INSTALLED_APPS:**

source: **3. Set library mode:**
es: **3. Establecer modo de biblioteca:**

source: **4. Include URLs (optional):**
es: **4. Incluir URL (opcional):**

source: **5. Run migrations:**
es: **5. Ejecutar migraciones:**

source: Configuration
es: Configuración

source: **Settings:**
es: **Ajustes:**

source: Integration Patterns
es: Patrones de integración

source: Using Construbot Models
es: Usando modelos Construbot

source: Custom Authentication
es: Autenticación personalizada

source: API Only
es: Solo API

source: Limitations
es: Limitaciones

source: **In library mode:**
es: **En modo biblioteca:**

source: No built-in admin interface (use Django admin or build your own)
es: Sin interfaz de administración incorporada (use el administrador de Django o cree el suyo propio)

source: No user registration/login views (implement your own)
es: Sin vistas de registro/inicio de sesión de usuario (implemente las suyas propias)

source: Manual setup required for permissions
es: Se requiere configuración manual para los permisos

source: Need to handle company switching yourself
es: Necesita gestionar el cambio de empresa usted mismo

source: Troubleshooting
es: Solución de problemas

source: **"No module named construbot":**
es: **"Ningún módulo llamado constructbot":**

source: Ensure Construbot is installed:
es: Asegúrese de que Construbot esté instalado:

source: **"Table doesn't exist":**
es: **"La tabla no existe":**

source: Run migrations:
es: Ejecutar migraciones:

source: **"AUTH_USER_MODEL conflicts":**
es: **"Conflictos AUTH_USER_MODEL":**

source: Choose one:
es: Elige uno:

source: Use Construbot's User model: ``AUTH_USER_MODEL = 'users.User'``
es: Utilice el modelo de usuario de Construbot: ``AUTH_USER_MODEL = 'users.User'``

source: Create custom integration between your User and Construbot models
es: Cree una integración personalizada entre sus modelos User y Construbot

source: Example Project
es: Proyecto de ejemplo

source: See Also
es: Ver también
