Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/authentication.po
Languages: es

source: Authentication
es: Autenticación

source: Email-based authentication system with multi-company support.
es: Sistema de autenticación basado en correo electrónico con soporte multiempresa.

source: Overview
es: Descripción general

source: **Key features:**
es: **Características clave:**

source: Email as username (no separate username field)
es: Correo electrónico como nombre de usuario (sin campo de nombre de usuario separado)

source: Custom authentication backend
es: Backend de autenticación personalizada

source: Multi-company access without re-login
es: Acceso multiempresa sin necesidad de volver a iniciar sesión

source: django-allauth integration
es: integración django-allauth

source: JWT tokens for API
es: Tokens JWT para API

source: **Models:**
es: **Modelos:**

source: Custom User model (``users.User``)
es: Modelo de usuario personalizado (``usuarios.Usuario``)

source: Session-based for web
es: Basado en sesiones para web

source: JWT for API
es: JWT para API

source: Custom User Model
es: Modelo de usuario personalizado

source: **AUTH_USER_MODEL:** ``users.User``
es: **AUTH_USER_MODEL:** ``usuarios.Usuario``

source: **Settings:**
es: **Ajustes:**

source: Authentication Backend
es: Servidor de autenticación

source: **File:** ``construbot/core/backends.py``
es: **Archivo:** ``construbot/core/backends.py``

source: Web Authentication
es: Autenticación web

source: Login View
es: Iniciar sesión Ver

source: Session Management
es: Gestión de sesiones

source: **Sessions stored in:**
es: **Sesiones almacenadas en:**

source: Database (default): ``django.contrib.sessions.backends.db``
es: Base de datos (predeterminada): ``django.contrib.sessions.backends.db``

source: Cache (faster): ``django.contrib.sessions.backends.cache``
es: Caché (más rápido): ``django.contrib.sessions.backends.cache``

source: Cached DB (recommended): ``django.contrib.sessions.backends.cached_db``
es: Base de datos en caché (recomendado): ``django.contrib.sessions.backends.cached_db``

source: Company Context in Session
es: Contexto de la empresa en la sesión

source: django-allauth Integration
es: Integración Django Allauth

source: **Configuration:**
es: **Configuración:**

source: **URLs:**
es: **URL:**

source: **Templates:**
es: **Plantillas:**

source: Override allauth templates in ``templates/account/``:
es: Anule todas las plantillas de autenticación en ``templates/account/``:

source: ``login.html``
es: ``iniciar sesión.html``

source: ``signup.html``
es: ``registro.html``

source: ``password_reset.html``
es: ``contraseña_reset.html``

source: API Authentication
es: Autenticación API

source: JWT Configuration
es: Configuración JWT

source: **Packages:**
es: **Paquetes:**

source: ``djangorestframework``
es: ``marcodjangorest``

source: Obtaining Tokens
es: Obtener fichas

source: **Request:**
es: **Pedido:**

source: **Response:**
es: **Respuesta:**

source: Using Tokens
es: Usando fichas

source: Refreshing Tokens
es: Fichas refrescantes

source: Password Management
es: Gestión de contraseñas

source: Password Hashing
es: Hash de contraseña

source: **Argon2 (recommended):**
es: **Argón2 (recomendado):**

source: **Requires:**
es: **Requiere:**

source: Password Reset
es: Restablecer contraseña

source: **Email template:**
es: **Plantilla de correo electrónico:**

source: Create ``templates/account/email/password_reset_key_message.txt``
es: Cree ``plantillas/cuenta/correo electrónico/contraseña_reset_key_message.txt``

source: **Flow:**
es: **Fluir:**

source: User requests reset → email sent
es: Restablecimiento de solicitudes de usuario → correo electrónico enviado

source: Click link → enter new password
es: Haga clic en el enlace → ingrese una nueva contraseña

source: Password updated → can log in
es: Contraseña actualizada → puede iniciar sesión

source: Change Password
es: Cambiar la contraseña

source: Permissions & Authorization
es: Permisos y autorización

source: Login Required
es: Iniciar sesión requerido

source: **Class-based views:**
es: **Vistas basadas en clases:**

source: Permission Level Check
es: Verificación del nivel de permiso

source: See :doc:`permission-levels` for details.
es: Consulte :doc:`permission-levels` para obtener más detalles.

source: Security Best Practices
es: Mejores prácticas de seguridad

source: **1. Use HTTPS in production:**
es: **1. Utilice HTTPS en producción:**

source: **2. Strong password requirements:**
es: **2. Requisitos de contraseña fuertes:**

source: **3. Rate limiting:**
es: **3. Limitación de tarifa:**

source: Use django-ratelimit or similar.
es: Utilice django-ratelimit o similar.

source: **4. Two-factor authentication (optional):**
es: **4. Autenticación de dos factores (opcional):**

source: Use django-otp or django-allauth 2FA.
es: Utilice django-otp o django-allauth 2FA.

source: **5. Session security:**
es: **5. Seguridad de la sesión:**

source: Troubleshooting
es: Solución de problemas

source: **"User matching query does not exist":**
es: **"La consulta de coincidencia del usuario no existe":**

source: Check email is correct
es: Compruebe que el correo electrónico sea correcto

source: Verify user exists in database
es: Verificar que el usuario exista en la base de datos

source: Confirm AUTH_USER_MODEL setting
es: Confirmar la configuración AUTH_USER_MODEL

source: **"Invalid credentials":**
es: **"Credenciales no válidas":**

source: Verify password is correct
es: Verificar que la contraseña sea correcta

source: Check authentication backend is configured
es: Verifique que el backend de autenticación esté configurado

source: Ensure user is active (``is_active=True``)
es: Asegúrese de que el usuario esté activo (``is_active=True``)

source: **API 401 Unauthorized:**
es: **API 401 no autorizado:**

source: Check token is included in header
es: El token de cheque está incluido en el encabezado

source: Verify token hasn't expired
es: Verificar que el token no haya caducado

source: Confirm token format: ``Bearer <token>``
es: Confirmar formato del token: ``Portador <token>``

source: **Session not persisting:**
es: **La sesión no persiste:**

source: Check SESSION_COOKIE_SECURE with HTTP (should be False for local)
es: Verifique SESSION_COOKIE_SECURE con HTTP (debe ser Falso para local)

source: Verify browser accepts cookies
es: Verifique que el navegador acepte cookies

source: Check session backend is configured
es: Verifique que el backend de la sesión esté configurado

source: See Also
es: Ver también
