Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/database-schema.po
Languages: es

source: Database Schema
es: Esquema de base de datos

source: Database design and relationships in Construbot.
es: Diseño y relaciones de bases de datos en Construbot.

source: Overview
es: Descripción general

source: **Database:** PostgreSQL 12+
es: **Base de datos:** PostgreSQL 12+

source: **Key model groups:**
es: **Grupos de modelos clave:**

source: **Users & Auth:** User, Company, Customer, NivelAcceso
es: **Usuarios y Autenticación:** Usuario, Empresa, Cliente, NivelAcceso

source: **Contracts:** Contrato (hierarchical), Contraparte, Sitio
es: **Contratos:** Contrato (jerárquico), Contraparte, Sitio

source: **Financials:** Estimate, Concept, Retenciones
es: **Finanzas:** Estimación, Concepto, Retenciones

source: **Configuration:** Account settings, Units
es: **Configuración:** Configuración de cuenta, Unidades

source: Core Relationships
es: Relaciones centrales

source: Multi-Tenancy Structure
es: Estructura de arrendamiento múltiple

source: **Foreign keys:**
es: **Claves externas:**

source: Company → Customer
es: Empresa → Cliente

source: User ↔ Company (ManyToMany through UserCompany)
es: Usuario ↔ Empresa (ManyToMany a través de UserCompany)

source: All business models → Company
es: Todos los modelos de negocio → Empresa

source: Contract Hierarchy
es: Jerarquía de contratos

source: **Tree operations:**
es: **Operaciones de árbol:**

source: ``get_ancestors()``
es: ``get_ancestros()``

source: ``get_descendants()``
es: ``get_descendientes()``

source: ``move(target, pos)``
es: ``mover(objetivo, pos)``

source: Contract Relationships
es: Relaciones contractuales

source: Key Models Reference
es: Referencia de modelos clave

source: Users & Companies
es: Usuarios y Empresas

source: **Customer:**
es: **Cliente:**

source: **Company:**
es: **Compañía:**

source: **User:**
es: **Usuario:**

source: Contracts & Counterparties
es: Contratos y Contrapartes

source: Estimates & Concepts
es: Estimaciones y conceptos

source: **Estimate:**
es: **Estimar:**

source: **Concept:**
es: **Concepto:**

source: Indexes & Constraints
es: Índices y restricciones

source: Indexes
es: Índices

source: **Common patterns:**
es: **Patrones comunes:**

source: Unique Constraints
es: Restricciones únicas

source: **Company-scoped uniqueness:**
es: **Singularidad en el ámbito de la empresa:**

source: Database Queries
es: Consultas de bases de datos

source: Select Related
es: Seleccione Relacionados

source: **Optimize foreign keys:**
es: **Optimizar claves externas:**

source: Prefetch Related
es: Relacionados con la captación previa

source: **Optimize reverse FK and M2M:**
es: **Optimizar FK inverso y M2M:**

source: Tree Queries
es: Consultas de árbol

source: **Hierarchical data:**
es: **Datos jerárquicos:**

source: Migrations
es: Migraciones

source: **Key migrations:**
es: **Migraciones clave:**

source: Initial: Create all models
es: Inicial: crear todos los modelos

source: django-treebeard: Add path/depth/numchild fields
es: django-treebeard: Agregar campos de ruta/profundidad/numchild

source: Company scoping: Add company FK to all models
es: Alcance de la empresa: agregar la empresa FK a todos los modelos

source: Unique constraints: Add unique_together
es: Restricciones únicas: agregue Unique_together

source: **Run migrations:**
es: **Ejecutar migraciones:**

source: Database Optimization
es: Optimización de la base de datos

source: Connection Pooling
es: Agrupación de conexiones

source: Atomic Transactions
es: Transacciones atómicas

source: Query Analysis
es: Análisis de consultas

source: See Also
es: Ver también
