Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/index.po
Languages: es

source: Architecture
es: Arquitectura

source: Technical architecture and design patterns used in Construbot.
es: Arquitectura técnica y patrones de diseño utilizados en Construbot.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot is a Django-based construction management system built with modern patterns and best practices. This section explains the architectural decisions, data models, and system design.
es: Construbot es un sistema de gestión de construcción basado en Django creado con patrones modernos y mejores prácticas. Esta sección explica las decisiones arquitectónicas, los modelos de datos y el diseño del sistema.

source: Quick Reference
es: Referencia rápida

source: Technology Stack
es: Pila de tecnología

source: **Backend:**
es: **Servidor:**

source: Python 3.9.17+
es: Pitón 3.9.17+

source: **Task Queue:**
es: **Cola de tareas:**

source: Celery 5.2.7
es: Apio 5.2.7

source: Redis broker
es: corredor de Redis

source: Django REST Framework 3.13.1
es: Marco REST de Django 3.13.1

source: **Key Libraries:**
es: **Bibliotecas clave:**

source: django-treebeard 4.5.1 (hierarchical models)
es: django-treebeard 4.5.1 (modelos jerárquicos)

source: django-allauth 0.51.0 (authentication)
es: django-allauth 0.51.0 (autenticación)

source: django-autocomplete-light 3.9.4 (autocomplete widgets)
es: django-autocomplete-light 3.9.4 (widgets de autocompletar)

source: reportlab 3.6.12 (PDF generation)
es: reportlab 3.6.12 (generación de PDF)

source: openpyxl 3.0.10 (Excel import/export)
es: openpyxl 3.0.10 (importación/exportación de Excel)

source: System Components
es: Componentes del sistema

source: Application Layer
es: Capa de aplicación

source: Data Flow
es: Flujo de datos

source: **User Request:**
es: **Solicitud de usuario:**

source: User accesses application → Nginx
es: El usuario accede a la aplicación → Nginx

source: Nginx proxies to Gunicorn
es: Nginx representa a Gunicorn

source: Gunicorn runs Django request/response cycle
es: Gunicorn ejecuta el ciclo de solicitud/respuesta de Django

source: Django queries PostgreSQL for data
es: Django consulta PostgreSQL para obtener datos

source: Django uses Redis for caching
es: Django usa Redis para el almacenamiento en caché

source: Response rendered and returned
es: Respuesta emitida y devuelta

source: **Background Task:**
es: **Tarea en segundo plano:**

source: User action triggers task → Celery delay()
es: La acción del usuario desencadena la tarea → Retraso de apio()

source: Task queued in Redis
es: Tarea en cola en Redis

source: Celery worker picks up task
es: El trabajador del apio retoma su tarea

source: Worker executes task (e.g., send email, generate PDF)
es: El trabajador ejecuta la tarea (por ejemplo, enviar correo electrónico, generar PDF)

source: Result stored in Redis (optional)
es: Resultado almacenado en Redis (opcional)

source: Application Structure
es: Estructura de la aplicación

source: Django Apps
es: Aplicaciones Django

source: **construbot.users** - User management
es: **construbot.users** - Gestión de usuarios

source: Custom User model (email-based auth)
es: Modelo de usuario personalizado (autenticación basada en correo electrónico)

source: Company and Customer models
es: Modelos de empresa y cliente

source: Permission levels (NivelAcceso)
es: Niveles de permisos (NivelAcceso)

source: Authentication backends
es: Motores de autenticación

source: **construbot.proyectos** - Core business logic
es: **construbot.proyectos** - Lógica empresarial central

source: Contract management (Contrato)
es: Gestión de contratos (Contrato)

source: Counterparty management (Contraparte)
es: Gestión de contraparte (Contraparte)

source: Estimate tracking (Estimate)
es: Seguimiento de estimación (Estimación)

source: Hierarchical data structures
es: Estructuras de datos jerárquicas

source: Financial calculations
es: Cálculos financieros

source: **construbot.api** - REST API
es: **construbot.api** - API REST

source: JWT authentication
es: autenticación JWT

source: API endpoints for mobile/external access
es: Puntos finales API para acceso móvil/externo

source: Serializers and viewsets
es: Serializadores y conjuntos de vistas

source: Data migration endpoints
es: Puntos finales de migración de datos

source: **construbot.core** - Shared utilities
es: **construbot.core** - Utilidades compartidas

source: Base models and mixins
es: Modelos base y mixins.

source: Custom authentication backend
es: Backend de autenticación personalizada

source: Utility functions
es: Funciones de utilidad

source: Shared templates
es: Plantillas compartidas

source: **construbot.account_config** - Account configuration
es: **construbot.account_config** - Configuración de cuenta

source: Company-specific settings
es: Configuraciones específicas de la empresa

source: Custom login forms
es: Formularios de inicio de sesión personalizados

source: Account preferences
es: Preferencias de cuenta

source: **construbot.taskapp** - Celery configuration
es: **construbot.taskapp** - Configuración de apio

source: Celery app initialization
es: Inicialización de la aplicación de apio

source: Task definitions
es: Definiciones de tareas

source: Periodic task setup
es: Configuración de tareas periódicas

source: Directory Structure
es: Estructura del directorio

source: Design Patterns
es: Patrones de diseño

source: Multi-Tenancy
es: Multi-inquilino

source: **Three-level hierarchy:**
es: **Jerarquía de tres niveles:**

source: **Data isolation:**
es: **Aislamiento de datos:**

source: All business data scoped to Company
es: Todos los datos comerciales enfocados a la empresa

source: Users can belong to multiple Companies
es: Los usuarios pueden pertenecer a varias empresas.

source: Active company tracked in session
es: Empresa activa rastreada en la sesión

source: See :doc:`multi-tenancy` for details.
es: Consulte :doc:`multi-tenancy` para obtener más detalles.

source: Hierarchical Models
es: Modelos Jerárquicos

source: **django-treebeard Materialized Path:**
es: **Camino materializado de Django-treebeard:**

source: Contracts (Contrato) form tree structures:
es: Los contratos (Contrato) forman estructuras de árbol:

source: **Benefits:**
es: **Beneficios:**

source: Efficient parent/child queries
es: Consultas eficientes entre padres e hijos

source: Tree aggregations (sum amounts)
es: Agregaciones de árboles (cantidades totales)

source: Move operations
es: Operaciones de movimiento

source: Path-based queries
es: Consultas basadas en rutas

source: **Implementation:**
es: **Implementación:**

source: Custom Authentication
es: Autenticación personalizada

source: **Email-based authentication:**
es: **Autenticación basada en correo electrónico:**

source: No username field
es: Sin campo de nombre de usuario

source: Email as unique identifier
es: Correo electrónico como identificador único

source: **Multi-company support:**
es: **Soporte multiempresa:**

source: User can access multiple companies
es: El usuario puede acceder a múltiples empresas.

source: Company switch without re-login
es: Cambio de empresa sin volver a iniciar sesión

source: Per-company permissions
es: Permisos por empresa

source: See :doc:`authentication` for details.
es: Consulte :doc:`autenticación` para obtener más detalles.

source: Permission System
es: Sistema de permisos

source: **Six permission levels (NIVELES_ACCESO):**
es: **Seis niveles de permisos (NIVELES_ACCESO):**

source: Auxiliar (1) - View only
es: Auxiliar (1) - Ver solo

source: Coordinador (2) - Create/edit
es: Coordinador (2) - Crear/editar

source: Director (3) - Full CRUD
es: Director (3) - CRUD completo

source: Corporativo (4) - Cross-company
es: Corporativo (4) - Multiempresa

source: Soporte (5) - Support access
es: Soporte (5) - Acceso al soporte

source: Superusuario (6) - Full system access
es: Superusuario (6) - Acceso completo al sistema

source: See :doc:`permission-levels` for details.
es: Consulte :doc:`permission-levels` para obtener más detalles.

source: Data Access Patterns
es: Patrones de acceso a datos

source: Query Optimization
es: Optimización de consultas

source: **Select Related (foreign keys):**
es: **Seleccione Relacionado (claves externas):**

source: **Prefetch Related (many-to-many):**
es: **Relacionado con la captación previa (muchos a muchos):**

source: **Database indexes:**
es: **Índices de bases de datos:**

source: Caching Strategy
es: Estrategia de almacenamiento en caché

source: **Per-view caching:**
es: **Almacenamiento en caché por vista:**

source: **Template fragment caching:**
es: **Almacenamiento en caché de fragmentos de plantilla:**

source: **Query result caching:**
es: **Almacenamiento en caché de resultados de consultas:**

source: Atomic Transactions
es: Transacciones atómicas

source: **Enabled by default:**
es: **Habilitado de forma predeterminada:**

source: **Manual transaction control:**
es: **Control manual de transacciones:**

source: API Design
es: Diseño API

source: REST API Structure
es: Estructura de la API REST

source: **Base URL:** ``/api/v1/``
es: **URL base:** ``/api/v1/``

source: **Authentication:** JWT tokens
es: **Autenticación:** tokens JWT

source: **Endpoints:**
es: **Puntos finales:**

source: **Response format:**
es: **Formato de respuesta:**

source: See :doc:`../api/index` for complete API documentation.
es: Consulte :doc:`../api/index` para obtener la documentación API completa.

source: Security Architecture
es: Arquitectura de seguridad

source: Authentication Flow
es: Flujo de autenticación

source: **Web application:**
es: **Aplicación web:**

source: User submits email/password
es: El usuario envía correo electrónico/contraseña

source: Backend authenticates against User model
es: El backend se autentica contra el modelo de usuario

source: Session created with company context
es: Sesión creada con el contexto de la empresa.

source: User redirected to dashboard
es: Usuario redirigido al panel

source: Client posts credentials to ``/api-token-auth/``
es: El cliente publica credenciales en ``/api-token-auth/``

source: Server validates and returns JWT token
es: El servidor valida y devuelve el token JWT

source: Client includes token in ``Authorization: Bearer <token>`` header
es: El cliente incluye el token en el encabezado ``Autorización: Portador <token>``

source: Server validates token on each request
es: El servidor valida el token en cada solicitud

source: Authorization Layers
es: Capas de autorización

source: **1. Authentication required:**
es: **1. Se requiere autenticación:**

source: **2. Permission level check:**
es: **2. Comprobación del nivel de permiso:**

source: **3. Company-scoped data:**
es: **3. Datos al alcance de la empresa:**

source: See :doc:`authentication` and :doc:`permission-levels` for details.
es: Consulte :doc:`authentication` y :doc:`permission-levels` para obtener más detalles.

source: Performance Considerations
es: Consideraciones de rendimiento

source: Database
es: Base de datos

source: Connection pooling (``CONN_MAX_AGE``)
es: Agrupación de conexiones (``CONN_MAX_AGE``)

source: Query optimization (select_related/prefetch_related)
es: Optimización de consultas (select_ related/prefetch_ related)

source: Database indexes on frequently queried fields
es: Índices de bases de datos en campos consultados con frecuencia

source: Atomic requests for data integrity
es: Solicitudes atómicas para la integridad de los datos

source: Caching
es: Almacenamiento en caché

source: Redis for cache backend
es: Redis para backend de caché

source: Session storage in cache
es: Almacenamiento de sesiones en caché

source: Query result caching
es: Almacenamiento en caché de resultados de consultas

source: Template fragment caching
es: Almacenamiento en caché de fragmentos de plantilla

source: Static Files
es: Archivos estáticos

source: WhiteNoise for efficient serving
es: WhiteNoise para un servicio eficiente

source: Gzip/Brotli compression
es: Compresión Gzip/Brotli

source: Far-future cache headers
es: Encabezados de caché de futuro lejano

source: CDN for high-traffic deployments
es: CDN para implementaciones de alto tráfico

source: Background Tasks
es: Tareas en segundo plano

source: Celery for asynchronous operations
es: Apio para operaciones asincrónicas

source: Email sending in background
es: Envío de correo electrónico en segundo plano

source: PDF generation in background
es: Generación de PDF en segundo plano

source: Scheduled tasks with Celery Beat
es: Tareas programadas con Celery Beat

source: Scalability
es: Escalabilidad

source: Vertical Scaling
es: Escalado vertical

source: Increase server CPU/RAM
es: Aumentar la CPU/RAM del servidor

source: Upgrade database instance
es: Actualizar instancia de base de datos

source: Add Redis memory
es: Agregar memoria Redis

source: Horizontal Scaling
es: Escala horizontal

source: Multiple Django application servers
es: Múltiples servidores de aplicaciones Django

source: Load balancer (ALB/Nginx)
es: Equilibrador de carga (ALB/Nginx)

source: Managed database (RDS with read replicas)
es: Base de datos administrada (RDS con réplicas de lectura)

source: External cache (ElastiCache)
es: Caché externo (ElastiCache)

source: S3 for media files
es: S3 para archivos multimedia

source: **Stateless application servers** enable easy horizontal scaling.
es: **Los servidores de aplicaciones sin estado** permiten un fácil escalado horizontal.

source: Monitoring Points
es: Puntos de Monitoreo

source: Application Metrics
es: Métricas de aplicación

source: Request/response times
es: Tiempos de solicitud/respuesta

source: Error rates (4xx, 5xx)
es: Tasas de error (4xx, 5xx)

source: Database query performance
es: Rendimiento de consultas de bases de datos

source: Cache hit/miss ratio
es: Proporción de aciertos/errores de caché

source: Celery task queue length
es: Longitud de la cola de tareas de apio

source: Infrastructure Metrics
es: Métricas de infraestructura

source: CPU usage
es: uso de CPU

source: Memory usage
es: Uso de memoria

source: Disk I/O
es: E/S de disco

source: Network traffic
es: Tráfico de red

source: Database connections
es: Conexiones de bases de datos

source: Business Metrics
es: Métricas comerciales

source: Active users
es: Usuarios activos

source: Contracts created
es: Contratos creados

source: Estimates generated
es: Estimaciones generadas

source: PDF downloads
es: Descargas de PDF

source: API usage
es: Uso de API

source: See :doc:`../deployment/index` for monitoring setup.
es: Consulte :doc:`../deployment/index` para conocer la configuración del monitoreo.

source: Development Workflow
es: Flujo de trabajo de desarrollo

source: Local Development
es: Desarrollo Local

source: Use Docker Compose for consistent environment
es: Utilice Docker Compose para un entorno coherente

source: Run ``make dev`` to start services
es: Ejecute ``make dev`` para iniciar los servicios

source: Code changes auto-reload (Django development server)
es: Recarga automática de cambios de código (servidor de desarrollo Django)

source: Use ``make shell`` for Django shell
es: Utilice ``make shell`` para Django shell

source: Run ``make test`` before committing
es: Ejecute ``make test`` antes de confirmar

source: See :doc:`../installation/index` for setup.
es: Consulte :doc:`../installation/index` para la configuración.

source: Testing Strategy
es: Estrategia de prueba

source: Unit tests for models and utilities
es: Pruebas unitarias para modelos y utilidades.

source: Integration tests for views
es: Pruebas de integración para vistas.

source: API tests for REST endpoints
es: Pruebas API para puntos finales REST

source: Coverage target: >80%
es: Objetivo de cobertura: >80%

source: See :doc:`/contributor/testing/index` for testing guide.
es: Consulte :doc:`/contributor/testing/index` para obtener una guía de prueba.

source: Deployment Process
es: Proceso de implementación

source: Run tests (``make test``)
es: Ejecutar pruebas (``hacer prueba``)

source: Build Docker images
es: Construir imágenes de Docker

source: Run database migrations
es: Ejecutar migraciones de bases de datos

source: Collect static files
es: Recopilar archivos estáticos

source: Restart application servers
es: Reiniciar los servidores de aplicaciones

source: Verify deployment
es: Verificar implementación

source: See :doc:`../deployment/index` for deployment guide.
es: Consulte :doc:`../deployment/index` para obtener una guía de implementación.

source: See Also
es: Ver también
