Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/multi-tenancy.po
Languages: es

source: Multi-Tenancy
es: Multi-inquilino

source: Construbot's multi-tenant architecture with three-level hierarchy.
es: Arquitectura multiinquilino de Construbot con jerarquía de tres niveles.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot uses a **three-level multi-tenant architecture**:
es: Construbot utiliza una **arquitectura multiinquilino de tres niveles**:

source: **Customer** - Top-level account (organization)
es: **Cliente** - Cuenta de nivel superior (organización)

source: **Company** - Business entity within customer
es: **Empresa**: entidad comercial dentro del cliente

source: **User** - Individual with access to one or more companies
es: **Usuario** - Particular con acceso a una o más empresas

source: **Data isolation:** All business data is scoped to Company level.
es: **Aislamiento de datos:** Todos los datos comerciales tienen como alcance el nivel de empresa.

source: Hierarchy Structure
es: Estructura jerárquica

source: **Key points:**
es: **Puntos clave:**

source: Users can belong to multiple companies
es: Los usuarios pueden pertenecer a varias empresas.

source: Data is never shared between companies
es: Los datos nunca se comparten entre empresas

source: Users switch between companies without re-login
es: Los usuarios cambian de empresa sin volver a iniciar sesión

source: Models
es: Modelos

source: Customer Model
es: Modelo de cliente

source: **File:** ``construbot/users/models.py``
es: **Archivo:** ``construbot/users/models.py``

source: **Purpose:**
es: **Objetivo:**

source: Group related companies
es: Empresas vinculadas al grupo

source: Billing aggregation (if needed)
es: Agregación de facturación (si es necesario)

source: Corporate-level reporting
es: Informes a nivel corporativo

source: Company Model
es: Modelo de empresa

source: Primary tenant boundary
es: Límite del inquilino principal

source: All business data scoped here
es: Todos los datos comerciales incluidos aquí

source: Separate operational entities
es: Entidades operativas separadas

source: User Model
es: Modelo de usuario

source: UserCompany (Through Model)
es: UserCompany (a través del modelo)

source: Data Isolation
es: Aislamiento de datos

source: Company-Scoped Models
es: Modelos de ámbito empresarial

source: **All business models include company foreign key:**
es: **Todos los modelos de negocio incluyen clave externa de la empresa:**

source: **Other scoped models:**
es: **Otros modelos con alcance:**

source: ``Contraparte`` (Counterparty)
es: ``Contraparte`` (Contraparte)

source: ``Sitio`` (Site)
es: ``Sitio`` (Sitio)

source: ``Estimate`` (Estimate)
es: ``Estimación`` (Estimación)

source: ``Concept`` (Line Item)
es: ``Concepto`` (Artículo de línea)

source: ``Retenciones`` (Retention)
es: ``Retenciones``

source: Querying with Company Filter
es: Consulta con filtro de empresa

source: **Always filter by company:**
es: **Filtrar siempre por empresa:**

source: **Model manager (optional pattern):**
es: **Administrador de modelos (patrón opcional):**

source: Active Company Management
es: Gestión Activa de la Empresa

source: Setting Active Company
es: Configuración de empresa activa

source: **During login:**
es: **Durante el inicio de sesión:**

source: **Company switching:**
es: **Cambio de empresa:**

source: Middleware (Optional)
es: Middleware (opcional)

source: Template Context
es: Contexto de plantilla

source: **Access in templates:**
es: **Acceso en plantillas:**

source: Multi-Company Forms
es: Formularios multiempresa

source: Limit Choices to Current Company
es: Limite las opciones a la empresa actual

source: **In views:**
es: **En vistas:**

source: Admin Interface
es: Interfaz de administración

source: Company-Scoped Admin
es: Administrador centrado en la empresa

source: API Considerations
es: Consideraciones de API

source: Company from Token
es: Empresa de Token

source: Company Header (Alternative)
es: Cabecera de empresa (alternativa)

source: Best Practices
es: Mejores prácticas

source: **1. Always scope queries:**
es: **1. Consultas de alcance siempre:**

source: **2. Validate company access:**
es: **2. Validar acceso de empresa:**

source: **3. Set company on create:**
es: **3. Establecer empresa al crear:**

source: **4. Use unique_together:**
es: **4. Utilice Unique_together:**

source: **5. Test data isolation:**
es: **5. Aislamiento de datos de prueba:**

source: Common Patterns
es: Patrones comunes

source: Company Context Manager
es: Administrador de contexto de la empresa

source: **Usage:**
es: **Uso:**

source: User Permission by Company
es: Permiso de usuario por empresa

source: Troubleshooting
es: Solución de problemas

source: **User can't see data:**
es: **El usuario no puede ver los datos:**

source: Check ``active_company`` is set
es: Verifique que ``active_company`` esté configurada

source: Verify user is in company's users
es: Verificar que el usuario esté en los usuarios de la empresa.

source: Confirm queries filter by ``company``
es: Confirmar consultas filtradas por ``empresa``

source: **Data leaking between companies:**
es: **Fuga de datos entre empresas:**

source: Review querysets - must filter by ``company``
es: Revisar conjuntos de consultas: debe filtrar por ``empresa``

source: Check forms limit choices to current company
es: Los formularios de verificación limitan las opciones a la empresa actual

source: Verify ``unique_together`` includes ``company``
es: Verifique que ``unique_together`` incluya ``empresa``

source: **Company switch not working:**
es: **El interruptor de empresa no funciona:**

source: Ensure ``active_company`` is saved
es: Asegúrese de que ``active_company`` esté guardado

source: Check session is persisting
es: La sesión de verificación persiste

source: Verify user has access to target company
es: Verificar que el usuario tenga acceso a la empresa objetivo

source: See Also
es: Ver también
