Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/overview.po
Languages: es

source: Overview
es: Descripción general

source: High-level system architecture of Construbot.
es: Arquitectura del sistema de alto nivel de Construbot.

source: **This page provides a quick overview.** For comprehensive architecture documentation with diagrams and code examples, see the :doc:`index`.
es: **Esta página proporciona una descripción general rápida.** Para obtener documentación completa sobre la arquitectura con diagramas y ejemplos de código, consulte el :doc:`index`.

source: System Architecture
es: Arquitectura del sistema

source: Construbot follows a standard Django MTV (Model-Template-View) architecture with additional layers for API, background tasks, and caching.
es: Construbot sigue una arquitectura estándar Django MTV (Modelo-Plantilla-Vista) con capas adicionales para API, tareas en segundo plano y almacenamiento en caché.

source: Core Components
es: Componentes principales

source: **Web Layer:**
es: **Capa web:**

source: Nginx: Reverse proxy, SSL termination, static file serving
es: Nginx: proxy inverso, terminación SSL, servicio de archivos estáticos

source: Gunicorn: WSGI server running Django
es: Gunicorn: servidor WSGI que ejecuta Django

source: **Application Layer:**
es: **Capa de aplicación:**

source: Django 3.2.19: Web framework
es: Django 3.2.19: marco web

source: Django REST Framework: API layer
es: Marco REST de Django: capa API

source: Custom business logic in apps
es: Lógica empresarial personalizada en aplicaciones

source: **Data Layer:**
es: **Capa de datos:**

source: PostgreSQL: Primary database
es: PostgreSQL: base de datos primaria

source: Redis: Caching and message broker
es: Redis: almacenamiento en caché y intermediario de mensajes

source: S3: Media file storage (production)
es: S3: Almacenamiento de archivos multimedia (producción)

source: **Background Processing:**
es: **Procesamiento en segundo plano:**

source: Celery: Asynchronous task queue
es: Apio: cola de tareas asincrónicas

source: Redis: Message broker
es: Redis: intermediario de mensajes

source: Key Design Patterns
es: Patrones de diseño clave

source: **Multi-Tenancy:**
es: **Multi-inquilino:**

source: Three-level hierarchy (Customer → Company → User) with company-scoped data isolation.
es: Jerarquía de tres niveles (Cliente → Empresa → Usuario) con aislamiento de datos en el ámbito de la empresa.

source: **Hierarchical Data:**
es: **Datos Jerárquicos:**

source: Tree structures using django-treebeard for contracts with parent/child relationships.
es: Estructuras de árbol que utilizan django-treebeard para contratos con relaciones padre/hijo.

source: **Email Authentication:**
es: **Autenticación por correo electrónico:**

source: Custom auth backend using email instead of username.
es: Backend de autenticación personalizado mediante correo electrónico en lugar de nombre de usuario.

source: **Permission Levels:**
es: **Niveles de permiso:**

source: Six-tier permission system (Auxiliar to Superusuario) for fine-grained access control.
es: Sistema de permisos de seis niveles (Auxiliar a Superusuario) para un control de acceso detallado.

source: Technology Stack
es: Pila de tecnología

source: **Backend:**
es: **Servidor:**

source: **Key Libraries:**
es: **Bibliotecas clave:**

source: django-treebeard: Hierarchical models
es: django-treebeard: modelos jerárquicos

source: django-allauth: Authentication
es: django-allauth: autenticación

source: reportlab: PDF generation
es: reportlab: generación de PDF

source: openpyxl: Excel import/export
es: openpyxl: importación/exportación de Excel

source: SimpleJWT: API authentication
es: SimpleJWT: autenticación API

source: Application Structure
es: Estructura de la aplicación

source: **Main Apps:**
es: **Aplicaciones principales:**

source: ``users``: User management, companies, authentication
es: ``usuarios``: Gestión de usuarios, empresas, autenticación

source: ``proyectos``: Core business logic (contracts, estimates, counterparties)
es: ``proyectos``: Lógica central de negocios (contratos, estimaciones, contrapartes)

source: ``api``: REST API endpoints
es: ``api``: puntos finales de la API REST

source: ``core``: Shared utilities
es: ``core``: Utilidades compartidas

source: ``account_config``: Company configuration
es: ``account_config``: Configuración de la empresa

source: **Configuration:**
es: **Configuración:**

source: Settings split by environment (base, local, test, production) in ``construbot/config/settings/``.
es: Configuraciones divididas por entorno (base, local, prueba, producción) en ``construbot/config/settings/``.

source: See :doc:`settings-structure` for details.
es: Consulte :doc:`settings-structure` para obtener más detalles.

source: Data Flow
es: Flujo de datos

source: **Web Request:**
es: **Solicitud web:**

source: **API Request:**
es: **Solicitud de API:**

source: **Background Task:**
es: **Tarea en segundo plano:**

source: Multi-Tenancy Model
es: Modelo multiinquilino

source: **Hierarchy:**
es: **Jerarquía:**

source: **All business data** (contracts, estimates, etc.) is scoped to Company:
es: **Todos los datos comerciales** (contratos, estimaciones, etc.) están dirigidos a la Empresa:

source: See :doc:`multi-tenancy` for complete details.
es: Consulte :doc:`multi-tenancy` para obtener detalles completos.

source: Security Architecture
es: Arquitectura de seguridad

source: **Authentication:**
es: **Autenticación:**

source: Email-based login (no usernames)
es: Inicio de sesión basado en correo electrónico (sin nombres de usuario)

source: Session-based for web
es: Basado en sesiones para web

source: JWT tokens for API
es: Tokens JWT para API

source: **Authorization:**
es: **Autorización:**

source: Login required for all views
es: Es necesario iniciar sesión para todas las vistas

source: Permission level checks
es: Comprobaciones de nivel de permiso

source: Company-scoped data access
es: Acceso a datos del ámbito de la empresa

source: **Data Protection:**
es: **Protección de datos:**

source: HTTPS/SSL in production
es: HTTPS/SSL en producción

source: CSRF protection
es: protección CSRF

source: Secure cookies (HttpOnly, Secure flags)
es: Cookies seguras (HttpOnly, banderas seguras)

source: Input validation and sanitization
es: Validación y desinfección de entradas

source: See :doc:`authentication` for details.
es: Consulte :doc:`autenticación` para obtener más detalles.

source: Performance Strategy
es: Estrategia de desempeño

source: **Database:**
es: **Base de datos:**

source: Connection pooling
es: Agrupación de conexiones

source: Query optimization (select_related, prefetch_related)
es: Optimización de consultas (select_relacionada, prefetch_relacionada)

source: Atomic transactions
es: Transacciones atómicas

source: **Caching:**
es: **Almacenamiento en caché:**

source: Redis cache backend
es: back-end de caché de Redis

source: Per-view caching
es: Almacenamiento en caché por vista

source: Template fragment caching
es: Almacenamiento en caché de fragmentos de plantilla

source: Query result caching
es: Almacenamiento en caché de resultados de consultas

source: **Static Files:**
es: **Archivos estáticos:**

source: WhiteNoise for serving
es: WhiteRuido para servir

source: Gzip/Brotli compression
es: Compresión Gzip/Brotli

source: CDN for high traffic
es: CDN para mucho tráfico

source: **Background Tasks:**
es: **Tareas en segundo plano:**

source: Celery for async operations
es: Apio para operaciones asíncronas

source: Email sending
es: Envío de correo electrónico

source: PDF generation
es: generación de PDF

source: Scheduled tasks
es: Tareas programadas

source: Scalability
es: Escalabilidad

source: **Vertical Scaling:**
es: **Escala vertical:**

source: Increase server resources (CPU, RAM, storage).
es: Incrementar los recursos del servidor (CPU, RAM, almacenamiento).

source: **Horizontal Scaling:**
es: **Escala horizontal:**

source: Load balancer (ALB/Nginx)
es: Equilibrador de carga (ALB/Nginx)

source: Multiple application servers
es: Múltiples servidores de aplicaciones

source: Managed database with read replicas (RDS)
es: Base de datos administrada con réplicas de lectura (RDS)

source: External cache (ElastiCache)
es: Caché externo (ElastiCache)

source: S3 for media files
es: S3 para archivos multimedia

source: **Stateless design** enables easy horizontal scaling.
es: **El diseño sin estado** permite un fácil escalado horizontal.

source: Development vs Production
es: Desarrollo vs Producción

source: **Development:**
es: **Desarrollo:**

source: SQLite or local PostgreSQL
es: SQLite o PostgreSQL local

source: Local Redis
es: Redis locales

source: DEBUG=True
es: DEPURACIÓN = Verdadero

source: Django serves static files
es: Django sirve archivos estáticos

source: Console email backend
es: Backend de correo electrónico de consola

source: **Production:**
es: **Producción:**

source: PostgreSQL (RDS recommended)
es: PostgreSQL (se recomienda RDS)

source: Redis (ElastiCache recommended)
es: Redis (se recomienda ElastiCache)

source: DEBUG=False
es: DEPURACIÓN = Falso

source: WhiteNoise/CDN for static files
es: WhiteNoise/CDN para archivos estáticos

source: Production email service (Mailgun/SES)
es: Servicio de correo electrónico de producción (Mailgun/SES)

source: Sentry for error tracking
es: Sentry para seguimiento de errores

source: See :doc:`../installation/index` and :doc:`../deployment/index`.
es: Consulte :doc:`../installation/index` y :doc:`../deployment/index`.

source: Further Reading
es: Lectura adicional

source: **Architecture Details:**
es: **Detalles de arquitectura:**

source: **Related Documentation:**
es: **Documentación relacionada:**

source: **Comprehensive Overview:**
es: **Descripción general completa:**

source: For detailed architecture information with code examples and diagrams, see :doc:`index`.
es: Para obtener información detallada sobre la arquitectura con ejemplos de código y diagramas, consulte :doc:`index`.
