Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/permission-levels.po
Languages: es

source: Permission Levels
es: Niveles de permiso

source: Six-tier permission system (NIVELES_ACCESO) for access control.
es: Sistema de permisos de seis niveles (NIVELES_ACCESO) para control de acceso.

source: Overview
es: Descripción general

source: **Six permission levels:**
es: **Seis niveles de permiso:**

source: **Auxiliar** (1) - View only
es: **Auxiliar** (1) - Ver solo

source: **Coordinador** (2) - Create and edit
es: **Coordinador** (2) - Crear y editar

source: **Director** (3) - Full CRUD operations
es: **Director** (3) - Operaciones CRUD completas

source: **Corporativo** (4) - Cross-company access
es: **Corporativo** (4) - Acceso entre empresas

source: **Soporte** (5) - Support/maintenance
es: **Soporte** (5) - Soporte/mantenimiento

source: **Superusuario** (6) - Full system access
es: **Superusuario** (6) - Acceso completo al sistema

source: **Implementation:** Foreign key on User model pointing to NivelAcceso.
es: **Implementación:** Clave externa en modelo de Usuario apuntando a NivelAcceso.

source: NivelAcceso Model
es: Modelo NivelAcceso

source: **File:** ``construbot/users/models.py``
es: **Archivo:** ``construbot/users/models.py``

source: **Default levels:**
es: **Niveles predeterminados:**

source: User Assignment
es: Asignación de usuarios

source: **Setting level:**
es: **Nivel de configuración:**

source: Permission Checks
es: Verificaciones de permisos

source: View Decorators
es: Ver decoradores

source: Class-Based Views
es: Vistas basadas en clases

source: Template Checks
es: Verificaciones de plantilla

source: Level-Specific Capabilities
es: Capacidades específicas de nivel

source: 1. Auxiliar (View Only)
es: 1. Auxiliar (solo ver)

source: **Permissions:**
es: **Permisos:**

source: View contracts, estimates, reports
es: Ver contratos, estimaciones, informes.

source: No create/edit/delete
es: No crear/editar/eliminar

source: **Use case:** Field workers, read-only access
es: **Caso de uso:** Trabajadores de campo, acceso de solo lectura

source: 2. Coordinador (Create/Edit)
es: 2. Coordinador (Crear/Editar)

source: All Auxiliar permissions
es: Todos los permisos auxiliares

source: Create new records
es: Crear nuevos registros

source: Edit existing records
es: Editar registros existentes

source: Cannot delete
es: No se puede eliminar

source: **Use case:** Project coordinators
es: **Caso de uso:** Coordinadores de proyecto

source: 3. Director (Full CRUD)
es: 3. Director (CRUD completo)

source: All Coordinador permissions
es: Todos los permisos del Coordinador

source: Delete records
es: Eliminar registros

source: Approve estimates
es: Aprobar estimaciones

source: Generate reports
es: Generar informes

source: **Use case:** Project managers, directors
es: **Caso de uso:** Gerentes de proyecto, directores

source: 4. Corporativo (Multi-Company)
es: 4. Corporativo (Multiempresa)

source: All Director permissions
es: Todos los permisos del director

source: Access multiple companies
es: Accede a múltiples empresas

source: Cross-company reports
es: Informes entre empresas

source: Company-level configuration
es: Configuración a nivel de empresa

source: **Use case:** Corporate-level management
es: **Caso de uso:** Gestión a nivel corporativo

source: 5. Soporte (Support Access)
es: 5. Soporte (Acceso de soporte)

source: Technical support access
es: Acceso al soporte técnico

source: System diagnostics
es: Diagnóstico del sistema

source: User assistance
es: Asistencia al usuario

source: Limited configuration
es: Configuración limitada

source: **Use case:** Technical support staff
es: **Caso de uso:** Personal de soporte técnico

source: 6. Superusuario (Full Access)
es: 6. Superusuario (Acceso Completo)

source: All system access
es: Todo el acceso al sistema.

source: Django admin
es: Administrador de Django

source: User management
es: Gestión de usuarios

source: System configuration
es: Configuración del sistema

source: **Use case:** System administrators
es: **Caso de uso:** Administradores del sistema

source: Combining with Company Scope
es: Combinando con el alcance de la empresa

source: **Always combine level check with company scope:**
es: **Combine siempre la verificación de nivel con el alcance de la empresa:**

source: API Permissions
es: Permisos API

source: Best Practices
es: Mejores prácticas

source: **1. Use minimum required level:**
es: **1. Utilice el nivel mínimo requerido:**

source: **2. Check in views, not templates:**
es: **2. Verifique vistas, no plantillas:**

source: **3. Combine checks:**
es: **3. Combinar cheques:**

source: **4. Document required levels:**
es: **4. Niveles de documentación requeridos:**

source: Troubleshooting
es: Solución de problemas

source: **PermissionDenied errors:**
es: **Errores de permiso denegado:**

source: Check user's nivel_acceso level
es: Consultar nivel_acceso del usuario

source: Verify required level is correct
es: Verifique que el nivel requerido sea correcto

source: Confirm user is authenticated
es: Confirmar que el usuario está autenticado

source: **User can't access feature:**
es: **El usuario no puede acceder a la función:**

source: Check nivel_acceso assignment
es: Consultar asignación nivel_acceso

source: Verify permission decorator is applied
es: Verificar que se haya aplicado el decorador de permisos

source: Confirm level threshold is appropriate
es: Confirmar que el umbral de nivel es apropiado

source: See Also
es: Ver también
