Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/settings-structure.po
Languages: es

source: Settings Structure
es: Estructura de configuración

source: Organization of Django settings for different environments.
es: Organización de configuraciones de Django para diferentes entornos.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot uses environment-based settings with inheritance to avoid duplication and support multiple environments.
es: Construbot utiliza configuraciones basadas en el entorno con herencia para evitar la duplicación y admitir múltiples entornos.

source: **Location:** ``construbot/config/settings/``
es: **Ubicación:** ``construbot/config/settings/``

source: **Files:**
es: **Archivos:**

source: ``base.py`` - Shared settings for all environments
es: ``base.py`` - Configuración compartida para todos los entornos

source: ``local.py`` - Development settings
es: ``local.py`` - Configuración de desarrollo

source: ``test.py`` - Testing settings
es: ``test.py`` - Configuración de prueba

source: ``production.py`` - Production settings
es: ``producción.py`` - Configuración de producción

source: Settings Hierarchy
es: Jerarquía de configuración

source: All environment files import from ``base.py``:
es: Todos los archivos de entorno se importan desde ``base.py``:

source: Base Settings (base.py)
es: Configuración básica (base.py)

source: Common settings shared across all environments:
es: Configuraciones comunes compartidas en todos los entornos:

source: **Core Django:**
es: **Núcleo de Django:**

source: **Installed Apps:**
es: **Aplicaciones instaladas:**

source: ``dal`` and ``dal_select2`` MUST be listed before ``django.contrib.admin`` or autocomplete widgets won't work.
es: ``dal`` y ``dal_select2`` DEBEN aparecer antes de ``django.contrib.admin`` o los widgets de autocompletar no funcionarán.

source: **Authentication:**
es: **Autenticación:**

source: **Database (uses DATABASE_URL):**
es: **Base de datos (usa DATABASE_URL):**

source: **Static/Media Files:**
es: **Archivos estáticos/multimedia:**

source: **Password Hashers:**
es: **Hashhers de contraseña:**

source: **Celery:**
es: **Apio:**

source: Local Settings (local.py)
es: Configuración local (local.py)

source: Development environment settings:
es: Configuración del entorno de desarrollo:

source: **Debug Mode:**
es: **Modo de depuración:**

source: **Allowed Hosts:**
es: **Anfitriones permitidos:**

source: **Database:**
es: **Base de datos:**

source: Can use environment variable or defaults to local PostgreSQL:
es: Puede usar variables de entorno o valores predeterminados en PostgreSQL local:

source: **Caching (development - dummy cache):**
es: **Almacenamiento en caché (desarrollo - caché ficticio):**

source: **Email (console backend):**
es: **Correo electrónico (backend de la consola):**

source: **Debugging Tools:**
es: **Herramientas de depuración:**

source: **django-extensions:**
es: **extensiones-django:**

source: Test Settings (test.py)
es: Configuración de prueba (test.py)

source: Testing environment settings:
es: Configuración del entorno de prueba:

source: **Debug OFF:**
es: **Depuración desactivada:**

source: **Database (in-memory SQLite):**
es: **Base de datos (SQLite en memoria):**

source: **Fast Password Hashing:**
es: **Hash rápido de contraseñas:**

source: **Templates (no caching):**
es: **Plantillas (sin almacenamiento en caché):**

source: **Email (memory backend):**
es: **Correo electrónico (backend de memoria):**

source: **Celery (synchronous execution):**
es: **Apio (ejecución sincrónica):**

source: Production Settings (production.py)
es: Configuración de producción (producción.py)

source: Production environment settings:
es: Configuración del entorno de producción:

source: **Security:**
es: **Seguridad:**

source: **Caching (Redis):**
es: **Almacenamiento en caché (Redis):**

source: **Static Files (WhiteNoise):**
es: **Archivos estáticos (WhiteNoise):**

source: **Media Files (S3):**
es: **Archivos multimedia (S3):**

source: **Email (Production service):**
es: **Correo electrónico (servicio de producción):**

source: **Logging:**
es: **Explotación florestal:**

source: **Sentry:**
es: **Centinela:**

source: Environment Selection
es: Selección del entorno

source: **Via Environment Variable:**
es: **A través de variable de entorno:**

source: **Via Makefile:**
es: **A través de Makefile:**

source: **In manage.py:**
es: **En administrar.py:**

source: django-environ
es: entorno-django

source: **Loading .env file:**
es: **Cargando archivo .env:**

source: **Accessing variables:**
es: **Acceso a variables:**

source: Library Mode
es: Modo biblioteca

source: **CONSTRUBOT_AS_LIBRARY setting:**
es: **Configuración CONSTRUBOT_AS_LIBRARY:**

source: When ``True``, disables standalone features:
es: Cuando es ``True``, desactiva las funciones independientes:

source: **Affects:**
es: **Afecta:**

source: Admin interface availability
es: Disponibilidad de la interfaz de administración

source: Account management URLs
es: URL de administración de cuentas

source: Authentication system
es: Sistema de autenticación

source: See :doc:`../library-mode` for details.
es: Consulte :doc:`../library-mode` para obtener más detalles.

source: Best Practices
es: Mejores prácticas

source: **1. Never commit secrets:**
es: **1. Nunca cometas secretos:**

source: **2. Use sensible defaults:**
es: **2. Utilice valores predeterminados sensatos:**

source: **3. Document required variables:**
es: **3. Variables requeridas del documento:**

source: Create ``.env.example`` with all required variables.
es: Cree ``.env.example`` con todas las variables requeridas.

source: **4. Validate production settings:**
es: **4. Validar configuración de producción:**

source: **5. Keep base.py DRY:**
es: **5. Mantenga base.py SECO:**

source: Put common settings in ``base.py``, override only what differs.
es: Coloque configuraciones comunes en ``base.py``, anule solo lo que difiera.

source: Troubleshooting
es: Solución de problemas

source: **Wrong settings module loaded:**
es: **Módulo de configuración incorrecto cargado:**

source: **Settings not loading from .env:**
es: **La configuración no se carga desde .env:**

source: **Import errors:**
es: **Errores de importación:**

source: See Also
es: Ver también

source: `Django Settings Documentation <https://docs.djangoproject.com/en/3.2/topics/settings/>`_
es: `Documentación de configuración de Django <https://docs.djangoproject.com/en/3.2/topics/settings/>`_
