Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/architecture/url-structure.po
Languages: es

source: URL Structure
es: Estructura de URL

source: URL routing and organization in Construbot.
es: Enrutamiento y organización de URL en Construbot.

source: Root URLs
es: URL raíz

source: **File:** ``construbot/config/urls.py``
es: **Archivo:** ``construbot/config/urls.py``

source: **Library mode:**
es: **Modo biblioteca:**

source: URL Patterns by App
es: Patrones de URL por aplicación

source: Users App
es: Aplicación de usuarios

source: **``/users/``** - User management
es: **``/users/``** - Gestión de usuarios

source: ``/users/~redirect/`` - Redirect to user detail
es: ``/users/~redirect/`` - Redirigir a los detalles del usuario

source: ``/users/~update/`` - Update user profile
es: ``/users/~update/`` - Actualizar perfil de usuario

source: ``/users/<username>/`` - User detail
es: ``/users/<nombre de usuario>/`` - Detalle del usuario

source: Proyectos App
es: Aplicación Proyectos

source: **``/proyectos/``** - Main business logic
es: **``/proyectos/``** - Lógica de negocio principal

source: ``/proyectos/contratos/`` - Contract list
es: ``/proyectos/contratos/`` - Listado de contratos

source: ``/proyectos/contratos/create/`` - Create contract
es: ``/proyectos/contratos/create/`` - Crear contrato

source: ``/proyectos/contratos/<id>/`` - Contract detail
es: ``/proyectos/contratos/<id>/`` - Detalle del contrato

source: ``/proyectos/contratos/<id>/edit/`` - Edit contract
es: ``/proyectos/contratos/<id>/edit/`` - Editar contrato

source: ``/proyectos/contratos/<id>/delete/`` - Delete contract
es: ``/proyectos/contratos/<id>/delete/`` - Eliminar contrato

source: ``/proyectos/estimaciones/`` - Estimate list
es: ``/proyectos/estimaciones/`` - Listado de estimaciones

source: ``/proyectos/contrapartes/`` - Counterparty list
es: ``/proyectos/contrapartes/`` - Lista de contrapartes

source: API URLs
es: URL de API

source: **``/api/v1/``** - REST API
es: **``/api/v1/``** - API REST

source: ``/api/v1/api-token-auth/`` - Obtain JWT token
es: ``/api/v1/api-token-auth/`` - Obtener el token JWT

source: ``/api/v1/api-token-refresh/`` - Refresh JWT token
es: ``/api/v1/api-token-refresh/`` - Actualizar token JWT

source: ``/api/v1/contracts/`` - Contract endpoints
es: ``/api/v1/contracts/`` - Puntos finales del contrato

source: ``/api/v1/estimates/`` - Estimate endpoints
es: ``/api/v1/estimates/`` - Estimación de puntos finales

source: URL Namespaces
es: Espacios de nombres de URL

source: **Using namespaces:**
es: **Usando espacios de nombres:**

source: Admin URLs
es: URL de administrador

source: **``/admin/``** - Django admin (if not library mode)
es: **``/admin/``** - Administrador de Django (si no está en modo biblioteca)

source: Autocomplete URLs
es: URL de autocompletar

source: **django-autocomplete-light:**
es: **django-autocompletar-luz:**

source: Static/Media URLs
es: URL estáticas/medios

source: **Development only:**
es: **Solo desarrollo:**

source: **Production:** Served by WhiteNoise (static) and Nginx/S3 (media)
es: **Producción:** Servido por WhiteNoise (estático) y Nginx/S3 (medios)

source: See Also
es: Ver también
