Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/contributor/documentation/index.po
Languages: es

source: Documentation
es: Documentación

source: Guide for contributing to Construbot documentation.
es: Guía para contribuir a la documentación de Construbot.

source: Overview
es: Descripción general

source: Construbot documentation uses Sphinx with reStructuredText (RST) and supports bilingual builds (English/Spanish).
es: La documentación de Construbot utiliza Sphinx con reStructuredText (RST) y admite compilaciones bilingües (inglés/español).

source: **Location:** ``/docs/``
es: **Ubicación:** ``/docs/``

source: Building Documentation
es: Documentación de construcción

source: **Build English docs:**
es: **Crear documentos en inglés:**

source: **Build Spanish docs:**
es: **Crear documentos en español:**

source: **Auto-rebuild (live preview):**
es: **Reconstrucción automática (vista previa en vivo):**

source: Writing Documentation
es: Redacción de documentación

source: **RST Syntax:**
es: **Sintaxis RST:**

source: **Links:**
es: **Campo de golf:**

source: **Cross-references:**
es: **Referencias cruzadas:**

source: Documentation Structure
es: Estructura de la documentación

source: **Follow existing structure** when adding new pages.
es: **Siga la estructura existente** al agregar nuevas páginas.

source: Style Guide
es: Guía de estilo

source: **1. Clear and concise**
es: **1. Claro y conciso**

source: **2. Code examples**
es: **2. Ejemplos de código**

source: Include working code examples.
es: Incluya ejemplos de código de trabajo.

source: **3. Spanish terms**
es: **3. Términos en español**

source: Use pattern: "Contracts (Spanish: Contratos)"
es: Patrón de uso: "Contracts (Español: Contratos)"

source: **4. Cross-references**
es: **4. Referencias cruzadas**

source: Link to related pages.
es: Enlace a páginas relacionadas.

source: **5. Consistent formatting**
es: **5. Formato consistente**

source: Follow existing page structure.
es: Siga la estructura de página existente.

source: Translation Workflow
es: Flujo de trabajo de traducción

source: **Extract strings:**
es: **Extraer cadenas:**

source: **Update translations:**
es: **Actualizar traducciones:**

source: **Edit .po files:**
es: **Editar archivos .po:**

source: **Build Spanish version:**
es: **Construir versión en español:**

source: See Also
es: Ver también
