Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/_glossary/domain-terms.po
Languages: es

source: Domain Terms Glossary
es: Glosario de términos de dominio

source: This glossary maps Spanish construction industry terms used in Construbot to their English equivalents. Use this for consistency in all documentation, translations, and communication.
es: Este glosario relaciona los términos de la industria de la construcción en español utilizados en Construbot con sus equivalentes en inglés. Úselo para mantener la coherencia en toda la documentación, traducciones y comunicaciones.

source: **Important**: The codebase uses Spanish model and field names. This glossary provides English equivalents for documentation purposes only. Do not change the actual Python code to use these English names.
es: **Importante**: El código base utiliza nombres de campo y modelo en español. Este glosario proporciona equivalentes en inglés únicamente con fines documentales. No cambie el código Python real para usar estos nombres en inglés.

source: Core Entities
es: Entidades principales

source: **English:** Client / Customer
es: **Español:** Cliente / Cliente

source: **Description:** A customer who contracts construction work from your company. This is a Contraparte with tipo='CLIENTE'.
es: **Descripción:** Un cliente que contrata trabajos de construcción de su empresa. Esta es una Contraparte con tipo='CLIENTE'.

source: **Model:** ``construbot.proyectos.models.Contraparte`` (tipo='CLIENTE')
es: **Modelo:** ``construbot.proyectos.models.Contraparte`` (tipo='CLIENTE')

source: **Usage:** The party paying for the construction work
es: **Uso:** La parte que paga el trabajo de construcción.

source: **Examples:** "Government Agency", "Private Developer"
es: **Ejemplos:** "Agencia gubernamental", "Desarrollador privado"

source: **English:** Counterparty / Business Partner
es: **Inglés:** Contraparte / Socio comercial

source: **Description:** An external business entity with which your company has a relationship. Can be one of three types: Cliente (Client), Destajista (Piecework Contractor), or Subcontratista (Subcontractor).
es: **Descripción:** Una entidad comercial externa con la que su empresa tiene una relación. Puede ser de tres tipos: Cliente, Destajista (Contratista a destajo), o Subcontratista (Subcontratista).

source: **Model:** ``construbot.proyectos.models.Contraparte``
es: **Modelo:** ``construbot.proyectos.models.Contraparte``

source: **Types:** CLIENTE, DESTAJISTA, SUBCONTRATISTA
es: **Tipos:** CLIENTE, DESTAJISTA, SUBCONTRATISTA

source: **Examples:** "ABC Construction Inc. (Client)", "XYZ Electrical (Subcontractor)"
es: **Ejemplos:** "ABC Construction Inc. (Cliente)", "XYZ Electrical (Subcontratista)"

source: **English:** Contract / Project
es: **Inglés:** Contrato / Proyecto

source: **Description:** A construction project or contract. Represents the main entity in Construbot for managing construction work. Can be hierarchical (parent contracts with sub-contracts) using django-treebeard.
es: **Descripción:** Un proyecto o contrato de construcción. Representa la entidad principal en Construbot para la gestión de obras de construcción. Puede ser jerárquico (contratos principales con subcontratos) usando django-treebeard.

source: **Model:** ``construbot.proyectos.models.Contrato``
es: **Modelo:** ``construbot.proyectos.models.Contrato``

source: **Key Fields:** folio (reference number), contrato_name (contract name), monto (amount), anticipo (advance payment)
es: **Campos clave:** folio (número de referencia), contrato_name (nombre del contrato), monto (monto), anticipo (pago por adelantado)

source: **Examples:** "Main Building Contract", "Electrical Subcontract"
es: **Ejemplos:** "Contrato de construcción principal", "Subcontrato eléctrico"

source: **English:** Piecework Contractor / Task Contractor
es: **Inglés:** Contratista a destajo / Contratista de tarea

source: **Description:** A contractor paid by completed work units (piece rate) rather than by time. This is a Contraparte with tipo='DESTAJISTA'. Common in Mexican construction industry.
es: **Descripción:** Un contratista pagado por unidades de trabajo completadas (a destajo) en lugar de por tiempo. Esta es una Contraparte con tipo='DESTAJISTA'. Común en la industria de la construcción mexicana.

source: **Model:** ``construbot.proyectos.models.Contraparte`` (tipo='DESTAJISTA')
es: **Modelo:** ``construbot.proyectos.models.Contraparte`` (tipo='DESTAJISTA')

source: **Usage:** Workers paid per completed task or quantity
es: **Uso:** Trabajadores pagados por tarea o cantidad completada

source: **Examples:** "Masonry crew paid per square meter", "Painting contractor paid per room"
es: **Ejemplos:** "Equipo de albañilería pagado por metro cuadrado", "Contratista de pintura pagado por habitación"

source: Destinatario
es: Destinotario

source: **English:** Recipient / Contact / Contact Person
es: **Inglés:** Destinatario / Contacto / Persona de contacto

source: **Description:** A contact person at a Counterparty organization. Used for document distribution and communication.
es: **Descripción:** Una persona de contacto en una organización de Contraparte. Se utiliza para la distribución y comunicación de documentos.

source: **Model:** ``construbot.proyectos.models.Destinatario``
es: **Modelo:** ``construbot.proyectos.models.Destinatario``

source: **Key Fields:** destinatario_text (contact name), puesto (position), contraparte (associated counterparty)
es: **Campos clave:** destinatario_text (nombre de contacto), puesto (cargo), contraparte (contraparte asociada)

source: **Examples:** "John Doe, Project Manager", "Jane Smith, Procurement Officer"
es: **Ejemplos:** "John Doe, director de proyecto", "Jane Smith, responsable de adquisiciones"

source: **English:** Site / Construction Site / Location
es: **Inglés:** Sitio / Sitio de Construcción / Ubicación

source: **Description:** Physical location where construction work occurs. Must be associated with a Cliente (Client) contraparte.
es: **Descripción:** Ubicación física donde se realizan los trabajos de construcción. Debe estar asociado a una Contraparte Cliente (Cliente).

source: **Model:** ``construbot.proyectos.models.Sitio``
es: **Modelo:** ``construbot.proyectos.models.Sitio``

source: **Key Fields:** sitio_name (site name), sitio_location (address), cliente (associated client)
es: **Campos clave:** sitio_name (nombre del sitio), sitio_location (dirección), cliente (cliente asociado)

source: **Examples:** "Downtown Office Building", "Highway 101 Bridge Project"
es: **Ejemplos:** "Edificio de oficinas en el centro", "Proyecto del puente de la autopista 101"

source: **English:** Subcontractor
es: **Inglés:** Subcontratista

source: **Description:** A contractor for specialized work under a main contract. This is a Contraparte with tipo='SUBCONTRATISTA'.
es: **Descripción:** Un contratista para trabajos especializados bajo un contrato principal. Esta es una Contraparte con tipo='SUBCONTRATISTA'.

source: **Model:** ``construbot.proyectos.models.Contraparte`` (tipo='SUBCONTRATISTA')
es: **Modelo:** ``construbot.proyectos.models.Contraparte`` (tipo='SUBCONTRATISTA')

source: **Usage:** Specialized contractors (electrical, plumbing, HVAC, etc.)
es: **Uso:** Contratistas especializados (electricidad, plomería, HVAC, etc.)

source: **Examples:** "HVAC Subcontractor", "Structural Steel Subcontractor"
es: **Ejemplos:** "Subcontratista de HVAC", "Subcontratista de acero estructural"

source: Financial Terms
es: Términos financieros

source: **English:** Amortization / Advance Amortization
es: **Español:** Amortización / Amortización Anticipada

source: **Description:** The process of deducting advance payment amounts from subsequent progress payments.
es: **Descripción:** El proceso de deducir los montos de los pagos por adelantado de los pagos progresivos posteriores.

source: **Method:** ``Contrato.amortizacion_anticipo()``
es: **Método:** ``Contrato.amortizacion_anticipo()``

source: **Usage:** Calculated automatically in estimates to recover advance payments
es: **Uso:** Calculado automáticamente en estimaciones para recuperar pagos anticipados

source: **English:** Advance Payment / Down Payment / Mobilization Payment
es: **Español:** Pago Anticipado / Pago Inicial / Pago de Movilización

source: **Description:** Initial payment percentage for a contract, typically used for mobilization and initial expenses.
es: **Descripción:** Porcentaje de pago inicial de un contrato, normalmente utilizado para movilización y gastos iniciales.

source: **Model Field:** ``construbot.proyectos.models.Contrato.anticipo`` (DecimalField)
es: **Campo Modelo:** ``construbot.proyectos.models.Contrato.anticipo`` (Campo Decimal)

source: **Range:** 0% to 100%
es: **Rango:** 0% a 100%

source: **Examples:** "10% advance payment", "15% mobilization payment"
es: **Ejemplos:** "Pago anticipado del 10%", "Pago de movilización del 15%"

source: **English:** Concept / Line Item / Work Item / Work Package
es: **Inglés:** Concepto / Línea de pedido / Elemento de trabajo / Paquete de trabajo

source: **Description:** Individual work item in a contract catalog. Defines a specific type of work with quantity, unit of measurement, and unit price.
es: **Descripción:** Elemento de trabajo individual en un catálogo de contrato. Define un tipo específico de trabajo con cantidad, unidad de medida y precio unitario.

source: **Model:** ``construbot.proyectos.models.Concept``
es: **Modelo:** ``construbot.proyectos.modelos.Concept``

source: **Key Fields:** code (item code), concept_text (description), unit (measurement unit), unit_price, total_cuantity
es: **Campos clave:** código (código de artículo), texto_concepto (descripción), unidad (unidad de medida), precio_unitario, cantidad_total

source: **Examples:** "Concrete Pouring - Foundation", "Electrical Wiring Installation"
es: **Ejemplos:** "Vaciado de hormigón - Cimentación", "Instalación de cableado eléctrico"

source: **English:** Executed / Spent / Expended
es: **Español:** Ejecutado / Gastado / Gastado

source: **Description:** Amount of work completed or money spent to date.
es: **Descripción:** Cantidad de trabajo completado o dinero gastado hasta la fecha.

source: **Method:** ``Contrato.ejercido_acumulado()``
es: **Método:** ``Contrato.ejercido_acumulado()``

source: **Examples:** "Accumulated executed amount", "Total spent to date"
es: **Ejemplos:** "Monto ejecutado acumulado", "Total gastado hasta la fecha"

source: **English:** Estimate / Progress Payment / Progress Billing
es: **Español:** Estimación / Pago progresivo / Facturación progresiva

source: **Description:** Periodic billing for completed work on a contract. Documents work progress and calculates payment due.
es: **Descripción:** Facturación periódica por el trabajo completado en un contrato. Documenta el progreso del trabajo y calcula el pago adeudado.

source: **Model:** ``construbot.proyectos.models.Estimate``
es: **Modelo:** ``construbot.proyectos.modelos.Estimate``

source: **Key Fields:** consecutive (estimate number), start_date, finish_date, project (associated contract)
es: **Campos clave:** consecutivo (número estimado), fecha de inicio, fecha de finalización, proyecto (contrato asociado)

source: **Examples:** "Estimate #5 for March 2024", "Monthly Progress Payment"
es: **Ejemplos:** "Estimación n.º 5 para marzo de 2024", "Pago de progreso mensual"

source: **English:** Invoiced / Billed
es: **Inglés:** Facturado / Facturado

source: **Description:** Indicates whether an estimate has been invoiced to the client.
es: **Descripción:** Indica si se ha facturado un presupuesto al cliente.

source: **Model Field:** ``Estimate.invoiced`` (BooleanField)
es: **Campo de modelo:** ``Estimación.facturada`` (campo booleano)

source: Monto
es: monte

source: **English:** Amount / Total Amount / Contract Amount
es: **Inglés:** Monto / Monto Total / Monto del Contrato

source: **Description:** Total monetary value of a contract or payment. Usually specified without VAT/IVA.
es: **Descripción:** Valor monetario total de un contrato o pago. Generalmente especificado sin IVA/IVA.

source: **Model Fields:** ``Contrato.monto``, ``Retenciones.valor``
es: **Campos Modelo:** ``Contrato.monto``, ``Retenciones.valor``

source: **Examples:** "$1,000,000 contract amount", "$50,000 retention amount"
es: **Ejemplos:** "Monto del contrato de $1,000,000", "Monto de retención de $50,000"

source: **English:** Paid / Payment Completed
es: **Inglés:** Pagado / Pago completado

source: **Description:** Indicates whether an estimate payment has been received.
es: **Descripción:** Indica si se ha recibido un pago estimado.

source: **Model Fields:** ``Estimate.paid`` (BooleanField), ``Estimate.payment_date`` (DateField)
es: **Campos del modelo:** ``Estimate.paid`` (BooleanField), ``Estimate.paid_date`` (DateField)

source: **English:** Retention / Withholding / Holdback
es: **Español:** Retención / Retención / Retención

source: **Description:** Amount or percentage withheld from payments, typically released upon project completion. Can be a fixed amount (AMOUNT) or percentage (PERCENTAGE).
es: **Descripción:** Monto o porcentaje retenido de los pagos, generalmente liberado al finalizar el proyecto. Puede ser una cantidad fija (CANTIDAD) o un porcentaje (PERCENTAJE).

source: **Model:** ``construbot.proyectos.models.Retenciones``
es: **Modelo:** ``construbot.proyectos.models.Retenciones``

source: **Types:** AMOUNT (Monto), PERCENTAGE (Porcentaje)
es: **Tipos:** CANTIDAD (Monto), PORCENTAJE (Porcentaje)

source: **Examples:** "5% Quality Retention", "$10,000 Performance Holdback"
es: **Ejemplos:** "Retención de calidad del 5 %", "Retención de rendimiento de $10 000"

source: Field Names
es: Nombres de campo

source: code
es: código

source: **English:** Code / Item Code / Contract Code
es: **Inglés:** Código / Código de artículo / Código de contrato

source: **Description:** Alphanumeric code for identification.
es: **Descripción:** Código alfanumérico para identificación.

source: **Model Fields:** ``Contrato.code``, ``Concept.code``
es: **Campos del modelo:** ``Contrato.code``, ``Concept.code``

source: **Examples:** "CONT-2024-001", "ELEC-100"
es: **Ejemplos:** "CONT-2024-001", "ELEC-100"

source: **English:** Date / Contract Date
es: **Inglés:** Fecha / Fecha del contrato

source: **Description:** Date of contract signing or creation.
es: **Descripción:** Fecha de firma o creación del contrato.

source: **Model Field:** ``Contrato.fecha`` (DateField)
es: **Campo Modelo:** ``Contrato.fecha`` (DateField)

source: folio
es: fol

source: **English:** Reference Number / Folio / Sequential ID
es: **Inglés:** Número de Referencia / Folio / ID Secuencial

source: **Description:** Sequential identification number for contracts within a company.
es: **Descripción:** Número de identificación secuencial para contratos dentro de una empresa.

source: **Model Field:** ``Contrato.folio`` (IntegerField)
es: **Campo Modelo:** ``Contrato.folio`` (IntegerField)

source: **English:** Name
es: **Inglés:** Nombre

source: **Description:** Generic name field used across multiple models.
es: **Descripción:** Campo de nombre genérico utilizado en varios modelos.

source: **Model Fields:** ``Vertices.nombre``, ``Retenciones.nombre``
es: **Campos del modelo:** ``Vertices.nombre``, ``Retenciones.nombre``

source: **English:** Position / Job Title / Role
es: **Inglés:** Puesto / Título profesional / Función

source: **Description:** Job title or position of a person.
es: **Descripción:** Título laboral o puesto de una persona.

source: **Model Fields:** ``Destinatario.puesto``, ``User.puesto``
es: **Campos del modelo:** ``Destinatario.puesto``, ``Usuario.puesto``

source: **Examples:** "Project Manager", "Site Supervisor", "Procurement Officer"
es: **Ejemplos:** "Gerente de proyecto", "Supervisor de sitio", "Oficial de adquisiciones"

source: **English:** Type / Category
es: **Inglés:** Tipo / Categoría

source: **Description:** Classification or type field with choices.
es: **Descripción:** Campo de clasificación o tipo con opciones.

source: **Model Fields:** ``Contraparte.tipo``, ``Retenciones.tipo``
es: **Campos Modelo:** ``Contraparte.tipo``, ``Retenciones.tipo``

source: **English:** Value / Amount
es: **Inglés:** Valor / Importe

source: **Description:** Monetary or numeric value.
es: **Descripción:** Valor monetario o numérico.

source: **Model Field:** ``Retenciones.valor`` (DecimalField)
es: **Campo Modelo:** ``Retenciones.valor`` (DecimalField)

source: Measurement & Quantity Terms
es: Términos de medición y cantidad

source: **English:** Height / Tall / High
es: **Inglés:** Altura / Alto / Alto

source: **Description:** Height dimension in meters.
es: **Descripción:** Dimensión de altura en metros.

source: **Model Field:** ``Vertices.alto`` (DecimalField)
es: **Campo de modelo:** ``Vertices.alto`` (Campo Decimal)

source: **English:** Width / Wide
es: **Inglés:** Ancho / Ancho

source: **Description:** Width dimension in meters.
es: **Descripción:** Dimensión de ancho en metros.

source: **Model Field:** ``Vertices.ancho`` (DecimalField)
es: **Campo de modelo:** ``Vertices.ancho`` (Campo Decimal)

source: **English:** Quantity / Amount
es: **Inglés:** Cantidad / Monto

source: **Description:** Numeric quantity of work or materials.
es: **Descripción:** Cantidad numérica de obra o materiales.

source: **Model Fields:** ``Concept.total_cuantity``, ``EstimateConcept.cuantity_estimated``
es: **Campos del modelo:** ``Concept.total_cuantity``, ``EstimateConcept.cuantity_estimated``

source: **English:** Length / Long
es: **Inglés:** Largo / Largo

source: **Description:** Length dimension in meters.
es: **Descripción:** Dimensión de longitud en metros.

source: **Model Field:** ``Vertices.largo`` (DecimalField)
es: **Campo de modelo:** ``Vertices.largo`` (Campo Decimal)

source: **English:** Pieces / Number of Pieces / Count
es: **Inglés:** Piezas / Número de Piezas / Conteo

source: **Description:** Count or number of identical items.
es: **Descripción:** Recuento o número de artículos idénticos.

source: **Model Field:** ``Vertices.piezas`` (IntegerField)
es: **Campo Modelo:** ``Vertices.piezas`` (IntegerField)

source: **English:** Unit / Unit of Measurement / Measurement Unit
es: **Inglés:** Unidad / Unidad de Medida / Unidad de Medida

source: **Description:** Unit for measuring work quantities (square meters, kilograms, pieces, etc.)
es: **Descripción:** Unidad para medir cantidades de trabajo (metros cuadrados, kilogramos, piezas, etc.)

source: **Model:** ``construbot.proyectos.models.Units``
es: **Modelo:** ``construbot.proyectos.modelos.Unidades``

source: **Examples:** "m²" (square meters), "kg" (kilograms), "pza" (pieces), "m³" (cubic meters)
es: **Ejemplos:** "m²" (metros cuadrados), "kg" (kilogramos), "pza" (piezas), "m³" (metros cúbicos)

source: **English:** Vertex / Measurement Point / Survey Point
es: **Español:** Vértice / Punto de medición / Punto de levantamiento

source: **Description:** A point used for calculating quantities with dimensions (length, width, height).
es: **Descripción:** Un punto utilizado para calcular cantidades con dimensiones (largo, ancho, alto).

source: **Model:** ``construbot.proyectos.models.Vertices``
es: **Modelo:** ``construbot.proyectos.modelos.Vertices``

source: **Key Fields:** nombre (name), largo (length), ancho (width), alto (height), piezas (pieces)
es: **Campos clave:** nombre (nombre), largo (largo), ancho (ancho), alto (alto), piezas (piezas)

source: Organizational Terms
es: Términos organizacionales

source: **English:** Customer / Account / Tenant
es: **Inglés:** Cliente / Cuenta / Inquilino

source: **Description:** Top-level organization account in the multi-tenant system. Not to be confused with Cliente (Client) in Contraparte.
es: **Descripción:** Cuenta de organización de nivel superior en el sistema multiinquilino. No confundir con Cliente en Contraparte.

source: **Model:** ``construbot.users.models.Customer``
es: **Modelo:** ``construbot.users.models.Customer``

source: **Hierarchy:** Customer → Company → User
es: **Jerarquía:** Cliente → Empresa → Usuario

source: **English:** Company / Business Entity
es: **Inglés:** Empresa/Entidad Comercial

source: **Description:** Business entity within a Customer account in the multi-tenant system.
es: **Descripción:** Entidad comercial dentro de una cuenta de Cliente en el sistema multiinquilino.

source: **Model:** ``construbot.users.models.Company``
es: **Modelo:** ``construbot.users.models.Company``

source: **English:** Access Level / Permission Level
es: **Inglés:** Nivel de acceso / Nivel de permiso

source: **Description:** User permission level (1-6).
es: **Descripción:** Nivel de permiso de usuario (1-6).

source: **Model:** ``construbot.users.models.NivelAcceso``
es: **Modelo:** ``construbot.usuarios.modelos.NivelAcceso``

source: **Levels:**
es: **Niveles:**

source: 1: Auxiliar (Assistant)
es: 1: Auxiliar (Asistente)

source: 2: Coordinador (Coordinator)
es: 2: Coordinador (Coordinador)

source: 4: Corporativo (Corporate)
es: 4: Corporativo (Corporativo)

source: 5: Soporte (Support)
es: 5: Soporte (Soporte)

source: 6: Superusuario (Superuser)
es: 6: Superusuario (Superusuario)

source: **English:** User
es: **Inglés:** Usuario

source: **Description:** System user with permissions and company assignments.
es: **Descripción:** Usuario del sistema con permisos y asignaciones de la empresa.

source: **Model:** ``construbot.users.models.User``
es: **Modelo:** ``construbot.users.models.User``

source: **Key Fields:** email (authentication), company (assigned companies), permiso (permission level)
es: **Campos clave:** correo electrónico (autenticación), empresa (empresas asignadas), permiso (nivel de permiso)

source: Action Terms
es: Términos de acción

source: **English:** Assign / Allocate
es: **Español:** Asignar / Asignar

source: **Description:** Action of assigning users or resources to a contract.
es: **Descripción:** Acción de asignar usuarios o recursos a un contrato.

source: **Model Field:** ``Contrato.users`` (ManyToManyField)
es: **Campo Modelo:** ``Contrato.users`` (ManyToManyField)

source: **English:** Authorized By / Approved By
es: **Inglés:** Autorizado por / Aprobado por

source: **Description:** Person who authorized or approved a document.
es: **Descripción:** Persona que autorizó o aprobó un documento.

source: **Model Fields:** ``Estimate.auth_by``, ``Estimate.auth_by_gen``
es: **Campos del modelo:** ``Estimate.auth_by``, ``Estimate.auth_by_gen``

source: **English:** Drafted By / Prepared By / Created By
es: **Inglés:** Redactado por / Preparado por / Creado por

source: **Description:** User who created or drafted a document.
es: **Descripción:** Usuario que creó o redactó un documento.

source: **Model Field:** ``Estimate.draft_by`` (ForeignKey to User)
es: **Campo de modelo:** ``Estimate.draft_by`` (Clave externa para el usuario)

source: **English:** Supervised By / Overseen By
es: **Inglés:** Supervisado por / Supervisado por

source: **Description:** User who supervised or managed the work.
es: **Descripción:** Usuario que supervisó o gestionó el trabajo.

source: **Model Field:** ``Estimate.supervised_by`` (ForeignKey to User)
es: **Campo de modelo:** ``Estimate.supervised_by`` (Clave externa al usuario)

source: Documentation & UI Terms
es: Términos de documentación y interfaz de usuario

source: **English:** Catalog / Price Book / Work Item List
es: **Inglés:** Catálogo / Libro de precios / Lista de elementos de trabajo

source: **Description:** List or catalog of work items (concepts) for a contract.
es: **Descripción:** Listado o catálogo de elementos de trabajo (conceptos) para un contrato.

source: **Usage:** "Concept Catalog", "Price Catalog"
es: **Uso:** "Catálogo de Conceptos", "Catálogo de Precios"
