Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/_glossary/domain-terms.po
Languages: es

source: **English:** Consecutive / Sequential Number / Estimate Number
es: **Inglés:** Número consecutivo/secuencial/Número estimado

source: **Description:** Sequential numbering for estimates within a project.
es: **Descripción:** Numeración secuencial para estimaciones dentro de un proyecto.

source: **Model Field:** ``Estimate.consecutive`` (IntegerField)
es: **Campo de modelo:** ``Estimación.consecutiva`` (IntegerField)

source: **English:** Generator / Estimate Generator
es: **Inglés:** Generador / Generador de Estimaciones

source: **Description:** The estimate generation document or system.
es: **Descripción:** El documento o sistema de generación de presupuesto.

source: **Usage:** Authorization field for estimates (auth_by_gen)
es: **Uso:** Campo de autorización para estimaciones (auth_by_gen)

source: **English:** Observations / Notes / Comments
es: **Español:** Observaciones / Notas / Comentarios

source: **Description:** Free-text notes or comments on items.
es: **Descripción:** Notas de texto libre o comentarios sobre elementos.

source: **Model Field:** ``EstimateConcept.observations`` (TextField)
es: **Campo de modelo:** ``EstimateConcept.observations`` (TextField)

source: **English:** Location / Address / Site Location
es: **Inglés:** Ubicación / Dirección / Ubicación del sitio

source: **Description:** Physical address or location description.
es: **Descripción:** Dirección física o descripción de la ubicación.

source: **Model Field:** ``Sitio.sitio_location`` (CharField)
es: **Campo de modelo:** ``Sitio.sitio_location`` (CharField)

source: Status & State Terms
es: Estado y términos estatales

source: **English:** Completed / Finished / Done
es: **Inglés:** Completado / Terminado / Hecho

source: **Description:** Work or action that has been completed.
es: **Descripción:** Trabajo o acción que se ha completado.

source: **English:** Pending / Outstanding / Awaiting
es: **Inglés:** Pendiente / Sobresaliente / En espera

source: **Description:** Items awaiting action (payment, invoicing, etc.)
es: **Descripción:** Elementos pendientes de acción (pago, facturación, etc.)

source: **Functions:** ``estimacionespendientes_facturacion()``, ``estimacionespendientes_pago()``
es: **Funciones:** ``estimacionespendientes_facturacion()``, ``estimacionespendientes_pago()``

source: **English:** Active / Current / Ongoing
es: **Inglés:** Activo / Actual / En curso

source: **Description:** Indicates an active or ongoing contract.
es: **Descripción:** Indica un contrato activo o en curso.

source: **Model Field:** ``Contrato.status`` (BooleanField)
es: **Campo Modelo:** ``Contrato.status`` (BooleanField)

source: **Function:** ``contratosvigentes()`` - Returns active contracts
es: **Función:** ``contratosvigentes()`` - Devuelve contratos activos

source: Translation Guidelines
es: Directrices de traducción

source: Model Names in Code
es: Nombres de modelos en código

source: **Keep Spanish names in Python code**, use English in documentation:
es: **Mantenga los nombres en español en código Python**, use inglés en la documentación:

source: Python: ``class Contrato(MP_Node):``
es: Python: ``clase Contrato(MP_Node):``

source: Documentation: "The Contract model represents..."
es: Documentación: "El modelo de Contrato representa..."

source: **First Use Pattern**: On first use in any document, include Spanish term:
es: **Patrón de primer uso**: En el primer uso en cualquier documento, incluya el término en español:

source: "The Contract (Contrato) model represents construction projects..."
es: "El modelo Contract representa proyectos de construcción..."

source: Field Names in Documentation
es: Nombres de campos en la documentación

source: **Reference both names** when documenting fields:
es: **Haga referencia a ambos nombres** al documentar los campos:

source: "The ``folio`` (reference number) field stores the sequential contract ID..."
es: "El campo ``folio`` (número de referencia) almacena el ID secuencial del contrato..."

source: API Response Documentation
es: Documentación de respuesta API

source: **Document JSON keys** with both languages:
es: **Claves JSON del documento** con ambos idiomas:

source: Choice Field Values
es: Valores de campo de elección

source: **Document all options** in tables:
es: **Documente todas las opciones** en tablas:

source: Spanish Code
es: Código español

source: English Translation
es: Traducción al inglés

source: Description
es: Descripción

source: Client
es: Cliente

source: Customer paying for work
es: Cliente pagando por el trabajo

source: Piecework Contractor
es: Contratista a destajo

source: Worker paid by task
es: Trabajador pagado por tarea

source: Subcontractor
es: Subcontratista

source: Specialized contractor
es: Contratista especializado

source: Consistency Rules
es: Reglas de coherencia

source: **Always use the same English term** for a Spanish term across all documentation
es: **Utilice siempre el mismo término en inglés** para un término en español en toda la documentación

source: **Provide context** when terms could be ambiguous
es: **Proporcione contexto** cuando los términos puedan ser ambiguos

source: **Link to models** for technical reference
es: **Enlace a modelos** para referencia técnica

source: **Use industry-standard English** construction terminology where applicable
es: **Utilice terminología de construcción en inglés estándar de la industria** cuando corresponda.

source: **Update this glossary** when adding new Spanish terms to the codebase
es: **Actualice este glosario** al agregar nuevos términos en español al código base

source: Usage in Different Contexts
es: Uso en diferentes contextos

source: End User Documentation
es: Documentación del usuario final

source: Use **plain English with Spanish reference on first use**:
es: Utilice **inglés sencillo con referencia en español en el primer uso**:

source: "To create a new Project (Contrato), navigate to the Projects menu..."
es: "Para crear un nuevo Proyecto (Contrato), navegue hasta el menú Proyectos..."

source: Developer Documentation
es: Documentación del desarrollador

source: Use **both names with model references**:
es: Utilice **ambos nombres con referencias de modelo**:

source: "The ``Contrato`` (Contract) model inherits from ``MP_Node`` for hierarchical structure. The ``monto`` (amount) field stores the contract value..."
es: "El modelo ``Contrato`` hereda de ``MP_Node`` para la estructura jerárquica. El campo ``monto`` almacena el valor del contrato..."

source: API Documentation
es: Documentación API

source: Use **English descriptions with Spanish field names**:
es: Utilice **descripciones en inglés con nombres de campos en español**:

source: **folio** (integer): Reference number / Sequential ID for the contract
es: **folio** (entero): Número de referencia / ID secuencial del contrato

source: See Also
es: Ver también

source: **Last Updated:** December 2025
es: **Última actualización:** diciembre de 2025

source: **Note:** This glossary is a living document. When adding new Spanish terms to the codebase, update this glossary with the appropriate English translation and context.
es: **Nota:** Este glosario es un documento vivo. Al agregar nuevos términos en español al código base, actualice este glosario con la traducción y el contexto apropiados en inglés.
