Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/workflows/index.po
Languages: es

source: Workflows
es: Flujos de trabajo

source: Overview
es: Descripción general

source: This section provides detailed workflows for performing common operations. Each workflow includes prerequisites, step-by-step instructions, and troubleshooting tips.
es: Esta sección proporciona flujos de trabajo detallados para realizar operaciones comunes. Cada flujo de trabajo incluye requisitos previos, instrucciones paso a paso y sugerencias para la resolución de problemas.

source: Creating a New Project
es: Creando un nuevo proyecto

source: **Complete workflow from client setup to first estimate:**
es: **Flujo de trabajo completo desde la configuración del cliente hasta la primera estimación:**

source: **Create client counterparty** (Proyectos → Contrapartes)
es: **Crear contraparte cliente** (Proyectos → Contrapartes)

source: **Add project site** (Proyectos → Sitios)
es: **Agregar sitio del proyecto** (Proyectos → Sitios)

source: **Create contract** with details and retentions
es: **Crear contrato** con detalles y retenciones

source: **Build concept catalog** (manual or Excel import)
es: **Construir catálogo de conceptos** (importación manual o Excel)

source: **Add document recipients** (contacts)
es: **Agregar destinatarios del documento** (contactos)

source: **Create first estimate** for progress billing
es: **Crear primera estimación** para facturación progresiva

source: See :doc:`/user-guide/concepts/projects-contracts` for detailed information.
es: Consulte :doc:`/user-guide/concepts/projects-contracts` para obtener información detallada.

source: Managing Estimates
es: Gestión de estimaciones

source: **Monthly progress billing workflow:**
es: **Flujo de trabajo de facturación de progreso mensual:**

source: Navigate to contract
es: Navegar al contrato

source: Click "Nueva Estimación"
es: Haga clic en "Nueva Estimación"

source: Set period dates
es: Establecer fechas del período

source: Add line items with quantities completed
es: Agregar artículos de línea con cantidades completadas

source: Review calculations and retentions
es: Revisar cálculos y retenciones

source: Generate PDF document
es: Generar documento PDF

source: Submit for approval
es: Enviar para aprobación

source: See :doc:`/user-guide/concepts/estimates` for details.
es: Consulte :doc:`/user-guide/concepts/estimates` para obtener más detalles.

source: Setting Up Subcontracts
es: Configuración de subcontratos

source: **Hierarchical contract structure:**
es: **Estructura jerárquica del contrato:**

source: Create parent contract (main client contract)
es: Crear contrato principal (contrato de cliente principal)

source: Create subcontractor counterparty
es: Crear contraparte subcontratista

source: Create subcontract linked to parent
es: Crear subcontrato vinculado al padre

source: Manage separate estimates for each level
es: Gestionar estimaciones separadas para cada nivel

source: See :doc:`/user-guide/concepts/projects-contracts` (Hierarchical Contracts section).
es: Consulte :doc:`/user-guide/concepts/projects-contracts` (sección Contratos jerárquicos).

source: Importing Catalogs
es: Importar catálogos

source: **Bulk import via Excel:**
es: **Importación masiva a través de Excel:**

source: Prepare Excel with columns: Code, Description, Unit, Quantity, Unit Price
es: Prepare Excel con columnas: Código, Descripción, Unidad, Cantidad, Precio unitario

source: In contract, click "Import from Excel"
es: En contrato, haga clic en "Importar desde Excel"

source: Map columns and verify preview
es: Asignar columnas y verificar la vista previa

source: Confirm import
es: Confirmar importación

source: See :doc:`/user-guide/concepts/concepts-line-items` for catalog management.
es: Consulte :doc:`/user-guide/concepts/concepts-line-items` para la gestión del catálogo.

source: Tips for Efficiency
es: Consejos para la eficiencia

source: Use template contracts for similar projects
es: Utilice contratos modelo para proyectos similares

source: Import catalogs via Excel for large projects
es: Importar catálogos a través de Excel para proyectos grandes

source: Keep counterparty information current
es: Mantenga actualizada la información de la contraparte

source: Review estimates before generating PDFs
es: Revise las estimaciones antes de generar archivos PDF

source: Need More Help?
es: ¿Necesita más ayuda?
