Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/contributor/code-style.po
Languages: es

source: Code Style
es: Estilo de código

source: Code style guidelines for Construbot contributions.
es: Pautas de estilo de código para contribuciones de Construbot.

source: Python Style
es: Estilo pitón

source: Follow PEP 8
es: Siga PEP 8

source: **Code formatting:**
es: **Formato de código:**

source: 4 spaces for indentation (no tabs)
es: 4 espacios para sangría (sin pestañas)

source: Max line length: 100 characters (not strict 79)
es: Longitud máxima de línea: 100 caracteres (no estricto 79)

source: 2 blank lines between top-level functions/classes
es: 2 líneas en blanco entre funciones/clases de nivel superior

source: 1 blank line between methods
es: 1 línea en blanco entre métodos

source: **Use Black:**
es: **Usar negro:**

source: **Use isort:**
es: **Usar isorción:**

source: Naming Conventions
es: Convenciones de nomenclatura

source: Type Hints
es: Consejos de tipo

source: **Encouraged but not required:**
es: **Se recomienda pero no es obligatorio:**

source: Docstrings
es: cadenas de documentos

source: **Use Google style:**
es: **Usa el estilo de Google:**

source: Django Style
es: Estilo Django

source: Model Best Practices
es: Modelo de mejores prácticas

source: **Always include company:**
es: **Incluye siempre compañía:**

source: **Use verbose_name:**
es: **Usar nombre_detallado:**

source: **Meta options:**
es: **Metaopciones:**

source: View Best Practices
es: Ver mejores prácticas

source: **Use class-based views:**
es: **Usar vistas basadas en clases:**

source: **Always scope to company:**
es: **Siempre alcance a la empresa:**

source: Query Optimization
es: Optimización de consultas

source: **Use select_related:**
es: **Usar select_ related:**

source: **Use prefetch_related:**
es: **Usar prefetch_relacionado:**

source: Security
es: Seguridad

source: **Never trust user input:**
es: **Nunca confíes en la entrada del usuario:**

source: **Use get_object_or_404:**
es: **Utilice get_object_or_404:**

source: **Check permissions:**
es: **Verificar permisos:**

source: Testing Style
es: Estilo de prueba

source: **Clear test names:**
es: **Borrar nombres de pruebas:**

source: **Use setUp for common data:**
es: **Utilice la configuración para datos comunes:**

source: **One assertion per test (ideally):**
es: **Una afirmación por prueba (idealmente):**

source: Git Commit Messages
es: Mensajes de confirmación de Git

source: **Format:**
es: **Formato:**

source: **Good examples:**
es: **Buenos ejemplos:**

source: **Bad examples:**
es: **Malos ejemplos:**

source: Common Patterns
es: Patrones comunes

source: **Factory pattern for tests:**
es: **Patrón de fábrica para pruebas:**

source: **Context manager for transactions:**
es: **Administrador de contexto para transacciones:**

source: **Queryset methods:**
es: **Métodos de conjunto de consultas:**

source: Tools
es: Herramientas

source: **Linting:**
es: **Pelusa:**

source: **Formatting:**
es: **Formato:**

source: **Type checking (optional):**
es: **Comprobación de tipo (opcional):**

source: Pre-commit Hooks
es: Ganchos de compromiso previo

source: **Recommended .pre-commit-config.yaml:**
es: **Recomendado .pre-commit-config.yaml:**

source: See Also
es: Ver también

source: `Django Coding Style <https://docs.djangoproject.com/en/dev/internals/contributing/writing-code/coding-style/>`_
es: `Estilo de codificación Django <https://docs.djangoproject.com/en/dev/internals/contributing/writing-code/coding-style/>`_
