Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/contributor/getting-started.po
Languages: es

source: Getting Started
es: Empezando

source: First steps for contributing to Construbot.
es: Primeros pasos para contribuir a Construbot.

source: Prerequisites
es: Requisitos previos

source: **Required:**
es: **Requerido:**

source: Python 3.9.17+
es: Pitón 3.9.17+

source: Docker and Docker Compose (recommended)
es: Docker y Docker Compose (recomendado)

source: **Or for local development:**
es: **O para desarrollo local:**

source: Virtual environment
es: Entorno virtual

source: Fork and Clone
es: Bifurcación y clonación

source: **1. Fork repository:**
es: **1. Repositorio de bifurcación:**

source: Visit https://github.com/javier-llamas/construbot and click "Fork"
es: Visita https://github.com/javier-llamas/construbot y haz clic en "Fork"

source: **2. Clone your fork:**
es: **2. Clona tu tenedor:**

source: **3. Add upstream remote:**
es: **3. Agregar control remoto ascendente:**

source: Development Setup
es: Configuración de desarrollo

source: **Using Docker (Recommended):**
es: **Usando Docker (recomendado):**

source: **Using Local Environment:**
es: **Usando el entorno local:**

source: Making Changes
es: Hacer cambios

source: **1. Create feature branch:**
es: **1. Crear rama de funciones:**

source: **2. Make changes**
es: **2. Hacer cambios**

source: **3. Run tests:**
es: **3. Ejecutar pruebas:**

source: **4. Commit:**
es: **4. Comprometerse:**

source: **5. Push:**
es: **5. Empujar:**

source: **6. Create Pull Request on GitHub**
es: **6. Crear solicitud de extracción en GitHub**

source: Code Style
es: Estilo de código

source: **Format code:**
es: **Código de formato:**

source: **Lint:**
es: **Hilas:**

source: See :doc:`code-style` for complete guidelines.
es: Consulte :doc:`code-style` para obtener pautas completas.

source: See Also
es: Ver también
