Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/contributor/index.po
Languages: es

source: Contributor Guide
es: Guía para contribuyentes

source: Welcome to the Construbot contributor documentation!
es: ¡Bienvenido a la documentación para contribuyentes de Construbot!

source: Overview
es: Descripción general

source: Thank you for your interest in contributing to Construbot! This guide covers everything you need to know about contributing code, documentation, translations, and more.
es: ¡Gracias por tu interés en contribuir a Construbot! Esta guía cubre todo lo que necesita saber sobre cómo contribuir con código, documentación, traducciones y más.

source: **First time contributor?** Start with :doc:`getting-started`
es: **¿Colabora por primera vez?** Comience con :doc:`Getting-Started`

source: Ways to Contribute
es: Formas de contribuir

source: 💻 **Code Contributions**
es: 💻 **Contribuciones de código**

source: Bug fixes
es: Corrección de errores

source: New features
es: Nuevas características

source: Performance improvements
es: Mejoras de rendimiento

source: Code refactoring
es: Refactorización de código

source: 📚 **Documentation**
es: 📚 **Documentación**

source: Fix typos and errors
es: Corregir errores tipográficos y

source: Improve existing docs
es: Mejorar los documentos existentes

source: Add new guides
es: Agregar nuevas guías

source: Translate to Spanish
es: Traducir al español

source: 🌍 **Translations**
es: 🌍 **Traducciones**

source: Translate UI strings
es: Traducir cadenas de UI

source: Update Spanish→English glossary
es: Actualizar glosario español→inglés

source: Review translations
es: Revisar traducciones

source: 🐛 **Bug Reports**
es: 🐛 **Informes de errores**

source: Report issues
es: Informar problemas

source: Provide reproduction steps
es: Proporcionar pasos de reproducción.

source: Suggest fixes
es: Sugerir correcciones

source: ✨ **Feature Requests**
es: ✨ **Solicitudes de funciones**

source: Propose new features
es: Proponer nuevas funciones.

source: Discuss improvements
es: Discutir mejoras

source: Vote on proposals
es: Votar propuestas

source: Quick Start
es: Inicio rápido

source: **1. Fork and Clone:**
es: **1. Bifurcación y clonación:**

source: **2. Set up development environment:**
es: **2. Configurar el entorno de desarrollo:**

source: **3. Create feature branch:**
es: **3. Crear rama de funciones:**

source: **4. Make changes and test:**
es: **4. Realice cambios y pruebe:**

source: **5. Submit pull request**
es: **5. Enviar solicitud de extracción**

source: See :doc:`getting-started` for detailed steps.
es: Consulte :doc:`Getting-Start` para conocer los pasos detallados.

source: Development Workflow
es: Flujo de trabajo de desarrollo

source: **1. Find an issue or create one**
es: **1. Encuentre un problema o cree uno**

source: Browse https://github.com/javier-llamas/construbot/issues
es: Navegar por https://github.com/javier-llamas/construbot/issues

source: **2. Discuss approach**
es: **2. Discutir el enfoque**

source: Comment on issue before starting major work
es: Comente sobre el problema antes de comenzar un trabajo importante.

source: **3. Write code**
es: **3. Escribir código**

source: Follow :doc:`code-style` guidelines
es: Siga las pautas :doc:`code-style`

source: **4. Write tests**
es: **4. Escribir pruebas**

source: See :doc:`testing/index`
es: Ver :doc:`testing/index`

source: **5. Update documentation**
es: **5. Actualizar documentación**

source: Document new features
es: Documentar nuevas características

source: **6. Submit PR**
es: **6. Enviar PR**

source: Include clear description and tests
es: Incluir descripción y pruebas claras.

source: Code Style
es: Estilo de código

source: **Python:**
es: **Pitón:**

source: Follow PEP 8
es: Siga PEP 8

source: Use Black for formatting
es: Utilice negro para formatear

source: Type hints encouraged
es: Se recomienda escribir sugerencias

source: Docstrings for public APIs
es: Cadenas de documentación para API públicas

source: Follow Django best practices
es: Siga las mejores prácticas de Django

source: Use Django's built-in features
es: Utilice las funciones integradas de Django

source: Company-scope all queries
es: Todas las consultas del ámbito de la empresa

source: See :doc:`code-style` for complete guidelines.
es: Consulte :doc:`code-style` para obtener pautas completas.

source: Testing
es: Pruebas

source: **Run tests:**
es: **Ejecutar pruebas:**

source: See :doc:`testing/index` for testing guide.
es: Consulte :doc:`testing/index` para obtener una guía de prueba.

source: Documentation
es: Documentación

source: **Build docs:**
es: **Documentos de compilación:**

source: **Auto-rebuild:**
es: **Reconstrucción automática:**

source: See :doc:`documentation/index` for documentation guidelines.
es: Consulte :doc:`documentation/index` para conocer las pautas de documentación.

source: Translation
es: Traducción

source: **Spanish→English glossary:**
es: **Glosario español→inglés:**

source: See :doc:`translation/glossary` for complete term mappings.
es: Consulte :doc:`translation/glossary` para ver las asignaciones de términos completas.

source: **Add translations:**
es: **Agregar traducciones:**

source: See :doc:`translation/index` for translation guide.
es: Consulte :doc:`translation/index` para obtener una guía de traducción.

source: Pull Request Guidelines
es: Directrices para solicitudes de extracción

source: **Before submitting:**
es: **Antes de enviar:**

source: ✅ Tests pass (``make test``)
es: ✅ Pasan las pruebas (``hacer prueba``)

source: ✅ Code follows style guide
es: ✅ El código sigue la guía de estilo

source: ✅ Documentation updated
es: ✅ Documentación actualizada

source: ✅ Commits are clear and atomic
es: ✅ Los compromisos son claros y atómicos

source: ✅ PR description explains changes
es: ✅ La descripción de PR explica los cambios

source: **PR template:**
es: **Plantilla de relaciones públicas:**

source: Community
es: Comunidad

source: **Be respectful and inclusive**
es: **Sea respetuoso e inclusivo**

source: We follow the Contributor Covenant Code of Conduct.
es: Seguimos el Código de conducta del Pacto del colaborador.

source: **Ask for help**
es: **Pide ayuda**

source: GitHub Issues
es: Problemas de GitHub

source: GitHub Discussions (if available)
es: Discusiones de GitHub (si están disponibles)

source: **Give feedback**
es: **Dar comentarios**

source: Your input helps improve Construbot!
es: ¡Tus comentarios ayudan a mejorar Construbot!

source: Documentation Sections
es: Secciones de documentación

source: Resources
es: Recursos

source: **Issues:** https://github.com/javier-llamas/construbot/issues
es: **Problemas:** https://github.com/javier-llamas/construbot/issues

source: **Developer Docs:** :doc:`/developer/index`
es: **Documentos del desarrollador:** :doc:`/developer/index`

source: **Architecture:** :doc:`/developer/architecture/index`
es: **Arquitectura:** :doc:`/developer/architecture/index`

source: License
es: Licencia

source: By contributing, you agree that your contributions will be licensed under the AGPLv3 license.
es: Al contribuir, usted acepta que sus contribuciones tendrán la licencia AGPLv3.

source: Thank You
es: Gracias

source: Thank you for contributing to Construbot! Your contributions help make this project better for everyone.
es: ¡Gracias por contribuir a Construbot! Sus contribuciones ayudan a que este proyecto sea mejor para todos.
