Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/features/index.po
Languages: es

source: Features
es: Características

source: Discover Construbot's powerful capabilities for construction management.
es: Descubra las poderosas capacidades de Construbot para la gestión de la construcción.

source: Hierarchical Contracts
es: Contratos jerárquicos

source: **Parent-child contract relationships** for complex project structures:
es: **Relaciones contractuales entre padres e hijos** para estructuras de proyectos complejos:

source: Link subcontracts to main contracts
es: Vincular subcontratos a contratos principales

source: Track costs across multiple levels
es: Realice un seguimiento de los costos en múltiples niveles

source: Rollup reporting for project totals
es: Informes acumulativos para los totales del proyecto

source: Independent estimates for each level
es: Estimaciones independientes para cada nivel.

source: **Use cases:** - General contractor with multiple subcontractors - Phased projects with separate billing - Multi-building developments
es: **Casos de uso:** - Contratista general con múltiples subcontratistas - Proyectos por fases con facturación separada - Desarrollos de varios edificios

source: See :doc:`/user-guide/concepts/projects-contracts` for details.
es: Consulte :doc:`/user-guide/concepts/projects-contracts` para obtener más detalles.

source: Progress Billing & Estimates
es: Facturación y estimaciones de progreso

source: **Automated estimate generation** with cumulative tracking:
es: **Generación de estimaciones automatizada** con seguimiento acumulativo:

source: Create progress estimates (estimaciones) easily
es: Cree estimaciones de progreso fácilmente

source: Automatic cumulative quantity calculation
es: Cálculo automático de cantidad acumulada

source: Retention tracking and management
es: Seguimiento y gestión de la retención

source: Over-billing prevention warnings
es: Advertencias de prevención de sobrefacturación

source: Professional PDF generation
es: Generación de PDF profesional

source: **Financial accuracy:** - Real-time subtotal calculation - Multiple retention types supported - Advance payment amortization - Payment history tracking
es: **Precisión financiera:** - Cálculo del subtotal en tiempo real - Se admiten múltiples tipos de retención - Amortización de pagos anticipados - Seguimiento del historial de pagos

source: See :doc:`/user-guide/concepts/estimates` for details.
es: Consulte :doc:`/user-guide/concepts/estimates` para obtener más detalles.

source: Excel Integration
es: Integración con Excel

source: **Bulk import capabilities** for efficient data entry:
es: **Capacidades de importación masiva** para una entrada de datos eficiente:

source: **Concept Catalogs**: Import hundreds of line items at once
es: **Catálogos de conceptos**: importe cientos de artículos de línea a la vez

source: **Retentions**: Upload retention structures from templates
es: **Retenciones**: cargar estructuras de retención desde plantillas

source: **Data Export**: Generate Excel reports for analysis
es: **Exportación de datos**: genere informes de Excel para análisis

source: **Benefits:** - Save hours on manual data entry - Reduce errors with validated imports - Use existing estimating tools - Standardize across projects
es: **Beneficios:** - Ahorre horas en la entrada manual de datos - Reduzca los errores con importaciones validadas - Utilice las herramientas de estimación existentes - Estandarice todos los proyectos

source: See :doc:`/user-guide/concepts/concepts-line-items` for catalog management.
es: Consulte :doc:`/user-guide/concepts/concepts-line-items` para la gestión del catálogo.

source: Multi-Company Support
es: Soporte multiempresa

source: **Single installation, multiple companies:**
es: **Instalación única, múltiples empresas:**

source: Complete data isolation between companies
es: Aislamiento completo de datos entre empresas

source: User access to multiple companies
es: Acceso de usuario a múltiples empresas.

source: Switch active company seamlessly
es: Cambie de empresa activa sin problemas

source: Company-specific configurations
es: Configuraciones específicas de la empresa

source: **Perfect for:** - Holding companies with subsidiaries - Partnerships managing separate entities - Contractors with multiple business licenses
es: **Perfecto para:** - Sociedades holding con subsidiarias - Asociaciones que administran entidades separadas - Contratistas con múltiples licencias comerciales

source: Document Generation
es: Generación de documentos

source: **Professional PDF documents** for all project needs:
es: **Documentos PDF profesionales** para todas las necesidades del proyecto:

source: **Estimates**: Detailed progress billing documents
es: **Estimaciones**: Documentos de facturación de progreso detallados

source: **Contracts**: Complete contract documentation
es: **Contratos**: Documentación completa del contrato

source: **Reports**: Financial and progress reports
es: **Informes**: Informes financieros y de progreso

source: **Custom Templates**: Branded documents with logo
es: **Plantillas personalizadas**: Documentos personalizados con logotipo

source: **Features:** - Automatic formatting - Multiple recipients support - Email delivery integration - Archive and tracking
es: **Características:** - Formato automático - Compatibilidad con múltiples destinatarios - Integración de entrega de correo electrónico - Archivo y seguimiento

source: Retention Management
es: Gestión de retención

source: **Comprehensive retention tracking:**
es: **Seguimiento integral de retención:**

source: **Multiple retention types**: Performance, warranty, tax withholdings
es: **Múltiples tipos de retención**: Rendimiento, garantía, retenciones de impuestos

source: **Automatic calculation**: Applied to each estimate
es: **Cálculo automático**: Aplicado a cada estimación

source: **Release tracking**: Monitor retention balances
es: **Seguimiento de versiones**: Supervise los saldos de retención

source: **Partial releases**: Progressive release support
es: **Versiones parciales**: compatibilidad con versiones progresivas

source: **Financial control:** - Cumulative retention balance tracking - Release date reminders - Accounting integration ready
es: **Control financiero:** - Seguimiento del saldo de retención acumulada - Recordatorios de fecha de lanzamiento - Integración contable lista

source: See :doc:`/user-guide/concepts/retentions` for details.
es: Consulte :doc:`/user-guide/concepts/retentions` para obtener más detalles.

source: Site & Contact Management
es: Gestión de sitios y contactos

source: **Organize project locations and communications:**
es: **Organizar ubicaciones y comunicaciones del proyecto:**

source: **Multiple sites per client**: Separate locations easily
es: **Múltiples sitios por cliente**: Separe las ubicaciones fácilmente

source: **Contact management**: Track recipients for documents
es: **Gestión de contactos**: seguimiento de los destinatarios de los documentos

source: **GPS coordinates**: Remote site support
es: **Coordenadas GPS**: soporte de sitio remoto

source: **Communication history**: Track approvals and submissions
es: **Historial de comunicaciones**: seguimiento de aprobaciones y envíos

source: See :doc:`/user-guide/concepts/sites-contacts` for details.
es: Consulte :doc:`/user-guide/concepts/sites-contacts` para obtener más detalles.

source: Security & Permissions
es: Seguridad y permisos

source: **Role-based access control:**
es: **Control de acceso basado en roles:**

source: **Six permission levels**: From Auxiliar to Superusuario
es: **Seis niveles de permiso**: De Auxiliar a Superusuario

source: **Granular permissions**: Control who can create, edit, approve
es: **Permisos granulares**: controla quién puede crear, editar y aprobar

source: **Audit trails**: Track all changes and actions
es: **Pistas de auditoría**: realice un seguimiento de todos los cambios y acciones

source: **Data isolation**: Company-level security
es: **Aislamiento de datos**: seguridad a nivel de empresa

source: **Permission levels:** - Auxiliar (Assistant) - Coordinador (Coordinator) - Director - Corporativo (Corporate) - Soporte (Support) - Superusuario (Super User)
es: **Niveles de permiso:** - Auxiliar (Asistente) - Coordinador (Coordinador) - Director - Corporativo (Corporativo) - Soporte (Soporte) - Superusuario (Super Usuario)

source: Tree-Based Contract Hierarchy
es: Jerarquía de contratos basada en árboles

source: Powered by **django-treebeard** for efficient hierarchical data:
es: Desarrollado por **django-treebeard** para datos jerárquicos eficientes:

source: Materialized Path implementation
es: Implementación del Camino Materializado

source: Fast tree queries and navigation
es: Consultas y navegación rápidas en árbol

source: Unlimited nesting levels
es: Niveles de anidación ilimitados

source: Ancestor/descendant calculations
es: Cálculos de antepasados/descendientes

source: API Access
es: Acceso API

source: **REST API** with JWT authentication:
es: **API REST** con autenticación JWT:

source: Full CRUD operations on all entities
es: Operaciones CRUD completas en todas las entidades.

source: Secure token-based authentication
es: Autenticación segura basada en tokens

source: JSON data interchange
es: intercambio de datos JSON

source: Integration with external systems
es: Integración con sistemas externos.

source: See :doc:`/developer/api/index` for API documentation.
es: Consulte :doc:`/developer/api/index` para obtener documentación de API.

source: Customization
es: Personalización

source: **Flexible configuration options:**
es: **Opciones de configuración flexibles:**

source: Custom retention types and percentages
es: Tipos y porcentajes de retención personalizados

source: Configurable document templates
es: Plantillas de documentos configurables

source: Company-specific settings
es: Configuraciones específicas de la empresa

source: Field validation rules
es: Reglas de validación de campos

source: Planned enhancements:
es: Mejoras planificadas:

source: Mobile application (iOS/Android)
es: Aplicación móvil (iOS/Android)

source: Advanced analytics dashboard
es: Panel de análisis avanzado

source: Accounting software integrations
es: Integraciones de software de contabilidad

source: Multi-currency support
es: Soporte multidivisa

source: Equipment tracking
es: Seguimiento de equipos

source: Time & labor management
es: Gestión del tiempo y la mano de obra

source: Need More Information?
es: ¿Necesita más información?
