Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/contributor/translation/glossary.po
Languages: es

source: Translation Glossary
es: Glosario de traducción

source: Spanish→English translation reference for contributors.
es: Referencia de traducción español→inglés para colaboradores.

source: Overview
es: Descripción general

source: The Construbot codebase uses Spanish terminology for business entities. This glossary provides canonical English translations for consistency.
es: El código base de Construbot utiliza terminología española para entidades comerciales. Este glosario proporciona traducciones canónicas al inglés para mantener la coherencia.

source: Master Glossary
es: Glosario maestro

source: **Complete Glossary:** See :doc:`/_glossary/domain-terms` for the comprehensive 100+ term glossary with descriptions, model references, and examples.
es: **Glosario completo:** Consulte :doc:`/_glossary/domain-terms` para obtener un glosario completo de más de 100 términos con descripciones, referencias de modelos y ejemplos.

source: Quick Reference
es: Referencia rápida

source: Core Business Terms
es: Términos comerciales principales

source: Spanish
es: Español

source: English
es: Inglés

source: Model
es: Modelo

source: Contract / Project
es: Contrato / Proyecto

source: proyectos.models.Contrato
es: proyectos.modelos.Contrato

source: Counterparty
es: Contraparte

source: Estimate / Progress Payment
es: Estimación / Pago Progreso

source: proyectos.models.Estimate
es: proyectos.modelos.Estimación

source: Concept / Line Item
es: Concepto/línea de pedido

source: proyectos.models.Concept
es: proyectos.modelos.Concepto

source: Retention / Withholding
es: Retención / Retención

source: proyectos.models.Retenciones
es: proyectos.modelos.Retenciones

source: Site
es: Sitio

source: proyectos.models.Sitio
es: proyectos.modelos.Sitio

source: Destinatario
es: Destinotario

source: Recipient / Contact
es: Destinatario / Contacto

source: proyectos.models.Destinatario
es: proyectos.modelos.Destinatario

source: Counterparty Types
es: Tipos de contraparte

source: Client
es: Cliente

source: Piecework Contractor
es: Contratista a destajo

source: Subcontractor
es: Subcontratista

source: Field Names
es: Nombres de campo

source: folio
es: fol

source: reference_number
es: número_referencia

source: amount
es: cantidad

source: advance_payment
es: pago_anticipo

source: start_date
es: fecha_inicio

source: end_date
es: fecha_final

source: Translation Guidelines
es: Directrices de traducción

source: **1. Use canonical translations:**
es: **1. Utilice traducciones canónicas:**

source: Follow the master glossary for consistency.
es: Siga el glosario maestro para mantener la coherencia.

source: **2. Context matters:**
es: **2. El contexto importa:**

source: **Contrato** = "Contract" (legal), "Project" (colloquial)
es: **Contrato** = "Contrato" (legal), "Proyecto" (coloquial)

source: **Estimación** = "Estimate" (technical), "Progress Payment" (financial)
es: **Estimación** = "Estimación" (técnica), "Progreso de pago" (financiero)

source: **3. Preserve Spanish in code:**
es: **3. Preservar el español en código:**

source: Don't rename model fields - keep Spanish names, translate in documentation.
es: No cambie el nombre de los campos del modelo: mantenga los nombres en español, tradúzcalos en la documentación.

source: **4. First use pattern:**
es: **4. Patrón de primer uso:**

source: **5. Model references:**
es: **5. Referencias de modelo:**

source: Always reference the model when introducing terms:
es: Siempre haga referencia al modelo al introducir términos:

source: Contributing Translations
es: Contribuyendo con traducciones

source: **Add new terms:**
es: **Agregar nuevos términos:**

source: Add to :doc:`/_glossary/domain-terms`
es: Agregar a :doc:`/_glossary/domain-terms`

source: Include: Spanish term, English translation, description, model reference, examples
es: Incluye: término en español, traducción al inglés, descripción, referencia del modelo, ejemplos.

source: Alphabetize within category
es: Alfabetizar dentro de la categoría

source: Submit pull request
es: Enviar solicitud de extracción

source: **Update existing terms:**
es: **Actualizar términos existentes:**

source: Discuss in GitHub issue first
es: Discutir primero el problema en GitHub

source: Update master glossary
es: Actualizar glosario maestro

source: Update all affected documentation
es: Actualizar toda la documentación afectada

source: Django Translation
es: Traductor de Django

source: **For UI strings:**
es: **Para cadenas de interfaz de usuario:**

source: See Also
es: Ver también
