Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/docker_ec2.po
Languages: es

source: Developing with Docker
es: Desarrollando con Docker

source: You can develop your application in a `Docker`_ container for simpler deployment onto bare Linux machines later. This instruction assumes an `Amazon Web Services`_ EC2 instance, but it should work on any machine with Docker > 1.3 and `Docker compose`_ installed.
es: Puede desarrollar su aplicación en un contenedor `Docker`_ para una implementación más sencilla en máquinas Linux simples más adelante. Esta instrucción asume una instancia EC2 de `Amazon Web Services`_, pero debería funcionar en cualquier máquina con Docker > 1.3 y `Docker compose`_ instalado.

source: Setting up
es: Configurando

source: Docker encourages running one container for each process. This might mean one container for your web server, one for Django application and a third for your database. Once you're happy composing containers in this way you can easily add more, such as a `Redis`_ cache.
es: Docker recomienda ejecutar un contenedor para cada proceso. Esto podría significar un contenedor para su servidor web, uno para la aplicación Django y un tercero para su base de datos. Una vez que esté satisfecho con la composición de contenedores de esta manera, puede agregar fácilmente más, como un caché `Redis`_.

source: The Docker compose tool (previously known as `fig`_) makes linking these containers easy. An example set up for your Cookiecutter Django project might look like this:
es: La herramienta de redacción de Docker (anteriormente conocida como `fig`_) facilita la vinculación de estos contenedores. Un ejemplo configurado para su proyecto Cookiecutter Django podría verse así:

source: Each component of your application would get its own `Dockerfile`_. The rest of this example assumes you are using the `base postgres image`_ for your database. Your database settings in `config/base.py` might then look something like:
es: Cada componente de su aplicación obtendrá su propio `Dockerfile`_. El resto de este ejemplo supone que está utilizando la `imagen base de Postgres`_ para su base de datos. La configuración de su base de datos en `config/base.py` podría verse así:

source: The `Docker compose documentation`_ explains in detail what you can accomplish in the `production.yml` file, but an example configuration might look like this:
es: La `Documentación de redacción de Docker`_ explica en detalle lo que puede lograr en el archivo `production.yml`, pero una configuración de ejemplo podría verse así:

source: We'll ignore the webserver for now (you'll want to comment that part out while we do). A working Dockerfile to run your cookiecutter application might look like this:
es: Ignoraremos el servidor web por ahora (querrás comentar esa parte mientras lo hacemos). Un Dockerfile funcional para ejecutar su aplicación cookiecutter podría verse así:

source: Running `sudo docker-compose -f production.yml build` will follow the instructions in your `production.yml` file and build the database container, then your webapp, before mounting your cookiecutter project files as a volume in the webapp container and linking to the database. Our example yaml file runs in development mode but changing it to production mode is as simple as commenting out the line using `runserver` and uncommenting the line using `gunicorn`.
es: Al ejecutar `sudo docker-compose -f production.yml build`, se seguirán las instrucciones de su archivo `production.yml` y se creará el contenedor de la base de datos, luego la aplicación web, antes de montar los archivos del proyecto cookiecutter como un volumen en el contenedor de la aplicación web y vincularlos a la base de datos. Nuestro archivo yaml de ejemplo se ejecuta en modo de desarrollo, pero cambiarlo al modo de producción es tan simple como comentar la línea usando `runserver` y descomentar la línea usando `gunicorn`.

source: Both are set to run on port `0.0.0.0:8000`, which is where the Docker daemon will discover it. You can now run `sudo docker-compose -f production.yml up` and browse to `localhost:8000` to see your application running.
es: Ambos están configurados para ejecutarse en el puerto `0.0.0.0:8000`, que es donde el demonio Docker los descubrirá. Ahora puede ejecutar `sudo docker-compose -f production.yml up` y buscar `localhost:8000` para ver su aplicación en ejecución.

source: Deployment
es: Despliegue

source: You'll need a webserver container for deployment. An example setup for `Nginx`_ might look like this:
es: Necesitará un contenedor de servidor web para la implementación. Un ejemplo de configuración para `Nginx`_ podría verse así:

source: That Dockerfile assumes you have an Nginx conf file named `site.conf` in the same directory as the webserver Dockerfile. A very basic example, which forwards traffic onto the development server or gunicorn for processing, would look like this:
es: Ese Dockerfile supone que tiene un archivo de configuración de Nginx llamado `site.conf` en el mismo directorio que el servidor web Dockerfile. Un ejemplo muy básico, que reenvía el tráfico al servidor de desarrollo o gunicorn para su procesamiento, se vería así:

source: Running `sudo docker-compose -f production.yml build webserver` will build your server container. Running `sudo docker-compose -f production.yml up` will now expose your application directly on `localhost` (no need to specify the port number).
es: Al ejecutar `sudo docker-compose -f production.yml build webserver`, se creará el contenedor de su servidor. Al ejecutar `sudo docker-compose -f production.yml up` ahora se expondrá su aplicación directamente en `localhost` (no es necesario especificar el número de puerto).

source: Building and running your app on EC2
es: Construyendo y ejecutando su aplicación en EC2

source: All you now need to do to run your app in production is:
es: Todo lo que necesitas hacer ahora para ejecutar tu aplicación en producción es:

source: Create an empty EC2 Linux instance (any Linux machine should do).
es: Cree una instancia EC2 Linux vacía (cualquier máquina Linux debería funcionar).

source: Install your preferred source control solution, Docker and Docker compose on the news instance.
es: Instale su solución de control de fuente preferida, Docker y Docker Compone en la instancia de noticias.

source: Pull in your code from source control. The root directory should be the one with your `production.yml` file in it.
es: Introduzca su código desde el control de fuente. El directorio raíz debe ser el que contiene su archivo `production.yml`.

source: Run `sudo docker-compose -f production.yml build` and `sudo docker-compose -f production.yml up`.
es: Ejecute `sudo docker-compose -f production.yml build` y `sudo docker-compose -f production.yml up`.

source: Assign an `Elastic IP address`_ to your new machine.
es: Asigne una `dirección IP elástica`_ a su nueva máquina.

source: Point your domain name to the elastic IP.
es: Apunte su nombre de dominio a la IP elástica.

source: **Be careful with Elastic IPs** because, on the AWS free tier, if you assign one and then stop the machine you will incur charges while the machine is down (presumably because you're preventing them allocating the IP to someone else).
es: **Tenga cuidado con las IP elásticas** porque, en el nivel gratuito de AWS, si asigna una y luego detiene la máquina, incurrirá en cargos mientras la máquina esté inactiva (presumiblemente porque les impide asignar la IP a otra persona).

source: Security advisory
es: Aviso de seguridad

source: The setup described in this instruction will get you up-and-running but it hasn't been audited for security. If you are running your own setup like this it is always advisable to, at a minimum, examine your application with a tool like `OWASP ZAP`_ to see what security holes you might be leaving open.
es: La configuración descrita en estas instrucciones lo pondrá en funcionamiento, pero su seguridad no ha sido auditada. Si está ejecutando su propia configuración de esta manera, siempre es recomendable, como mínimo, examinar su aplicación con una herramienta como `OWASP ZAP`_ para ver qué agujeros de seguridad podría estar dejando abiertos.
