Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es

source: User Guide
es: Guía del Usuario

source: Developer Documentation
es: Documentación para Desarrolladores

source: Contributor Guide
es: Guía del Colaborador

source: Reference
es: Referencia

source: Construbot Documentation
es: Documentación de Construbot

source: Python Version
es: Versión de Python

source: Django Version
es: Versión de Django

source: License
es: Licencia

source: **Una Solución Operativa para Constructoras** | An Operational Solution for Construction Companies
es: **Una Solución Operativa para Constructoras** | Una Solución Operativa para Empresas Constructoras

source: Construbot is a comprehensive Django-based construction management system for tracking contracts, estimates, counterparties, and financial operations. Built with multi-tenancy, hierarchical data structures, and a powerful REST API.
es: Construbot es un sistema integral de gestión de construcción basado en Django para el seguimiento de contratos, estimaciones, contrapartes y operaciones financieras. Construido con multi-tenencia, estructuras de datos jerárquicas y una potente API REST.

source: **Language Note:** While the codebase uses Spanish terminology (Contrato, Estimación, etc.), this documentation is primarily in English with Spanish translations available. See :doc:`_glossary/domain-terms` for complete term translations.
es: **Nota sobre el idioma:** Aunque el código base usa terminología en español (Contrato, Estimación, etc.), esta documentación está principalmente en inglés con traducciones al español disponibles. Consulte :doc:`_glossary/domain-terms` para traducciones completas de términos.

source: Quick Links
es: Enlaces Rápidos

source: What is Construbot?
es: ¿Qué es Construbot?

source: Construbot helps construction companies manage:
es: Construbot ayuda a las empresas constructoras a gestionar:

source: ✅ **Hierarchical Contracts** - Parent contracts with subcontracts using tree structures
es: ✅ **Contratos Jerárquicos** - Contratos padre con subcontratos usando estructuras de árbol

source: ✅ **Progress Estimates** - Track work completion and payments (Estimaciones)
es: ✅ **Estimaciones de Avance** - Seguimiento de la finalización de trabajos y pagos (Estimaciones)

source: ✅ **Counterparty Management** - Clients, subcontractors, and piecework contractors
es: ✅ **Gestión de Contrapartes** - Clientes, subcontratistas y destajistas

source: ✅ **Financial Tracking** - Advances, retentions, and payment calculations
es: ✅ **Seguimiento Financiero** - Anticipos, retenciones y cálculos de pagos

source: ✅ **Multi-Company Support** - One system for multiple business entities
es: ✅ **Soporte Multi-Empresa** - Un sistema para múltiples entidades de negocio

source: ✅ **PDF Generation** - Automated document creation
es: ✅ **Generación de PDF** - Creación automatizada de documentos

source: ✅ **Excel Import/Export** - Bulk data operations
es: ✅ **Importación/Exportación Excel** - Operaciones masivas de datos

source: ✅ **REST API** - Mobile and external integrations
es: ✅ **API REST** - Integraciones móviles y externas

source: Key Features
es: Características Principales

source: **Multi-Tenant Architecture**
es: **Arquitectura Multi-Tenencia**

source: Three-level hierarchy (Customer → Company → User) with complete data isolation between companies.
es: Jerarquía de tres niveles (Cliente → Empresa → Usuario) con completo aislamiento de datos entre empresas.

source: **Hierarchical Contracts**
es: **Contratos Jerárquicos**

source: Use django-treebeard for parent/child contract relationships with automatic financial aggregation.
es: Usa django-treebeard para relaciones padre/hijo de contratos con agregación financiera automática.

source: **Email-Based Authentication**
es: **Autenticación Basada en Email**

source: Modern authentication using email (not usernames) with six permission levels from Auxiliar to Superusuario.
es: Autenticación moderna usando email (no nombres de usuario) con seis niveles de permisos desde Auxiliar hasta Superusuario.

source: **Production-Ready**
es: **Listo para Producción**

source: Docker deployment, PostgreSQL database, Redis caching, Celery tasks, S3 storage, and comprehensive security.
es: Despliegue Docker, base de datos PostgreSQL, caché Redis, tareas Celery, almacenamiento S3 y seguridad integral.

source: Technology Stack
es: Stack Tecnológico

source: Quick Start
es: Inicio Rápido

source: **For Users:**
es: **Para Usuarios:**

source: **For Developers (Docker):**
es: **Para Desarrolladores (Docker):**

source: See :doc:`developer/installation/index` for complete setup.
es: Consulte :doc:`developer/installation/index` para la configuración completa.

source: Documentation Structure
es: Estructura de la Documentación

source: This documentation is organized for three audiences:
es: Esta documentación está organizada para tres audiencias:

source: **For end users** managing construction projects:
es: **Para usuarios finales** que gestionan proyectos de construcción:

source: :doc:`user-guide/introduction` - What is Construbot
es: :doc:`user-guide/introduction` - Qué es Construbot

source: :doc:`user-guide/getting-started` - First steps tutorial
es: :doc:`user-guide/getting-started` - Tutorial de primeros pasos

source: :doc:`user-guide/concepts/index` - Core concepts (contracts, estimates, etc.)
es: :doc:`user-guide/concepts/index` - Conceptos fundamentales (contratos, estimaciones, etc.)

source: :doc:`user-guide/workflows/index` - Step-by-step workflows
es: :doc:`user-guide/workflows/index` - Flujos de trabajo paso a paso

source: :doc:`user-guide/features/index` - Advanced features
es: :doc:`user-guide/features/index` - Características avanzadas

source: :doc:`user-guide/faq` - Common questions
es: :doc:`user-guide/faq` - Preguntas frecuentes

source: **For developers** installing or extending Construbot:
es: **Para desarrolladores** que instalan o extienden Construbot:

source: :doc:`developer/installation/index` - Development setup
es: :doc:`developer/installation/index` - Configuración de desarrollo

source: :doc:`developer/deployment/index` - Production deployment
es: :doc:`developer/deployment/index` - Despliegue en producción

source: :doc:`developer/architecture/index` - System architecture
es: :doc:`developer/architecture/index` - Arquitectura del sistema

source: :doc:`developer/api/index` - REST API reference
es: :doc:`developer/api/index` - Referencia de API REST

source: :doc:`developer/models/index` - Data models
es: :doc:`developer/models/index` - Modelos de datos

source: **For contributors** improving Construbot:
es: **Para colaboradores** que mejoran Construbot:

source: :doc:`contributor/index` - Getting started
es: :doc:`contributor/index` - Primeros pasos

source: :doc:`contributor/testing/index` - Testing guide
es: :doc:`contributor/testing/index` - Guía de pruebas

source: :doc:`contributor/translation/glossary` - Translation glossary
es: :doc:`contributor/translation/glossary` - Glosario de traducción

source: :doc:`contributor/documentation/index` - Documentation guidelines
es: :doc:`contributor/documentation/index` - Guías de documentación

source: **Quick reference** for all users:
es: **Referencia rápida** para todos los usuarios:

source: :doc:`reference/glossary` - Spanish→English terms
es: :doc:`reference/glossary` - Términos Español→Inglés

source: :doc:`reference/makefile-commands` - Development commands
es: :doc:`reference/makefile-commands` - Comandos de desarrollo

source: :doc:`_glossary/domain-terms` - Complete glossary
es: :doc:`_glossary/domain-terms` - Glosario completo

source: Popular Pages
es: Páginas Populares

source: **Getting Started:**
es: **Primeros Pasos:**

source: :doc:`user-guide/getting-started` - User tutorial
es: :doc:`user-guide/getting-started` - Tutorial de usuario

source: :doc:`developer/installation/docker-setup` - Docker development
es: :doc:`developer/installation/docker-setup` - Desarrollo con Docker

source: :doc:`developer/deployment/aws-ec2` - AWS deployment
es: :doc:`developer/deployment/aws-ec2` - Despliegue en AWS

source: **Core Concepts:**
es: **Conceptos Fundamentales:**

source: :doc:`user-guide/concepts/projects-contracts` - Understanding contracts
es: :doc:`user-guide/concepts/projects-contracts` - Entendiendo los contratos

source: :doc:`developer/architecture/multi-tenancy` - Multi-tenant architecture
es: :doc:`developer/architecture/multi-tenancy` - Arquitectura multi-tenencia

source: :doc:`_glossary/domain-terms` - Complete Spanish→English glossary
es: :doc:`_glossary/domain-terms` - Glosario completo Español→Inglés

source: **Configuration:**
es: **Configuración:**

source: :doc:`developer/installation/configuration` - Environment variables
es: :doc:`developer/installation/configuration` - Variables de entorno

source: :doc:`developer/deployment/environment-variables` - Production config
es: :doc:`developer/deployment/environment-variables` - Configuración de producción

source: :doc:`developer/architecture/settings-structure` - Django settings
es: :doc:`developer/architecture/settings-structure` - Configuración de Django

source: Spanish Terminology
es: Terminología en Español

source: The codebase uses Spanish business terminology. Key translations:
es: El código usa terminología de negocios en español. Traducciones clave:

source: Spanish
es: Español

source: English
es: Inglés

source: Description
es: Descripción

source: Contract / Project
es: Contrato / Proyecto

source: Main business entity
es: Entidad de negocio principal

source: Counterparty
es: Contraparte

source: Client, subcontractor, or contractor
es: Cliente, subcontratista o destajista

source: Estimate / Progress Payment
es: Estimación / Pago de Avance

source: Payment request for completed work
es: Solicitud de pago por trabajo completado

source: Concept / Line Item
es: Concepto / Partida

source: Individual work item in catalog
es: Partida individual de trabajo en catálogo

source: Retention / Withholding
es: Retención / Retención Fiscal

source: Financial withholding
es: Retención financiera

source: Site
es: Sitio

source: Construction site location
es: Ubicación de obra de construcción

source: See :doc:`_glossary/domain-terms` for **100+ complete translations**.
es: Consulte :doc:`_glossary/domain-terms` para **más de 100 traducciones completas**.

source: Repository & License
es: Repositorio y Licencia

source: **License:** GNU Affero General Public License v3 (AGPLv3)
es: **Licencia:** GNU Affero General Public License v3 (AGPLv3)

source: **Current Version:** 1.1.04
es: **Versión Actual:** 1.1.04

source: Get Help
es: Obtener Ayuda

source: **Installation Issues:** :doc:`developer/installation/index`
es: **Problemas de Instalación:** :doc:`developer/installation/index`

source: **Deployment Problems:** :doc:`developer/deployment/index`
es: **Problemas de Despliegue:** :doc:`developer/deployment/index`

source: **API Questions:** :doc:`developer/api/index`
es: **Preguntas de API:** :doc:`developer/api/index`

source: **Bug Reports:** https://github.com/javier-llamas/construbot/issues
es: **Reportar Errores:** https://github.com/javier-llamas/construbot/issues

source: Documentation Sections
es: Secciones de Documentación

source: Indices and Tables
es: Índices y Tablas
