Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/faq.po
Languages: es

source: FAQ
es: Preguntas frecuentes

source: What is Construbot?
es: ¿Qué es Construbot?

source: Construbot is an operational management solution for construction companies. It helps manage contracts, track progress payments (estimates), handle financial calculations, and generate professional documents.
es: Construbot es una solución de gestión operativa para empresas constructoras. Ayuda a gestionar contratos, realizar un seguimiento de los pagos progresivos (estimaciones), manejar cálculos financieros y generar documentos profesionales.

source: See :doc:`introduction` for a complete overview.
es: Consulte :doc:`introducción` para obtener una descripción completa.

source: Who should use Construbot?
es: ¿Quién debería utilizar Construbot?

source: Construbot is designed for:
es: Construbot está diseñado para:

source: **Project Managers** - Track project progress and billing
es: **Gerentes de proyectos**: realice un seguimiento del progreso y la facturación del proyecto

source: **Contract Administrators** - Manage contracts and documents
es: **Administradores de contratos** - Gestionar contratos y documentos

source: **Accounting Staff** - Handle financial tracking and payments
es: **Personal de contabilidad** - Manejar el seguimiento financiero y los pagos

source: **Site Supervisors** - Report completed work
es: **Supervisores del sitio** - Informar del trabajo completado

source: **Directors** - Overview of all projects and finances
es: **Directores** - Descripción general de todos los proyectos y finanzas

source: What does "Construbot" mean?
es: ¿Qué significa "Construbot"?

source: "Construbot" is a combination of "Construction" + "Robot" - an automated solution for construction operations.
es: "Construbot" es una combinación de "Construcción" + "Robot": una solución automatizada para operaciones de construcción.

source: Getting Started
es: Empezando

source: How do I log in for the first time?
es: ¿Cómo inicio sesión por primera vez?

source: Navigate to your Construbot URL
es: Navegue a su URL de Construbot

source: Enter your email and password (provided by administrator)
es: Ingrese su correo electrónico y contraseña (proporcionada por el administrador)

source: Click "Login"
es: Haga clic en "Iniciar sesión"

source: You'll be directed to the dashboard
es: Serás dirigido al panel de control.

source: If you don't have credentials, contact your system administrator.
es: Si no tiene credenciales, comuníquese con el administrador del sistema.

source: How do I change my password?
es: ¿Cómo cambio mi contraseña?

source: Click your username in the top-right
es: Haga clic en su nombre de usuario en la esquina superior derecha

source: Select "Profile" or "Change Password"
es: Seleccione "Perfil" o "Cambiar contraseña"

source: Enter current password
es: Ingrese la contraseña actual

source: Enter new password twice
es: Ingrese la nueva contraseña dos veces

source: Click "Save"
es: Haga clic en "Guardar"

source: Which company am I working in?
es: ¿En qué empresa estoy trabajando?

source: Your **active company** is shown in the top navigation bar. If you have access to multiple companies:
es: Su **empresa activa** se muestra en la barra de navegación superior. Si tiene acceso a varias empresas:

source: Click the company name dropdown
es: Haga clic en el menú desplegable del nombre de la empresa

source: Select the company you want to work in
es: Selecciona la empresa en la que quieres trabajar

source: All data will switch to that company
es: Todos los datos cambiarán a esa empresa.

source: Contracts & Projects
es: Contratos y Proyectos

source: What's the difference between a contract and a project?
es: ¿Cuál es la diferencia entre un contrato y un proyecto?

source: In Construbot, **"Contract" (Contrato)** and **"Project"** are the same thing. The term "Contract" is used because it represents the legal agreement, but it functions as a project management entity.
es: En Construbot, **"Contrato"** y **"Proyecto"** son lo mismo. El término "Contrato" se utiliza porque representa el acuerdo legal, pero funciona como una entidad de gestión de proyectos.

source: How do I create a new contract?
es: ¿Cómo creo un nuevo contrato?

source: See the complete workflow in :doc:`workflows/index` (Creating a New Project section).
es: Vea el flujo de trabajo completo en :doc:`workflows/index` (sección Creación de un nuevo proyecto).

source: **Quick steps:** 1. Create client counterparty 2. Create site 3. Create contract 4. Add concept catalog 5. Add contacts
es: **Pasos rápidos:** 1. Crear contraparte del cliente 2. Crear sitio 3. Crear contrato 4. Agregar catálogo de conceptos 5. Agregar contactos

source: Can I have subcontracts under a main contract?
es: ¿Puedo tener subcontratos bajo un contrato principal?

source: Yes! Construbot supports **hierarchical contracts**. When creating a subcontract, select the parent contract in the contract form.
es: ¡Sí! Construbot admite **contratos jerárquicos**. Al crear un subcontrato, seleccione el contrato principal en el formulario de contrato.

source: See :doc:`concepts/projects-contracts` (Hierarchical Contracts section).
es: Ver :doc:`concepts/projects-contracts` (sección Contratos Jerárquicos).

source: Why can't I delete a contract?
es: ¿Por qué no puedo eliminar un contrato?

source: Contracts with associated estimates cannot be deleted to preserve financial records. Instead:
es: Los contratos con estimaciones asociadas no se pueden eliminar para preservar los registros financieros. En cambio:

source: Mark the contract as inactive
es: Marcar el contrato como inactivo

source: Add a note explaining why it was closed
es: Añade una nota explicando por qué se cerró.

source: It will be hidden from active contract lists
es: Estará oculto de las listas de contratos activos.

source: Estimates & Billing
es: Estimaciones y facturación

source: What is an "Estimate" (Estimación)?
es: ¿Qué es una "Estimación"?

source: An **estimate** is a progress payment request for work completed during a specific period. It's similar to an invoice but specifically for construction progress billing.
es: Una **estimación** es una solicitud de pago por progreso del trabajo completado durante un período específico. Es similar a una factura pero específicamente para la facturación del progreso de la construcción.

source: See :doc:`concepts/estimates` for detailed information.
es: Consulte :doc:`conceptos/estimaciones` para obtener información detallada.

source: How do cumulative quantities work?
es: ¿Cómo funcionan las cantidades acumulativas?

source: Construbot automatically tracks:
es: Construbot rastrea automáticamente:

source: **Previous estimates**: Total from all prior estimates
es: **Estimaciones anteriores**: Total de todas las estimaciones anteriores

source: **This estimate**: New work completed
es: **Esta estimación**: Nuevo trabajo completado

source: **Cumulative total**: Running total to date
es: **Total acumulado**: Total acumulado hasta la fecha

source: **Remaining**: Contract quantity - Cumulative
es: **Restante**: Cantidad de contrato - Acumulado

source: This ensures you never over-bill a contract concept.
es: Esto garantiza que nunca sobrefacturarás un concepto de contrato.

source: What are retentions?
es: ¿Qué son las retenciones?

source: **Retentions** are percentages withheld from payments:
es: **Retenciones** son porcentajes retenidos de los pagos:

source: **Performance retention** (5-10%): Held until completion
es: **Retención del rendimiento** (5-10%): se mantiene hasta su finalización

source: **Warranty retention** (5%): Held during warranty period
es: **Retención de garantía** (5%): retenida durante el período de garantía

source: **Tax withholdings**: Government-required deductions
es: **Retenciones de impuestos**: Deducciones requeridas por el gobierno

source: See :doc:`concepts/retentions` for details.
es: Consulte :doc:`conceptos/retenciones` para obtener más detalles.

source: How do I fix an incorrect estimate?
es: ¿Cómo soluciono una estimación incorrecta?

source: **If still in draft:** - Edit the estimate directly - Update quantities as needed
es: **Si aún está en borrador:** - Edite la estimación directamente - Actualice las cantidades según sea necesario

source: **If already approved:** - Create a new estimate - Use negative quantities to reverse errors - Add corrected quantities - Document in notes
es: **Si ya está aprobado:** - Crear una nueva estimación - Usar cantidades negativas para revertir errores - Agregar cantidades corregidas - Documentar en notas

source: Can I delete an estimate?
es: ¿Puedo eliminar un presupuesto?

source: Estimates associated with payments cannot be deleted. Instead:
es: Las estimaciones asociadas con los pagos no se pueden eliminar. En cambio:

source: Create a correcting estimate (negative quantities)
es: Crear una estimación de corrección (cantidades negativas)

source: Or mark as void and create a new one
es: O marcar como nulo y crear uno nuevo.

source: Add notes explaining the correction
es: Agregar notas explicando la corrección.

source: Counterparties & Sites
es: Contrapartes y sitios

source: What is a "Counterparty" (Contraparte)?
es: ¿Qué es una "contraparte" (Contraparte)?

source: A **counterparty** is any business entity you work with:
es: Una **contraparte** es cualquier entidad comercial con la que trabaja:

source: **Cliente** (Client): Companies that hire you
es: **Cliente** (Cliente): Empresas que te contratan

source: **Subcontratista** (Subcontractor): Specialized contractors you hire
es: **Subcontratista** (Subcontratista): Contratistas especializados que contratas

source: **Destajista** (Piecework Contractor): Paid by completed units
es: **Destajista** (Contratista a destajo): Pagado por unidades terminadas

source: See :doc:`concepts/counterparties` for details.
es: Consulte :doc:`conceptos/contrapartes` para obtener más detalles.

source: Can I have multiple sites for one client?
es: ¿Puedo tener varios sitios para un cliente?

source: Yes! Create as many sites as needed for each client. Each contract is then associated with a specific site.
es: ¡Sí! Cree tantos sitios como necesite para cada cliente. Luego, cada contrato se asocia con un sitio específico.

source: **Example**: National retail chain with stores in multiple cities - create one client and multiple sites.
es: **Ejemplo**: Cadena minorista nacional con tiendas en varias ciudades: cree un cliente y varios sitios.

source: What are "Contacts" (Destinatarios)?
es: ¿Qué son los "Contactos" (Destinatarios)?

source: **Contacts** are individuals who receive documents for a specific contract:
es: **Contactos** son personas que reciben documentos para un contrato específico:

source: Project managers
es: Gerentes de proyecto

source: Accounts payable staff
es: Personal de cuentas por pagar

source: Site supervisors
es: Supervisores de sitio

source: They're contract-specific, so the same person can be a contact on multiple contracts.
es: Son específicos de cada contrato, por lo que la misma persona puede ser un contacto en varios contratos.

source: See :doc:`concepts/sites-contacts` for details.
es: Consulte :doc:`concepts/sites-contacts` para obtener más detalles.

source: Data Import/Export
es: Importación/exportación de datos

source: Can I import my existing project catalogs?
es: ¿Puedo importar mis catálogos de proyectos existentes?

source: Yes! Import concept catalogs from Excel:
es: ¡Sí! Importar catálogos de conceptos desde Excel:

source: Prepare Excel with: Code, Description, Unit, Quantity, Unit Price
es: Prepare Excel con: Código, Descripción, Unidad, Cantidad, Precio Unitario

source: In contract view, click "Import from Excel"
es: En la vista de contrato, haga clic en "Importar desde Excel"

source: Map columns
es: Columnas del mapa

source: Verify and import
es: Verificar e importar

source: See :doc:`concepts/concepts-line-items` (Method 2: Excel Import).
es: Consulte :doc:`concepts/concepts-line-items` (Método 2: Importación de Excel).

source: Can I export data to Excel?
es: ¿Puedo exportar datos a Excel?

source: Yes! Most views have an "Export" button that generates Excel spreadsheets:
es: ¡Sí! La mayoría de las vistas tienen un botón "Exportar" que genera hojas de cálculo de Excel:

source: Contract lists
es: Listas de contratos

source: Estimate data
es: Datos estimados

source: Financial reports
es: Informes financieros

source: Concept catalogs
es: Catálogos de conceptos

source: What format should my Excel file be?
es: ¿Qué formato debe tener mi archivo Excel?

source: **File type**: .xlsx or .xls
es: **Tipo de archivo**: .xlsx o .xls

source: **Required columns**: Depend on what you're importing (concepts, retentions, etc.)
es: **Columnas obligatorias**: dependen de lo que importes (conceptos, retenciones, etc.)

source: **No merged cells**: Keep it simple
es: **Sin celdas combinadas**: hazlo simple

source: **Header row**: First row should have column names
es: **Fila de encabezado**: la primera fila debe tener nombres de columnas

source: Troubleshooting
es: Solución de problemas

source: I can't see my contract in the list
es: No puedo ver mi contrato en la lista

source: Check:
es: Controlar:

source: **Active company**: Are you in the correct company?
es: **Empresa activa**: ¿Estás en la empresa correcta?

source: **Filters**: Any active filters limiting the list?
es: **Filtros**: ¿Algún filtro activo que limite la lista?

source: **Permissions**: Do you have access to view this contract?
es: **Permisos**: ¿Tiene acceso para ver este contrato?

source: **Status**: Is the contract marked as inactive?
es: **Estado**: ¿El contrato está marcado como inactivo?

source: Calculations seem wrong
es: Los cálculos parecen incorrectos

source: Verify:
es: Verificar:

source: **Unit prices**: Check concept unit prices are correct
es: **Precios unitarios**: Verifique que los precios unitarios del concepto sean correctos

source: **Quantities**: Ensure quantities are in correct units
es: **Cantidades**: asegúrese de que las cantidades estén en las unidades correctas

source: **Retentions**: Verify retention percentages
es: **Retenciones**: Verificar porcentajes de retención

source: **Previous estimates**: Check cumulative totals
es: **Estimaciones anteriores**: Verifique los totales acumulados

source: If still incorrect, check for: - Decimal place errors - Manual overrides - Data entry mistakes
es: Si aún es incorrecto, verifique: - Errores de decimales - Anulaciones manuales - Errores de entrada de datos

source: I can't generate a PDF
es: No puedo generar un PDF

source: Common causes:
es: Causas comunes:

source: **No line items**: Estimate must have at least one line item
es: **Sin partidas individuales**: la estimación debe tener al menos una partida individual

source: **Missing data**: Check all required fields are filled
es: **Faltan datos**: Verifique que todos los campos obligatorios estén completos

source: **Permissions**: Verify you have permission to generate PDFs
es: **Permisos**: Verifique que tenga permiso para generar archivos PDF

source: **Template issues**: Contact administrator if template is missing
es: **Problemas con la plantilla**: comuníquese con el administrador si falta la plantilla

source: Error messages in Spanish
es: Mensajes de error en español

source: The application interface uses Spanish terminology, but error messages should be clear. Common terms:
es: La interfaz de la aplicación utiliza terminología española, pero los mensajes de error deben ser claros. Términos comunes:

source: **"Contrato"** = Contract
es: **"Contrato"** = Contrato

source: **"Estimación"** = Estimate
es: **"Estimación"** = Estimación

source: **"Concepto"** = Concept/Line Item
es: **"Concepto"** = Concepto/Línea de pedido

source: **"Retención"** = Retention
es: **"Retención"** = Retención

source: See :doc:`/reference/glossary` for complete Spanish-English translations.
es: Consulte :doc:`/reference/glossary` para obtener traducciones completas español-inglés.

source: Permissions & Access
es: Permisos y acceso

source: What are the permission levels?
es: ¿Cuáles son los niveles de permiso?

source: Six levels from lowest to highest:
es: Seis niveles de menor a mayor:

source: **Auxiliar** (Assistant): Basic read access
es: **Auxiliar** (Asistente): Acceso de lectura básico

source: **Coordinador** (Coordinator): Create and edit projects
es: **Coordinador** (Coordinador): Crear y editar proyectos

source: **Director**: Approve estimates, full project access
es: **Director**: Aprobar estimaciones, acceso completo al proyecto

source: **Corporativo** (Corporate): Multi-company access
es: **Corporativo** (Corporate): Acceso multiempresa

source: **Soporte** (Support): System support functions
es: **Soporte** (Support): Funciones de soporte del sistema

source: **Superusuario** (Super User): Full system access
es: **Superusuario** (Super Usuario): Acceso completo al sistema

source: I don't have permission to do something
es: no tengo permiso para hacer algo

source: Contact your system administrator or company director to:
es: Póngase en contacto con el administrador de su sistema o director de la empresa para:

source: Request higher permission level
es: Solicitar un nivel de permiso más alto

source: Get access to specific companies
es: Obtenga acceso a empresas específicas

source: Request specific feature access
es: Solicitar acceso a funciones específicas

source: Technical Issues
es: Problemas técnicos

source: The page won't load
es: La pagina no carga

source: Try:
es: Intentar:

source: Refresh the page (F5 or Ctrl+R)
es: Actualizar la página (F5 o Ctrl+R)

source: Clear browser cache
es: Borrar caché del navegador

source: Try a different browser
es: Pruebe con un navegador diferente

source: Check internet connection
es: comprobar la conexión a internet

source: Contact IT support if problem persists
es: Póngase en contacto con el soporte de TI si el problema persiste

source: Data isn't saving
es: Los datos no se guardan

source: **Required fields**: All required fields filled?
es: **Campos obligatorios**: ¿Todos los campos obligatorios están completos?

source: **Validation errors**: Any error messages shown?
es: **Errores de validación**: ¿Se muestra algún mensaje de error?

source: **Permissions**: Do you have save permission?
es: **Permisos**: ¿Tiene permiso para guardar?

source: **Browser console**: Press F12 and check for JavaScript errors
es: **Consola del navegador**: presione F12 y verifique si hay errores de JavaScript

source: Getting Help
es: Obtener ayuda

source: Where can I find more documentation?
es: ¿Dónde puedo encontrar más documentación?

source: **User Guide**: :doc:`index` (this section)
es: **Guía del usuario**: :doc:`index` (esta sección)

source: **Developer Docs**: :doc:`/developer/index`
es: **Documentos del desarrollador**: :doc:`/developer/index`

source: **Contributor Guide**: :doc:`/contributor/index`
es: **Guía para contribuyentes**: :doc:`/contributor/index`

source: **Glossary**: :doc:`/reference/glossary`
es: **Glosario**: :doc:`/referencia/glosario`

source: How do I report a bug?
es: ¿Cómo informo un error?

source: See :doc:`/contributor/issue-reporting` for bug reporting guidelines.
es: Consulte :doc:`/contributor/issue-reporting` para conocer las pautas para informar errores.

source: Include: - Steps to reproduce - Expected vs actual behavior - Screenshots if relevant - Your permission level and company
es: Incluye: - Pasos para reproducir - Comportamiento esperado versus real - Capturas de pantalla si son relevantes - Su nivel de permiso y empresa

source: How do I request a feature?
es: ¿Cómo solicito una función?

source: Open an issue on GitHub with:
es: Abra una incidencia en GitHub con:

source: Clear description of the feature
es: Descripción clara de la característica.

source: Use case / business need
es: Caso de uso/necesidad empresarial

source: How it would benefit users
es: Cómo beneficiaría a los usuarios

source: Who do I contact for support?
es: ¿Con quién me comunico para obtener soporte?

source: **Technical issues**: Your IT administrator
es: **Problemas técnicos**: Su administrador de TI

source: **Account/Access**: Your company director
es: **Cuenta/Acceso**: El director de su empresa

source: **Bug reports**: GitHub issues
es: **Informes de errores**: problemas de GitHub

source: **Feature requests**: GitHub discussions
es: **Solicitudes de funciones**: debates sobre GitHub

source: Still Have Questions?
es: ¿Aún tienes preguntas?

source: Check other documentation sections: :doc:`concepts/index`, :doc:`workflows/index`, :doc:`features/index`
es: Consulte otras secciones de documentación: :doc:`concepts/index`, :doc:`workflows/index`, :doc:`features/index`

source: Review the :doc:`/reference/glossary` for terminology
es: Revise el :doc:`/reference/glossary` para conocer la terminología

source: Contact your system administrator
es: Póngase en contacto con el administrador de su sistema

source: Open a discussion on GitHub
es: Abrir una discusión en GitHub

source: **Can't find your answer?** The search function (top-right) searches all documentation. Try searching for key terms in English or Spanish.
es: **¿No encuentras tu respuesta?** La función de búsqueda (arriba a la derecha) busca en toda la documentación. Intente buscar términos clave en inglés o español.
