Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/getting-started.po
Languages: es

source: Getting Started
es: Empezando

source: This guide will help you get started with Construbot, from your first login to creating your first project.
es: Esta guía lo ayudará a comenzar con Construbot, desde su primer inicio de sesión hasta la creación de su primer proyecto.

source: First Login
es: Primer inicio de sesión

source: **Navigate** to your Construbot instance URL
es: **Navegue** a la URL de su instancia de Construbot

source: **Click** "Login" or navigate to ``/accounts/login``
es: **Haga clic** en "Iniciar sesión" o navegue hasta ``/accounts/login``

source: **Enter** your email and password
es: **Ingresa** tu correo electrónico y contraseña

source: **Click** "Sign In"
es: **Haga clic** en "Iniciar sesión"

source: Construbot uses **email-based authentication**. Your username is your email address.
es: Construbot utiliza **autenticación basada en correo electrónico**. Su nombre de usuario es su dirección de correo electrónico.

source: The Dashboard
es: El tablero

source: After login, you'll see the **Project Dashboard** (``/proyectos/``):
es: Después de iniciar sesión, verá el **Panel de proyectos** (``/proyectos/``):

source: Construbot Dashboard
es: Panel de control de Construbot

source: *(Image placeholder - screenshot of main dashboard)*
es: *(Marcador de posición de imagen: captura de pantalla del panel principal)*

source: Dashboard Sections
es: Secciones del tablero

source: **Active Contracts**
es: **Contratos activos**

source: Lists all ongoing projects (Contratos) with progress percentages and financial summaries.
es: Enumera todos los proyectos en curso (Contratos) con porcentajes de avance y resúmenes financieros.

source: **Pending Invoicing**
es: **Pendiente de facturación**

source: Estimates (Estimaciones) that have been completed but not yet invoiced.
es: Estimaciones que han sido completadas pero aún no facturadas.

source: **Pending Payment**
es: **Pendiente de pago**

source: Estimates that have been invoiced but payment hasn't been received.
es: Presupuestos que han sido facturados pero no se ha recibido el pago.

source: **Quick Stats**
es: **Estadísticas rápidas**

source: Total amounts for unbilled and unpaid estimates.
es: Montos totales de estimaciones no facturadas y no pagadas.

source: Navigation Menu
es: Menú de navegación

source: The main navigation provides access to:
es: La navegación principal proporciona acceso a:

source: Contracts (Contratos)
es: Contratos

source: **List Contracts** - View all projects
es: **Listar contratos** - Ver todos los proyectos

source: **Create Contract** - Start a new project
es: **Crear contrato** - Iniciar un nuevo proyecto

source: **Create Sub-Contract** - Add child contract under existing project
es: **Crear subcontrato**: agregar contrato secundario al proyecto existente

source: Business Partners (Contrapartes)
es: Socios comerciales (contrapartes)

source: **Clients** (Clientes) - Customers paying for work
es: **Clientes** (Clientes) - Clientes que pagan por trabajo

source: **Subcontractors** (Subcontratistas) - Specialized contractors
es: **Subcontratistas** (Subcontratistas) - Contratistas especializados

source: **Piecework Contractors** (Destajistas) - Task-based workers
es: **Contratistas a destajo** (Destajistas) - Trabajadores por tareas

source: Locations & Contacts
es: Ubicaciones y contactos

source: **Sites** (Sitios) - Construction locations
es: **Sitios** (Sitios) - Lugares de construcción

source: **Contacts** (Destinatarios) - People at partner organizations
es: **Contactos** (Destinatarios) - Personas de organizaciones colaboradoras

source: **Units** (Unidades) - Measurement units (m², kg, pza, etc.)
es: **Unidades** (Unidades) - Unidades de medida (m², kg, pza, etc.)

source: Your First Project
es: Tu primer proyecto

source: Let's create your first contract step-by-step.
es: Creemos tu primer contrato paso a paso.

source: Step 1: Create a Client
es: Paso 1: crear un cliente

source: Before creating a contract, you need a client (Cliente):
es: Antes de crear un contrato, necesita un cliente (Cliente):

source: Navigate to **Clients** menu
es: Navegue al menú **Clientes**

source: Click **"Create New Client"** (Nuevo Cliente)
es: Haga clic en **"Crear nuevo cliente"** (Nuevo Cliente)

source: Fill in the form:
es: Rellena el formulario:

source: **Client Name** (Nombre del cliente): Company or individual name
es: **Nombre del cliente** (Nombre del cliente): Nombre de la empresa o individuo

source: **Type** (Tipo): Select "CLIENTE"
es: **Tipo** (Tipo): Seleccione "CLIENTE"

source: Click **"Save"**
es: Haga clic en **"Guardar"**

source: **Example:**
es: **Ejemplo:**

source: Name: "ABC Development Corporation"
es: Nombre: "Corporación de Desarrollo ABC"

source: Type: CLIENTE
es: Tipo: CLIENTE

source: Step 2: Create a Site
es: Paso 2: crear un sitio

source: Add the construction location:
es: Agregue la ubicación de construcción:

source: Navigate to **Sites** menu (Sitios/Ubicaciones)
es: Navegue al menú **Sitios** (Sitios/Ubicaciones)

source: Click **"Create New Site"** (Nuevo Sitio)
es: Haga clic en **"Crear nuevo sitio"** (Nuevo sitio)

source: Fill in:
es: Llenar:

source: **Site Name** (Nombre del sitio): Project location name
es: **Site Name** (Nombre del sitio): Nombre de la ubicación del proyecto

source: **Location** (Ubicación): Physical address or description
es: **Ubicación** (Ubicación): Dirección física o descripción

source: **Client** (Cliente): Select the client you just created
es: **Cliente** (Cliente): Selecciona el cliente que acabas de crear

source: Name: "Downtown Office Tower"
es: Nombre: "Torre de Oficinas del Centro"

source: Location: "123 Main Street, Mexico City"
es: Ubicación: "Calle Principal 123, Ciudad de México"

source: Client: ABC Development Corporation
es: Cliente: Corporación de Desarrollo ABC

source: Step 3: Create the Contract
es: Paso 3: crear el contrato

source: Now create the main contract:
es: Ahora crea el contrato principal:

source: Navigate to **Contracts** menu
es: Vaya al menú **Contratos**

source: Click **"Create New Contract"** (Nuevo Contrato)
es: Haga clic en **"Crear nuevo contrato"** (Nuevo Contrato)

source: **Basic Information:**
es: **Información básica:**

source: **Reference Number** (Folio): Sequential ID (e.g., 1)
es: **Número de referencia** (Folio): ID secuencial (p. ej., 1)

source: **Contract Code** (Código): Your internal code (e.g., "CONT-2024-001")
es: **Código de contrato** (Código): Su código interno (p. ej., "CONT-2024-001")

source: **Contract Date** (Fecha): Signing date
es: **Fecha de Contrato** (Fecha): Fecha de firma

source: **Contract Name** (Nombre del contrato): Full project name
es: **Nombre del contrato** (Nombre del contrato): Nombre completo del proyecto

source: **Short Name** (Nombre corto): Abbreviated name for listings
es: **Short Name** (Nombre corto): Nombre abreviado para listados

source: **Relationships:**
es: **Relaciones:**

source: **Counterparty** (Contraparte): Select your client
es: **Counterparty** (Contraparte): Selecciona tu cliente

source: **Site** (Sitio): Select the construction site
es: **Sitio** (Sitio): Seleccione el sitio de construcción

source: **Financial:**
es: **Financiero:**

source: **Amount** (Monto): Total contract value (without VAT)
es: **Importe** (Monto): Valor total del contrato (sin IVA)

source: **Advance %** (Anticipo): Down payment percentage (0-100)
es: **Advance %** (Anticipo): Porcentaje de pago inicial (0-100)

source: **Users:**
es: **Usuarios:**

source: **Assigned Users** (Usuarios): Select team members
es: **Usuarios asignados** (Usuarios): Seleccionar miembros del equipo

source: **Status:**
es: **Estado:**

source: **Ongoing** (Status): Check if project is active
es: **En curso** (Estado): compruebe si el proyecto está activo

source: Code: CONT-2024-001
es: Código: CONT-2024-001

source: Name: "Downtown Office Tower - Phase 1"
es: Nombre: “Torre de Oficinas del Centro – Fase 1”

source: Short Name: "Office Tower P1"
es: Nombre corto: "Torre de oficinas P1"

source: Counterparty: ABC Development Corporation
es: Contraparte: Corporación de Desarrollo ABC

source: Site: Downtown Office Tower
es: Sitio: Torre de oficinas del centro

source: Amount: 1,000,000.00
es: Monto: 1.000.000,00

source: Advance: 10% (10.00)
es: Anticipo: 10% (10.00)

source: Step 4: Add Work Items (Concepts)
es: Paso 4: Agregar elementos de trabajo (conceptos)

source: Add the catalog of work items to your contract:
es: Añade el catálogo de elementos de trabajo a tu contrato:

source: Navigate to your **Contract Detail** page
es: Navegue a su página **Detalles del contrato**

source: Click **"Concept Catalog"** tab
es: Haga clic en la pestaña **"Catálogo de conceptos"**

source: **Option A - Manual Entry:**
es: **Opción A - Entrada manual:**

source: Click **"Add Concept"**
es: Haga clic en **"Agregar concepto"**

source: **Code**: Item code (e.g., "CONC-001")
es: **Código**: código de artículo (p. ej., "CONC-001")

source: **Description** (Concepto): Work description
es: **Descripción** (Concepto): Descripción del trabajo

source: **Unit** (Unidad): Select measurement unit (m², kg, pza)
es: **Unidad** (Unidad): Seleccione unidad de medida (m², kg, pza)

source: **Quantity** (Cantidad): Total contracted quantity
es: **Cantidad** (Cantidad): Cantidad total contratada

source: **Unit Price** (Precio Unitario): Price per unit
es: **Precio Unitario** (Precio Unitario): Precio por unidad

source: **Option B - Excel Import:**
es: **Opción B - Importación de Excel:**

source: Prepare Excel file with columns: Code, Description, Unit, Quantity, Unit Price
es: Prepare un archivo Excel con columnas: Código, Descripción, Unidad, Cantidad, Precio unitario

source: Click **"Import from Excel"**
es: Haga clic en **"Importar desde Excel"**

source: Upload file
es: Subir archivo

source: Review and confirm import
es: Revisar y confirmar la importación

source: **Example Concepts:**
es: **Conceptos de ejemplo:**

source: Code
es: Código

source: Description
es: Descripción

source: Unit
es: Unidad

source: Quantity
es: Cantidad

source: Unit Price
es: Precio unitario

source: Concrete Foundation
es: Cimentación de hormigón

source: Steel Framing
es: Estructura de acero

source: ton
es: tonelada

source: Electrical Installation
es: Instalación Eléctrica

source: m
es: metro

source: Step 5: Create Your First Estimate
es: Paso 5: cree su primer presupuesto

source: Track work progress with an estimate:
es: Realice un seguimiento del progreso del trabajo con una estimación:

source: From **Contract Detail**, click **"Create Estimate"**
es: Desde **Detalle del contrato**, haga clic en **"Crear presupuesto"**

source: Fill in the estimate form:
es: Rellene el formulario de presupuesto:

source: **Estimate Number** (Consecutivo): Sequential number (e.g., 1)
es: **Número de estimación** (Consecutivo): Número secuencial (p. ej., 1)

source: **Start Date** (Fecha de inicio): Period start
es: **Fecha de Inicio** (Fecha de inicio): Inicio del periodo

source: **End Date** (Fecha de finalización): Period end
es: **Fecha de finalización** (Fecha de finalización): Fin del período

source: **Supervised By** (Supervisado por): Site supervisor
es: **Supervisado por** (Supervisado por): Supervisor de sitio

source: **Authorized By** (Autorizado por): Client representative(s)
es: **Autorizado por** (Autorizado por): Representante(s) del cliente

source: **Add Quantities:**
es: **Agregar cantidades:**

source: For each concept, enter:
es: Para cada concepto, ingrese:

source: **Quantity Estimated** (Cantidad estimada): Work completed this period
es: **Cantidad Estimada** (Cantidad estimada): Obra finalizada este periodo

source: **Observations** (Observaciones): Optional notes
es: **Observaciones** (Observaciones): Notas opcionales

source: Estimate #: 1
es: Estimación #: 1

source: Period: March 1-31, 2024
es: Período: 1 al 31 de marzo de 2024

source: Supervised By: John Doe
es: Supervisado por: John Doe

source: Quantities:
es: Cantidades:

source: CONC-001: 100 m³ completed
es: CONC-001: 100 m³ completados

source: CONC-002: 5 ton installed
es: CONC-002: 5 toneladas instaladas

source: The system automatically calculates:
es: El sistema calcula automáticamente:

source: Subtotals per concept
es: Subtotales por concepto

source: Accumulated totals across estimates
es: Totales acumulados entre estimaciones

source: Advance amortization
es: Amortización anticipada

source: Retention deductions
es: Deducciones de retención

source: Final payment amount
es: Monto del pago final

source: Step 6: Generate PDF
es: Paso 6: Generar PDF

source: Create a professional estimate document:
es: Cree un documento de estimación profesional:

source: From **Estimate Detail**, click **"Generate PDF"**
es: Desde **Detalle del presupuesto**, haga clic en **"Generar PDF"**

source: Review the document
es: Revisar el documento

source: **Download** or **Print** as needed
es: **Descargar** o **Imprimir** según sea necesario

source: Send to client for approval
es: Enviar al cliente para su aprobación

source: Common Tasks
es: Tareas comunes

source: Switching Companies
es: Cambio de empresas

source: If you work for multiple companies:
es: Si trabaja para varias empresas:

source: Click your **username** in top navigation
es: Haga clic en su **nombre de usuario** en la navegación superior

source: Select **"Switch Company"**
es: Seleccione **"Cambiar de empresa"**

source: Choose the company you want to work in
es: Elige la empresa en la que quieres trabajar

source: All data will now be filtered to that company
es: Todos los datos ahora se filtrarán a esa empresa.

source: Marking Estimates as Invoiced
es: Marcar estimaciones como facturadas

source: After sending invoice to client:
es: Después de enviar la factura al cliente:

source: Open the **Estimate Detail**
es: Abra el **Detalle del presupuesto**

source: Check **"Invoiced"** (Facturada) checkbox
es: Marque la casilla **"Facturada"** (Facturada)

source: Marking Estimates as Paid
es: Marcar estimaciones como pagadas

source: After receiving payment:
es: Después de recibir el pago:

source: Check **"Paid"** (Pagada) checkbox
es: Marque la casilla **"Pagado"** (Pagada)

source: Enter **"Payment Date"** (Fecha de pago)
es: Ingrese **"Fecha de Pago"** (Fecha de pago)

source: The estimate will be removed from "Pending Payment" on your dashboard.
es: El presupuesto se eliminará de "Pago pendiente" en su panel de control.

source: Viewing Reports
es: Ver informes

source: **Sub-Contract Reports:**
es: **Informes de subcontratos:**

source: For hierarchical contracts with sub-contracts:
es: Para contratos jerárquicos con subcontratos:

source: Navigate to **Contract Detail** (parent contract)
es: Vaya a **Detalle del contrato** (contrato principal)

source: Click **"Sub-Contract Report"**
es: Haga clic en **"Informe de subcontrato"**

source: View accumulated totals across all child contracts
es: Ver los totales acumulados en todos los contratos secundarios

source: **Dashboard Summaries:**
es: **Resúmenes del panel:**

source: The dashboard automatically shows:
es: El panel muestra automáticamente:

source: Active contracts with progress %
es: Contratos activos con avance %

source: Financial totals (billed, unbilled, paid, unpaid)
es: Totales financieros (facturados, no facturados, pagados, no pagados)

source: Contracts needing attention
es: Contratos que necesitan atención

source: Next Steps
es: Próximos pasos

source: Now that you understand the basics:
es: Ahora que comprende los conceptos básicos:

source: **Learn Core Concepts**: :doc:`concepts/index`
es: **Aprenda conceptos básicos**: :doc:`concepts/index`

source: **Master Workflows**: :doc:`workflows/index`
es: **Flujos de trabajo maestros**: :doc:`workflows/index`

source: **Explore Features**: :doc:`features/index`
es: **Explorar características**: :doc:`features/index`

source: **Need the Spanish term for something?** Check the :doc:`/reference/glossary` for complete Spanish-English translations.
es: **¿Necesitas el término en español para algo?** Consulta :doc:`/reference/glossary` para obtener traducciones completas español-inglés.

source: Troubleshooting
es: Solución de problemas

source: Can't See a Contract?
es: ¿No puedes ver un contrato?

source: Make sure:
es: Cerciorarse:

source: You're in the correct **company** (use Switch Company)
es: Estás en la **empresa** correcta (usa Cambiar de empresa)

source: You're **assigned** to the contract (check with Director/Superuser)
es: Estás **asignado** al contrato (consulta con el Director/Superusuario)

source: Your **permission level** allows access
es: Su **nivel de permiso** permite el acceso

source: Can't Create Estimates?
es: ¿No puedes crear estimaciones?

source: Verify:
es: Verificar:

source: Contract has **concepts** (work items) defined
es: El contrato tiene **conceptos** (elementos de trabajo) definidos

source: You have at least **Coordinador** (Level 2) permissions
es: Tienes al menos permisos de **Coordinador** (Nivel 2)

source: Contract **status** is active (ongoing)
es: El contrato **estado** está activo (en curso)

source: Where Are My Retentions?
es: ¿Dónde están mis retenciones?

source: Retentions (Retenciones) are configured at the **contract level**:
es: Las retenciones se configuran a nivel de contrato**:

source: Open **Contract Detail**
es: Abrir **Detalle del contrato**

source: Click **"Retentions"** tab
es: Haga clic en la pestaña **"Retenciones"**

source: Add retention rules (percentage or fixed amount)
es: Agregar reglas de retención (porcentaje o cantidad fija)

source: Retentions will be automatically applied to estimates
es: Las retenciones se aplicarán automáticamente a las estimaciones.
