Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/user-guide/index.po
Languages: es

source: User Guide
es: Guía del Usuario

source: Welcome to the Construbot User Guide! This section is designed for construction company staff who use Construbot to manage projects, track estimates, and handle contract administration.
es: ¡Bienvenido a la Guía del Usuario de Construbot! Esta sección está diseñada para el personal de empresas constructoras que usa Construbot para gestionar proyectos, dar seguimiento a estimaciones y administrar contratos.

source: **New to Construbot?** Start with :doc:`getting-started` to learn the basics.
es: **¿Nuevo en Construbot?** Comience con :doc:`getting-started` para aprender lo básico.

source: What is Construbot?
es: ¿Qué es Construbot?

source: Construbot is an operational management solution for construction companies. It helps you:
es: Construbot es una solución de gestión operativa para empresas constructoras. Le ayuda a:

source: **Manage Contracts** - Track construction projects from start to finish
es: **Gestionar Contratos** - Dar seguimiento a proyectos de construcción de inicio a fin

source: **Monitor Progress** - Create and manage progress estimates (estimaciones)
es: **Monitorear Avances** - Crear y gestionar estimaciones de avance

source: **Financial Tracking** - Calculate payments, retentions, and advance amortization
es: **Seguimiento Financiero** - Calcular pagos, retenciones y amortización de anticipos

source: **Multi-Company Support** - Work across multiple business entities
es: **Soporte Multi-Empresa** - Trabajar con múltiples entidades de negocio

source: **Document Generation** - Generate professional PDF estimates and reports
es: **Generación de Documentos** - Generar estimaciones y reportes profesionales en PDF

source: Who Should Use This Guide?
es: ¿Quién Debe Usar Esta Guía?

source: This guide is for:
es: Esta guía es para:

source: Project Managers
es: Gerentes de Proyecto

source: Site Supervisors
es: Supervisores de Obra

source: Contract Administrators
es: Administradores de Contratos

source: Accounting Staff
es: Personal de Contabilidad

source: Directors and Coordinators
es: Directores y Coordinadores

source: Quick Navigation
es: Navegación Rápida

source: Table of Contents
es: Tabla de Contenidos

source: Need Help?
es: ¿Necesita Ayuda?

source: **FAQ**: Check our :doc:`faq` for common questions
es: **FAQ**: Consulte nuestro :doc:`faq` para preguntas comunes

source: **Developer Docs**: For technical information, see :doc:`/developer/index`
es: **Docs de Desarrollador**: Para información técnica, vea :doc:`/developer/index`

source: **Report Issues**: Found a bug? See :doc:`/contributor/issue-reporting`
es: **Reportar Problemas**: ¿Encontró un error? Vea :doc:`/contributor/issue-reporting`

source: **Language Note**: While Construbot's interface uses Spanish terminology, this documentation provides English translations for all terms. See our :doc:`/reference/glossary` for a complete Spanish-English glossary.
es: **Nota de Idioma**: Aunque la interfaz de Construbot usa terminología en español, esta documentación proporciona traducciones al inglés para todos los términos. Vea nuestro :doc:`/reference/glossary` para un glosario completo Español-Inglés.
