Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/installation/configuration.po
Languages: es

source: Configuration
es: Configuración

source: Complete guide to configuring Construbot using environment variables and settings files.
es: Guía completa para configurar Construbot utilizando variables de entorno y archivos de configuración.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot uses a layered configuration approach:
es: Construbot utiliza un enfoque de configuración en capas:

source: **Settings files** - Python modules in ``construbot/config/settings/``
es: **Archivos de configuración** - Módulos de Python en ``construbot/config/settings/``

source: **Environment variables** - Loaded from ``.env`` file or system environment
es: **Variables de entorno** - Cargadas desde el archivo ``.env`` o el entorno del sistema

source: **Runtime configuration** - Django settings controlled by environment
es: **Configuración en tiempo de ejecución**: configuración de Django controlada por el entorno

source: This follows the `Twelve-Factor App <https://12factor.net/config>`_ methodology for configuration management.
es: Esto sigue la metodología `Twelve-Factor App <https://12factor.net/config>`_ para la gestión de la configuración.

source: Settings Structure
es: Estructura de configuración

source: Settings Files
es: Archivos de configuración

source: Located in ``construbot/config/settings/``:
es: Ubicado en ``construbot/config/settings/``:

source: **Selection:**
es: **Selección:**

source: The active settings module is controlled by ``DJANGO_SETTINGS_MODULE``:
es: El módulo de configuración activo está controlado por ``DJANGO_SETTINGS_MODULE``:

source: **Inheritance:**
es: **Herencia:**

source: All environment-specific files inherit from ``base.py``:
es: Todos los archivos específicos del entorno heredan de ``base.py``:

source: Environment Variables
es: Variables de entorno

source: Loading Variables
es: Cargando variables

source: **From .env file (recommended for development):**
es: **Desde el archivo .env (recomendado para desarrollo):**

source: Create ``.env`` in project root:
es: Cree ``.env`` en la raíz del proyecto:

source: **From system environment:**
es: **Desde el entorno del sistema:**

source: **In Docker Compose:**
es: **En Docker Compose:**

source: Required Variables
es: Variables requeridas

source: Core Configuration
es: Configuración central

source: **Values:**
es: **Valores:**

source: ``construbot.config.settings.local`` - Development
es: ``construbot.config.settings.local`` - Desarrollo

source: ``construbot.config.settings.test`` - Testing
es: ``construbot.config.settings.test`` - Pruebas

source: ``construbot.config.settings.production`` - Production
es: ``construbot.config.settings.production`` - Producción

source: **Generate:**
es: **Generar:**

source: **Never commit SECRET_KEY to version control!** Use different keys for development and production.
es: **¡Nunca envíe SECRET_KEY al control de versiones!** Utilice claves diferentes para el desarrollo y la producción.

source: **Always set DEBUG=False in production!** Debug mode exposes sensitive information.
es: **¡Establezca siempre DEBUG=False en producción!** El modo de depuración expone información confidencial.

source: Database Configuration
es: Configuración de base de datos

source: **Format:** ``postgresql://[user]:[password]@[host]:[port]/[database]``
es: **Formato:** ``postgresql://[usuario]:[contraseña]@[host]:[puerto]/[base de datos]``

source: Construbot uses ``django-environ`` to parse ``DATABASE_URL`` into Django's ``DATABASES`` setting.
es: Construbot usa ``django-environ`` para analizar ``DATABASE_URL`` en la configuración ``DATABASES`` de Django.

source: Cache and Queue
es: Caché y cola

source: **Used for:**
es: **Utilizado para:**

source: Django cache backend
es: back-end de caché de Django

source: Celery message broker
es: Corredor de mensajes de apio

source: Celery result backend
es: Backend del resultado del apio

source: Session storage (optional)
es: Almacenamiento de sesiones (opcional)

source: Optional Variables
es: Variables opcionales

source: Email Configuration
es: Configuración de correo electrónico

source: **Development (Console Backend):**
es: **Desarrollo (backend de consola):**

source: Emails are printed to console instead of sent.
es: Los correos electrónicos se imprimen en la consola en lugar de enviarse.

source: **Production (SMTP):**
es: **Producción (SMTP):**

source: **Using django-anymail (Recommended):**
es: **Usando django-anymail (recomendado):**

source: **Default from email:**
es: **Predeterminado desde el correo electrónico:**

source: Static and Media Files
es: Archivos estáticos y multimedia

source: **Development (default):**
es: **Desarrollo (predeterminado):**

source: **Production (S3):**
es: **Producción (T3):**

source: **Static files (WhiteNoise):**
es: **Archivos estáticos (WhiteNoise):**

source: No configuration needed. WhiteNoise is enabled by default in production settings.
es: No se necesita configuración. WhiteNoise está habilitado de forma predeterminada en la configuración de producción.

source: Allowed Hosts
es: Anfitriones permitidos

source: **Required in production!** Django will refuse connections from hosts not in this list.
es: **¡Requerido en producción!** Django rechazará conexiones de hosts que no estén en esta lista.

source: CORS Configuration
es: Configuración CORS

source: **Never use CORS_ALLOW_ALL_ORIGINS in production!** Only allow trusted origins.
es: **¡Nunca uses CORS_ALLOW_ALL_ORIGINS en producción!** Solo permite orígenes confiables.

source: Docker Configuration
es: Configuración de la ventana acoplable

source: This affects:
es: Esto afecta:

source: Database host (``postgres`` vs ``localhost``)
es: Host de base de datos (``postgres`` vs ``localhost``)

source: Redis host (``redis`` vs ``localhost``)
es: Anfitrión de Redis (``redis`` frente a ``localhost``)

source: Email host (``mailhog`` vs localhost SMTP)
es: Host de correo electrónico (``mailhog`` vs localhost SMTP)

source: Library Mode
es: Modo biblioteca

source: When ``True``:
es: Cuando es "Verdadero":

source: Disables admin interface
es: Deshabilita la interfaz de administración

source: Disables account management URLs
es: Deshabilita las URL de administración de cuentas

source: Disables standalone authentication
es: Deshabilita la autenticación independiente

source: Use Construbot as Django app in your project
es: Utilice Construbot como aplicación Django en su proyecto

source: See :doc:`../library-mode` for details.
es: Consulte :doc:`../library-mode` para obtener más detalles.

source: Sentry Integration
es: Integración centinela

source: Logging
es: Explotación florestal

source: **Values:** DEBUG, INFO, WARNING, ERROR, CRITICAL
es: **Valores:** DEPURACIÓN, INFORMACIÓN, ADVERTENCIA, ERROR, CRÍTICO

source: Celery Configuration
es: Configuración de apio

source: **CELERY_BROKER_URL**
es: **APIO_BROKER_URL**

source: Usually same as ``REDIS_URL``.
es: Generalmente igual que ``REDIS_URL``.

source: **CELERY_RESULT_BACKEND**
es: **Apio_RESULT_BACKEND**

source: **CELERY_TASK_ALWAYS_EAGER**
es: **APIO_TASK_ALWAYS_EAGER**

source: Configuration by Environment
es: Configuración por entorno

source: Development (.env)
es: Desarrollo (.env)

source: Complete ``.env`` file for local development:
es: Archivo ``.env`` completo para desarrollo local:

source: Testing
es: Pruebas

source: Environment for running tests:
es: Entorno para ejecutar pruebas:

source: Production
es: Producción

source: Production environment variables:
es: Variables del entorno de producción:

source: Security Settings
es: Configuración de seguridad

source: Production Security Checklist
es: Lista de verificación de seguridad de producción

source: **Run security check:**
es: **Ejecutar control de seguridad:**

source: Managing Configuration
es: Gestión de la configuración

source: Environment File Template
es: Plantilla de archivo de entorno

source: Create ``.env.example`` as a template:
es: Cree ``.env.example`` como plantilla:

source: **Benefits:**
es: **Beneficios:**

source: Documents required variables
es: Documentos variables requeridas

source: Provides examples for developers
es: Proporciona ejemplos para desarrolladores.

source: Safe to commit (no secrets)
es: Seguro para cometer (sin secretos)

source: Secrets Management
es: Gestión de secretos

source: **Development:**
es: **Desarrollo:**

source: Use ``.env`` file (git-ignored)
es: Utilice el archivo ``.env`` (git-ignorado)

source: Share ``.env.example`` template
es: Compartir plantilla ``.env.example``

source: **Production:**
es: **Producción:**

source: Use environment variables (not .env file)
es: Utilice variables de entorno (no archivos .env)

source: Store secrets in secure vault (AWS Secrets Manager, HashiCorp Vault)
es: Almacenar secretos en una bóveda segura (AWS Secrets Manager, HashiCorp Vault)

source: Inject secrets at runtime
es: Inyectar secretos en tiempo de ejecución

source: **Example with AWS Secrets Manager:**
es: **Ejemplo con AWS Secrets Manager:**

source: Validating Configuration
es: Validación de configuración

source: **Check required variables:**
es: **Verifique las variables requeridas:**

source: **Test email configuration:**
es: **Configuración de correo electrónico de prueba:**

source: Troubleshooting
es: Solución de problemas

source: Common Issues
es: Problemas comunes

source: **"ImproperlyConfigured: Set the DATABASE_URL environment variable"**
es: **"Configurado incorrectamente: establezca la variable de entorno DATABASE_URL"**

source: **"SECRET_KEY is required"**
es: **"Se requiere SECRET_KEY"**

source: **"CommandError: You must set settings.ALLOWED_HOSTS"**
es: **"CommandError: debes establecer la configuración.ALLOWED_HOSTS"**

source: **"DisallowedHost at /"**
es: **"Host no permitido en /"**

source: **Variables not loading from .env**
es: **Las variables no se cargan desde .env**

source: Variable Precedence
es: Prioridad de variables

source: If a variable is set in multiple places, this is the priority order:
es: Si una variable se establece en varios lugares, este es el orden de prioridad:

source: **System environment variables** (highest priority)
es: **Variables de entorno del sistema** (prioridad más alta)

source: **.env file**
es: **archivo .env**

source: **Settings file defaults** (lowest priority)
es: **Valores predeterminados del archivo de configuración** (prioridad más baja)

source: Example:
es: Ejemplo:

source: See Also
es: Ver también

source: `Django Settings Best Practices <https://docs.djangoproject.com/en/3.2/topics/settings/>`_
es: `Mejores prácticas de configuración de Django <https://docs.djangoproject.com/en/3.2/topics/settings/>`_

source: `Twelve-Factor App Config <https://12factor.net/config>`_
es: `Configuración de aplicación de doce factores <https://12factor.net/config>`_
