Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/installation/docker-setup.po
Languages: es

source: Docker Setup
es: Configuración de la ventana acoplable

source: Complete guide to setting up Construbot with Docker for local development.
es: Guía completa para configurar Construbot con Docker para el desarrollo local.

source: Table of Contents
es: Tabla de contenido

source: **Recommended Method:** Docker provides the easiest and most consistent development environment across all platforms.
es: **Método recomendado:** Docker proporciona el entorno de desarrollo más sencillo y consistente en todas las plataformas.

source: Overview
es: Descripción general

source: The Docker development environment includes:
es: El entorno de desarrollo Docker incluye:

source: **Django:** Web application (port 8000)
es: **Django:** Aplicación web (puerto 8000)

source: **PostgreSQL:** Database (port 5432)
es: **PostgreSQL:** Base de datos (puerto 5432)

source: **Redis:** Cache and Celery broker (port 6379)
es: **Redis:** Agente de caché y apio (puerto 6379)

source: **MailHog:** Email testing interface (port 8025)
es: **MailHog:** Interfaz de prueba de correo electrónico (puerto 8025)

source: **Celery Worker:** Background task processing
es: **Trabajador de apio:** Procesamiento de tareas en segundo plano

source: All services are orchestrated using Docker Compose with automatic dependency management.
es: Todos los servicios se organizan mediante Docker Compose con gestión automática de dependencias.

source: Installation
es: Instalación

source: Step 1: Install Docker Desktop
es: Paso 1: instale el escritorio Docker

source: Download Docker Desktop from https://www.docker.com/products/docker-desktop
es: Descargue Docker Desktop desde https://www.docker.com/products/docker-desktop

source: **Verify installation:**
es: **Verificar instalación:**

source: Step 2: Clone Repository
es: Paso 2: clonar repositorio

source: Step 3: Build and Start
es: Paso 3: construir y comenzar

source: The project includes a Makefile with convenient commands:
es: El proyecto incluye un Makefile con comandos convenientes:

source: This command:
es: Este comando:

source: Modifies ``.env`` to set ``DJANGO_SETTINGS_MODULE=construbot.config.settings.local``
es: Modifica ``.env`` para establecer ``DJANGO_SETTINGS_MODULE=construbot.config.settings.local``

source: Sets ``DJANGO_DEBUG=True``
es: Establece ``DJANGO_DEBUG=True``

source: Builds Docker images
es: Crea imágenes de Docker

source: Starts all services (postgres, redis, mailhog, django)
es: Inicia todos los servicios (postgres, redis, mailhog, django)

source: Runs database migrations
es: Ejecuta migraciones de bases de datos.

source: Collects static files
es: Recopila archivos estáticos

source: **Expected output:**
es: **Resultado esperado:**

source: Step 4: Create Superuser
es: Paso 4: crear superusuario

source: You'll be prompted for:
es: Se le solicitará:

source: **Email:** Your admin email (used for login)
es: **Correo electrónico:** Su correo electrónico de administrador (utilizado para iniciar sesión)

source: **Password:** Secure password
es: **Contraseña:** Contraseña segura

source: **Password (again):** Confirmation
es: **Contraseña (nuevamente):** Confirmación

source: Step 5: Access Application
es: Paso 5: Acceder a la Aplicación

source: Open your browser to:
es: Abra su navegador para:

source: **Django Application:** http://localhost:8000
es: **Aplicación Django:** http://localhost:8000

source: **MailHog Interface:** http://localhost:8025 (email testing)
es: **Interfaz de MailHog:** http://localhost:8025 (prueba de correo electrónico)

source: Login with the superuser credentials you just created.
es: Inicie sesión con las credenciales de superusuario que acaba de crear.

source: Docker Compose Configuration
es: Configuración de composición de Docker

source: The project uses ``docker-compose.yml`` for service orchestration.
es: El proyecto utiliza ``docker-compose.yml`` para la orquestación de servicios.

source: Services Overview
es: Descripción general de los servicios

source: Runs Django development server with auto-reload
es: Ejecuta el servidor de desarrollo Django con recarga automática.

source: Mounts current directory for live code changes
es: Monta el directorio actual para cambios de código en vivo

source: Exposes port 8000
es: Expone el puerto 8000

source: Uses PostgreSQL 12 with Alpine Linux
es: Utiliza PostgreSQL 12 con Alpine Linux

source: Persistent data in named volume
es: Datos persistentes en volumen con nombre

source: Default development credentials
es: Credenciales de desarrollo predeterminadas

source: Redis 6 for caching and Celery broker
es: Redis 6 para almacenamiento en caché y corredor de apio

source: No persistence configured (development only)
es: No hay persistencia configurada (solo desarrollo)

source: **mailhog:**
es: **correo:**

source: Catches all outgoing emails
es: Capta todos los correos electrónicos salientes

source: Web UI at http://localhost:8025
es: Interfaz de usuario web en http://localhost:8025

source: Environment Configuration
es: Configuración del entorno

source: The ``.env`` file controls environment-specific settings.
es: El archivo ``.env`` controla la configuración específica del entorno.

source: Development Environment Variables
es: Variables del entorno de desarrollo

source: When you run ``make buildev``, these are set automatically:
es: Cuando ejecuta ``make buildev``, estos se configuran automáticamente:

source: Manual Configuration
es: Configuración manual

source: To customize settings, edit ``.env``:
es: Para personalizar la configuración, edite ``.env``:

source: See :doc:`configuration` for complete variable reference.
es: Consulte :doc:`configuration` para obtener una referencia completa de las variables.

source: Development Workflow
es: Flujo de trabajo de desarrollo

source: Starting the Environment
es: Iniciando el entorno

source: **This starts services without rebuilding.** Use when:
es: **Esto inicia los servicios sin reconstruir.** Úselo cuando:

source: You've already run ``make buildev``
es: Ya has ejecutado ``make buildev``

source: No dependencies have changed
es: Ninguna dependencia ha cambiado.

source: You just want to start the containers
es: Solo quieres iniciar los contenedores.

source: Stopping the Environment
es: Detener el medio ambiente

source: Database Migrations
es: Migraciones de bases de datos

source: Accessing Django Shell
es: Accediendo a Django Shell

source: Running Management Commands
es: Ejecución de comandos de gestión

source: Viewing Logs
es: Ver registros

source: Rebuilding Images
es: Reconstrucción de imágenes

source: **When to rebuild:**
es: **Cuándo reconstruir:**

source: After changing ``requirements/*.txt``
es: Después de cambiar ``requisitos/*.txt``

source: After modifying Dockerfiles
es: Después de modificar Dockerfiles

source: After pulling updates from git with dependency changes
es: Después de extraer actualizaciones de git con cambios de dependencia

source: Testing in Docker
es: Pruebas en Docker

source: Running Tests
es: Ejecución de pruebas

source: Test Configuration
es: Configuración de prueba

source: Tests use ``construbot.config.settings.test`` which:
es: Las pruebas utilizan ``construbot.config.settings.test`` que:

source: Uses an in-memory SQLite database (faster)
es: Utiliza una base de datos SQLite en memoria (más rápida)

source: Disables migrations for speed
es: Desactiva las migraciones para mayor velocidad.

source: Configures test-specific settings
es: Configura ajustes específicos de la prueba

source: See :doc:`/contributor/testing/running-tests` for more details.
es: Consulte :doc:`/contributor/testing/running-tests` para obtener más detalles.

source: Cleanup and Reset
es: Limpieza y reinicio

source: Remove Containers
es: Quitar contenedores

source: **This preserves:**
es: **Esto preserva:**

source: Database data (in volume)
es: Datos de la base de datos (en volumen)

source: Built images
es: Imágenes construidas

source: Reset Database
es: Restablecer base de datos

source: **Warning:** This deletes all data!
es: **Advertencia:** ¡Esto elimina todos los datos!

source: Complete Cleanup
es: Limpieza completa

source: **Warning:** This removes:
es: **Advertencia:** Esto elimina:

source: All containers
es: Todos los contenedores

source: All volumes (database data)
es: Todos los volúmenes (datos de la base de datos)

source: All built images
es: Todas las imágenes construidas

source: You'll need to run ``make buildev`` to start fresh
es: Necesitará ejecutar ``make buildev`` para comenzar de nuevo

source: Troubleshooting
es: Solución de problemas

source: Port Conflicts
es: Conflictos portuarios

source: **Error:** "Port 8000 is already allocated"
es: **Error:** "El puerto 8000 ya está asignado"

source: **Solution 1:** Stop conflicting service
es: **Solución 1:** Detener el servicio conflictivo

source: **Solution 2:** Change port in ``docker-compose.yml``
es: **Solución 2:** Cambiar puerto en ``docker-compose.yml``

source: Then access at http://localhost:8001
es: Luego acceda a http://localhost:8001

source: Container Won't Start
es: El contenedor no arranca

source: **Check logs:**
es: **Verificar registros:**

source: **Common issues:**
es: **Problemas comunes:**

source: **Database not ready:** Wait a few seconds, Django will retry
es: **La base de datos no está lista:** Espere unos segundos, Django lo volverá a intentar

source: **Migration errors:** Run ``make migrations``
es: **Errores de migración:** Ejecute ``realizar migraciones``

source: **Missing dependencies:** Run ``make buildev`` to rebuild
es: **Dependencias faltantes:** Ejecute ``make buildev`` para reconstruir

source: Volume Permission Issues
es: Problemas de permisos de volumen

source: **Error:** "Permission denied" when accessing files
es: **Error:** "Permiso denegado" al acceder a archivos

source: **Solution (Linux):**
es: **Solución (Linux):**

source: Database Connection Errors
es: Errores de conexión a la base de datos

source: **Error:** "could not connect to server"
es: **Error:** "no se pudo conectar al servidor"

source: **Check postgres is running:**
es: **Compruebe que Postgres se esté ejecutando:**

source: **Restart postgres:**
es: **Reiniciar postgres:**

source: **Check DATABASE_URL in .env:**
es: **Compruebe DATABASE_URL en .env:**

source: Out of Disk Space
es: Sin espacio en disco

source: **Error:** "No space left on device"
es: **Error:** "No queda espacio en el dispositivo"

source: **Clean up Docker:**
es: **Limpiar Docker:**

source: Advanced Topics
es: Temas avanzados

source: Custom Docker Compose Override
es: Anulación de redacción de Docker personalizada

source: Create ``docker-compose.override.yml`` for local customizations:
es: Cree ``docker-compose.override.yml`` para personalizaciones locales:

source: This file is git-ignored and won't be committed.
es: Este archivo se ignora por git y no se confirmará.

source: Running Celery Worker
es: Trabajador de apio corriendo

source: The project includes Celery for background tasks. To run a worker:
es: El proyecto incluye Celery para tareas en segundo plano. Para ejecutar un trabajador:

source: Or add to ``docker-compose.yml``:
es: O agregue a ``docker-compose.yml``:

source: Debugging with pdb
es: Depurando con pdb

source: To use Python's debugger:
es: Para usar el depurador de Python:

source: Add breakpoint in code:
es: Agregue un punto de interrupción en el código:

source: When the breakpoint hits, you'll get an interactive debugger in your terminal.
es: Cuando llegue el punto de interrupción, obtendrá un depurador interactivo en su terminal.

source: IDE Integration
es: Integración IDE

source: **PyCharm Professional:**
es: **PyCharm Profesional:**

source: Configure Python Interpreter → Docker Compose
es: Configurar el intérprete de Python → Docker Compose

source: Set service: ``django``
es: Establecer servicio: ``django``

source: PyCharm will automatically use the Docker environment
es: PyCharm utilizará automáticamente el entorno Docker

source: **VS Code:**
es: **Código VS:**

source: Install "Remote - Containers" extension
es: Instalar la extensión "Remoto - Contenedores"

source: Create ``.devcontainer/devcontainer.json``
es: Crear ``.devcontainer/devcontainer.json``

source: Reopen in container
es: Reabrir en contenedor

source: Set up LSP to use Docker:
es: Configure LSP para usar Docker:

source: Performance Optimization
es: Optimización del rendimiento

source: macOS File Sharing
es: Compartir archivos macOS

source: Docker on macOS can be slow with large codebases. Optimize with:
es: Docker en macOS puede ser lento con bases de código grandes. Optimice con:

source: **consistency modes:**
es: **modos de consistencia:**

source: ``cached`` - Host writes are delayed to container (faster reads)
es: ``en caché``: las escrituras del host se retrasan en el contenedor (lecturas más rápidas)

source: ``delegated`` - Container writes are delayed to host (faster writes)
es: ``delegada``: las escrituras del contenedor se retrasan en el host (escrituras más rápidas)

source: ``consistent`` - Synchronous (default, slowest)
es: ``consistente`` - Sincrónico (predeterminado, más lento)

source: Linux Performance
es: Rendimiento de Linux

source: Docker on Linux has native performance, no tuning needed.
es: Docker en Linux tiene rendimiento nativo, no es necesario realizar ajustes.

source: Windows (WSL2)
es: Ventanas (WSL2)

source: Use WSL2 backend for best performance:
es: Utilice el backend WSL2 para obtener el mejor rendimiento:

source: Docker Desktop → Settings → General → Use WSL2
es: Docker Desktop → Configuración → General → Usar WSL2

source: Clone repo inside WSL2 filesystem (not /mnt/c/)
es: Clonar repositorio dentro del sistema de archivos WSL2 (no /mnt/c/)

source: See Also
es: Ver también
