Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/installation/index.po
Languages: es

source: Installation
es: Instalación

source: This section covers how to install and set up Construbot for development. You can choose between Docker-based development (recommended) or local development.
es: Esta sección cubre cómo instalar y configurar Construbot para el desarrollo. Puedes elegir entre desarrollo basado en Docker (recomendado) o desarrollo local.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot supports two installation methods:
es: Construbot admite dos métodos de instalación:

source: **Docker-based Development (Recommended)** - Containerized environment with all dependencies
es: **Desarrollo basado en Docker (recomendado)**: entorno en contenedores con todas las dependencias

source: **Local Development** - Traditional virtual environment setup
es: **Desarrollo local** - Configuración del entorno virtual tradicional

source: Both methods provide a complete development environment with:
es: Ambos métodos proporcionan un entorno de desarrollo completo con:

source: PostgreSQL database
es: base de datos postgresql

source: Redis for caching and Celery
es: Redis para almacenamiento en caché y apio

source: MailHog for email testing (Docker only)
es: MailHog para pruebas de correo electrónico (solo Docker)

source: All Python dependencies
es: Todas las dependencias de Python

source: Prerequisites
es: Requisitos previos

source: Docker Method
es: Método acoplable

source: Required:
es: Requerido:

source: Docker Desktop (includes Docker and Docker Compose)
es: Docker Desktop (incluye Docker y Docker Compose)

source: Make (usually pre-installed on macOS/Linux)
es: Make (normalmente preinstalado en macOS/Linux)

source: **Docker Desktop versions:**
es: **Versiones de escritorio de Docker:**

source: **macOS/Windows:** Download from https://www.docker.com/products/docker-desktop
es: **macOS/Windows:** Descargar desde https://www.docker.com/products/docker-desktop

source: **Linux:** Install Docker Engine and Docker Compose separately
es: **Linux:** Instale Docker Engine y Docker Compose por separado

source: **Minimum requirements:**
es: **Requisitos mínimos:**

source: 4 GB RAM allocated to Docker
es: 4 GB de RAM asignados a Docker

source: 10 GB free disk space
es: 10 GB de espacio libre en disco

source: Local Method
es: Método local

source: Python 3.9.17 or higher
es: Python 3.9.17 o superior

source: pip and virtualenv
es: pip y virtualenv

source: **Installation guides:**
es: **Guías de instalación:**

source: **macOS:** Use Homebrew: ``brew install python@3.9 postgresql redis``
es: **macOS:** Utilice Homebrew: ``brew install python@3.9 postgresql redis``

source: **Windows:** Download installers from official websites
es: **Windows:** Descargue instaladores de sitios web oficiales

source: Quick Start
es: Inicio rápido

source: Docker Method (5 minutes)
es: Método Docker (5 minutos)

source: **That's it!** The application is now running with:
es: **¡Eso es todo!** La aplicación ahora se está ejecutando con:

source: Django on http://localhost:8000
es: Django en http://localhost:8000

source: MailHog on http://localhost:8025
es: MailHog en http://localhost:8025

source: PostgreSQL on localhost:5432
es: PostgreSQL en localhost: 5432

source: Redis on localhost:6379
es: Redis en localhost: 6379

source: Local Method (10 minutes)
es: Método Local (10 minutos)

source: Next Steps
es: Próximos pasos

source: After installation:
es: Después de la instalación:

source: **Populate test data:** Run ``make poblar`` to add sample data
es: **Completar datos de prueba:** Ejecute ``make poblar`` para agregar datos de muestra

source: **Explore the dashboard:** Log in with your superuser credentials
es: **Explore el panel:** Inicie sesión con sus credenciales de superusuario

source: **Read the architecture docs:** :doc:`../architecture/overview`
es: **Lea los documentos de arquitectura:** :doc:`../architecture/overview`

source: **Check configuration options:** :doc:`configuration`
es: **Verifique las opciones de configuración:** :doc:`configuración`

source: Detailed Guides
es: Guías detalladas

source: Troubleshooting
es: Solución de problemas

source: Docker Issues
es: Problemas con Docker

source: **"Port already in use" error:**
es: **Error "Puerto ya en uso":**

source: **"No space left on device":**
es: **"No queda espacio en el dispositivo":**

source: **Containers won't start:**
es: **Los contenedores no se inician:**

source: Local Installation Issues
es: Problemas de instalación local

source: **"pg_config executable not found":**
es: **"ejecutable pg_config no encontrado":**

source: **"Python.h: No such file":**
es: **"Python.h: No existe tal archivo":**

source: **Database connection errors:**
es: **Errores de conexión a la base de datos:**

source: Check your ``.env`` file:
es: Verifique su archivo ``.env``:

source: Make sure PostgreSQL is running:
es: Asegúrese de que PostgreSQL se esté ejecutando:

source: Environment Variables
es: Variables de entorno

source: **Missing .env file:**
es: **Falta el archivo .env:**

source: Copy the example file:
es: Copie el archivo de ejemplo:

source: **Required variables not set:**
es: **Variables requeridas no configuradas:**

source: Minimum required variables:
es: Variables mínimas requeridas:

source: See :doc:`configuration` for complete reference.
es: Consulte :doc:`configuration` para obtener una referencia completa.

source: Common Questions
es: Preguntas comunes

source: **Q: Which method should I use?**
es: **P: ¿Qué método debo utilizar?**

source: A: Docker is recommended for most developers. It provides:
es: R: Se recomienda Docker para la mayoría de los desarrolladores. Proporciona:

source: Consistent environment across all platforms
es: Entorno consistente en todas las plataformas

source: No need to install PostgreSQL/Redis locally
es: No es necesario instalar PostgreSQL/Redis localmente

source: Easy cleanup (``make clean``)
es: Fácil limpieza ("hacer limpio")

source: Closer to production environment
es: Más cerca del entorno de producción

source: Use local development if:
es: Utilice el desarrollo local si:

source: You already have PostgreSQL/Redis installed
es: Ya tienes instalado PostgreSQL/Redis

source: You need to integrate with other local services
es: Necesitas integrarte con otros servicios locales.

source: You prefer traditional Python development
es: Prefieres el desarrollo tradicional de Python

source: **Q: Can I switch between methods?**
es: **P: ¿Puedo cambiar entre métodos?**

source: A: Yes! The codebase is the same. Just change the ``USE_DOCKER`` environment variable.
es: R: ¡Sí! La base del código es la misma. Simplemente cambie la variable de entorno ``USE_DOCKER``.

source: **Q: How do I update my installation?**
es: **P: ¿Cómo actualizo mi instalación?**

source: **Q: Where is the database data stored?**
es: **P: ¿Dónde se almacenan los datos de la base de datos?**

source: **Docker:** In a Docker volume named ``construbot_postgres_data``
es: **Docker:** En un volumen de Docker llamado ``construbot_postgres_data``

source: **Local:** In your PostgreSQL data directory (depends on installation)
es: **Local:** En su directorio de datos de PostgreSQL (depende de la instalación)

source: To reset the database: ``make cleandb`` (Docker) or drop/recreate the database manually (local).
es: Para restablecer la base de datos: ``make cleandb`` (Docker) o elimine/recree la base de datos manualmente (local).

source: See Also
es: Ver también
