Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/installation/local-setup.po
Languages: es

source: Local Setup
es: Configuración local

source: Guide for setting up Construbot in a local development environment without Docker.
es: Guía para configurar Construbot en un entorno de desarrollo local sin Docker.

source: Table of Contents
es: Tabla de contenido

source: **Consider Docker:** Docker setup is recommended for most developers. Use local setup if you prefer traditional Python development or need to integrate with other local services.
es: **Considere Docker:** Se recomienda la configuración de Docker para la mayoría de los desarrolladores. Utilice la configuración local si prefiere el desarrollo tradicional de Python o necesita integrarse con otros servicios locales.

source: Overview
es: Descripción general

source: Local development requires installing and configuring:
es: El desarrollo local requiere instalar y configurar:

source: Python 3.9.17+
es: Pitón 3.9.17+

source: Python dependencies
es: Dependencias de Python

source: You'll create a virtual environment and run services directly on your machine.
es: Creará un entorno virtual y ejecutará servicios directamente en su máquina.

source: Prerequisites
es: Requisitos previos

source: System Requirements
es: Requisitos del sistema

source: **Python 3.9.17 or higher:**
es: **Python 3.9.17 o superior:**

source: **Installation:**
es: **Instalación:**

source: Development Tools
es: Herramientas de desarrollo

source: **pip and virtualenv:**
es: **pip y entorno virtual:**

source: Installation Steps
es: Pasos de instalación

source: Step 1: Clone Repository
es: Paso 1: clonar repositorio

source: Step 2: Create Virtual Environment
es: Paso 2: crear un entorno virtual

source: Your prompt should change to show ``(venv)``:
es: Su mensaje debería cambiar para mostrar ``(venv)``:

source: **Remember to activate:** You must activate the virtual environment every time you work on the project. Add ``source venv/bin/activate`` to your shell profile for automatic activation.
es: **Recuerda activar:** Debes activar el entorno virtual cada vez que trabajes en el proyecto. Agregue ``source venv/bin/activate`` a su perfil de shell para la activación automática.

source: Step 3: Install Python Dependencies
es: Paso 3: instalar las dependencias de Python

source: This installs:
es: Esto instala:

source: Django 3.2.19 and all extensions
es: Django 3.2.19 y todas las extensiones

source: Development tools (pytest, coverage, django-debug-toolbar)
es: Herramientas de desarrollo (pytest, cobertura, django-debug-toolbar)

source: Database drivers (psycopg2)
es: Controladores de base de datos (psycopg2)

source: All project dependencies
es: Todas las dependencias del proyecto.

source: **Expected output:**
es: **Resultado esperado:**

source: **Verify installation:**
es: **Verificar instalación:**

source: Step 4: Configure Database
es: Paso 4: configurar la base de datos

source: **Create PostgreSQL database:**
es: **Crear base de datos PostgreSQL:**

source: **In PostgreSQL console:**
es: **En la consola PostgreSQL:**

source: **Verify connection:**
es: **Verificar conexión:**

source: If successful, you'll see the PostgreSQL prompt. Type ``\\q`` to exit.
es: Si tiene éxito, verá el mensaje de PostgreSQL. Escriba ``\\q`` para salir.

source: Step 5: Configure Environment Variables
es: Paso 5: configurar las variables de entorno

source: **Create .env file:**
es: **Crear archivo .env:**

source: **Required settings for local development:**
es: **Configuraciones requeridas para el desarrollo local:**

source: **Generate SECRET_KEY:** Use Django's secret key generator:
es: **Generar SECRET_KEY:** Utilice el generador de claves secretas de Django:

source: **Alternative: Use environment exports (temporary):**
es: **Alternativa: Usar exportaciones de entorno (temporal):**

source: These are lost when you close the terminal.
es: Estos se pierden al cerrar el terminal.

source: Step 6: Run Database Migrations
es: Paso 6: ejecutar migraciones de bases de datos

source: **Verify tables were created:**
es: **Verificar que se crearon las tablas:**

source: You should see a list of Django tables.
es: Deberías ver una lista de tablas de Django.

source: Step 7: Create Superuser
es: Paso 7: crear superusuario

source: **Prompts:**
es: **Indicaciones:**

source: **Email as username:** Construbot uses email for authentication, not traditional usernames.
es: **Correo electrónico como nombre de usuario:** Construbot utiliza el correo electrónico para la autenticación, no los nombres de usuario tradicionales.

source: Step 8: Collect Static Files
es: Paso 8: recopile archivos estáticos

source: This copies static files (CSS, JavaScript, images) to the ``staticfiles/`` directory.
es: Esto copia archivos estáticos (CSS, JavaScript, imágenes) al directorio ``staticfiles/``.

source: Step 9: Run Development Server
es: Paso 9: ejecutar el servidor de desarrollo

source: **Access the application:**
es: **Accede a la aplicación:**

source: Open http://localhost:8000 in your browser and log in with your superuser credentials.
es: Abra http://localhost:8000 en su navegador e inicie sesión con sus credenciales de superusuario.

source: Development Workflow
es: Flujo de trabajo de desarrollo

source: Daily Startup
es: Inicio diario

source: Database Migrations
es: Migraciones de bases de datos

source: **After modifying models:**
es: **Después de modificar modelos:**

source: **Check migration status:**
es: **Verificar estado migratorio:**

source: Django Shell
es: Concha Django

source: Management Commands
es: Comandos de gestión

source: **Populate test data:**
es: **Rellenar datos de prueba:**

source: **Create another superuser:**
es: **Crea otro superusuario:**

source: **Run custom commands:**
es: **Ejecutar comandos personalizados:**

source: Static Files
es: Archivos estáticos

source: **During development:**
es: **Durante el desarrollo:**

source: Django serves static files automatically with ``DEBUG=True``. No action needed.
es: Django sirve archivos estáticos automáticamente con ``DEBUG=True``. No se necesita ninguna acción.

source: **After adding/modifying static files:**
es: **Después de agregar/modificar archivos estáticos:**

source: Testing
es: Pruebas

source: Running Tests
es: Ejecución de pruebas

source: **View coverage report:**
es: **Ver informe de cobertura:**

source: Test Configuration
es: Configuración de prueba

source: Local tests use ``construbot.config.settings.test`` which:
es: Las pruebas locales utilizan ``construbot.config.settings.test`` que:

source: Uses in-memory SQLite database
es: Utiliza una base de datos SQLite en memoria

source: Disables migrations for speed
es: Desactiva las migraciones para mayor velocidad.

source: Sets test-specific configurations
es: Establece configuraciones específicas de prueba

source: See :doc:`/contributor/testing/running-tests` for details.
es: Consulte :doc:`/contributor/testing/running-tests` para obtener más detalles.

source: Running Celery
es: Apio corriendo

source: For background task processing:
es: Para procesamiento de tareas en segundo plano:

source: **Start Celery worker:**
es: **Iniciar trabajador de apio:**

source: **Monitor tasks:**
es: **Tareas de seguimiento:**

source: Access Flower at http://localhost:5555
es: Acceda a Flower en http://localhost:5555

source: Database Management
es: Gestión de bases de datos

source: Backup Database
es: Base de datos de respaldo

source: Restore Database
es: Restaurar base de datos

source: Reset Database
es: Restablecer base de datos

source: Access Database Console
es: Acceder a la consola de base de datos

source: Troubleshooting
es: Solución de problemas

source: Virtual Environment Issues
es: Problemas del entorno virtual

source: **Error:** "No module named 'django'"
es: **Error:** "No hay módulo llamado 'django'"

source: **Cause:** Virtual environment not activated
es: **Causa:** Entorno virtual no activado

source: **Solution:**
es: **Solución:**

source: **Error:** "Command 'python' not found"
es: **Error:** "Comando 'python' no encontrado"

source: **Solution:** Use ``python3`` instead of ``python``
es: **Solución:** Use ``python3`` en lugar de ``python``

source: Database Connection Errors
es: Errores de conexión a la base de datos

source: **Error:** "could not connect to server"
es: **Error:** "no se pudo conectar al servidor"

source: **Solution 1:** Check PostgreSQL is running
es: **Solución 1:** Verifique que PostgreSQL se esté ejecutando

source: **Solution 2:** Verify DATABASE_URL in .env
es: **Solución 2:** Verificar DATABASE_URL en .env

source: **Solution 3:** Check PostgreSQL is accepting connections
es: **Solución 3:** Verifique que PostgreSQL acepte conexiones

source: If this fails, check ``pg_hba.conf`` configuration.
es: Si esto falla, verifique la configuración de ``pg_hba.conf``.

source: Redis Connection Errors
es: Errores de conexión de Redis

source: **Error:** "Error 111 connecting to localhost:6379"
es: **Error:** "Error 111 al conectarse al host local:6379"

source: **Solution:** Start Redis
es: **Solución:** Iniciar Redis

source: Permission Errors
es: Errores de permiso

source: **Error:** "permission denied to create database"
es: **Error:** "permiso denegado para crear una base de datos"

source: **Solution:** Grant privileges to PostgreSQL user
es: **Solución:** Otorgar privilegios al usuario de PostgreSQL

source: Migration Errors
es: Errores de migración

source: **Error:** "No migrations to apply"
es: **Error:** "No se aplican migraciones"

source: **Cause:** Migrations already applied
es: **Causa:** Migraciones ya aplicadas

source: **Verify:**
es: **Verificar:**

source: **Error:** "Migration is applied before its dependency"
es: **Error:** "La migración se aplica antes de su dependencia"

source: **Solution:** Reset migrations (WARNING: destroys data)
es: **Solución:** Restablecer migraciones (ADVERTENCIA: destruye datos)

source: Port Already in Use
es: Puerto ya en uso

source: **Error:** "That port is already in use"
es: **Error:** "Ese puerto ya está en uso"

source: **Solution:** Find and kill process
es: **Solución:** Proceso de búsqueda y eliminación

source: Development Tips
es: Consejos de desarrollo

source: Auto-reload Not Working
es: La recarga automática no funciona

source: Django's auto-reload should restart on code changes. If not:
es: La recarga automática de Django debería reiniciarse con los cambios de código. Si no:

source: IDE Integration
es: Integración IDE

source: File → Settings → Project → Python Interpreter
es: Archivo → Configuración → Proyecto → Intérprete Python

source: Add Interpreter → Existing environment
es: Agregar intérprete → Entorno existente

source: Select ``venv/bin/python``
es: Seleccione ``venv/bin/python``

source: **VS Code:**
es: **Código VS:**

source: Cmd+Shift+P → "Python: Select Interpreter"
es: Cmd+Shift+P → "Python: Seleccionar intérprete"

source: Choose ``./venv/bin/python``
es: Elija ``./venv/bin/python``

source: Shell Aliases
es: Alias ​​de shell

source: Add to ``~/.bashrc`` or ``~/.zshrc``:
es: Agregue a ``~/.bashrc`` o ``~/.zshrc``:

source: Then use:
es: Luego usa:

source: Upgrading Dependencies
es: Actualización de dependencias

source: Update Requirements Files
es: Actualizar archivos de requisitos

source: Manual Upgrade
es: Actualización manual

source: After Upgrade
es: Después de la actualización

source: Next Steps
es: Próximos pasos

source: After successful installation:
es: Después de una instalación exitosa:

source: **Populate test data:** ``python manage.py poblar``
es: **Rellenar datos de prueba:** ``python administrar.py poblar``

source: **Explore the codebase:** :doc:`../architecture/overview`
es: **Explore el código base:** :doc:`../architecture/overview`

source: **Read API docs:** :doc:`../api/index`
es: **Leer documentos API:** :doc:`../api/index`

source: **Check development workflow:** :doc:`/contributor/development-setup`
es: **Verifique el flujo de trabajo de desarrollo:** :doc:`/contributor/development-setup`

source: See Also
es: Ver también
