Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/installation/requirements.po
Languages: es

source: Requirements
es: Requisitos

source: Understanding Construbot's Python dependencies and how to manage them.
es: Comprender las dependencias de Python de Construbot y cómo gestionarlas.

source: Table of Contents
es: Tabla de contenido

source: Overview
es: Descripción general

source: Construbot uses a structured approach to dependency management with separate requirement files for different environments:
es: Construbot utiliza un enfoque estructurado para la gestión de dependencias con archivos de requisitos separados para diferentes entornos:

source: ``base.in`` / ``base.txt`` - Core dependencies (shared across all environments)
es: ``base.in`` / ``base.txt`` - Dependencias principales (compartidas en todos los entornos)

source: ``local.in`` / ``local.txt`` - Development tools and utilities
es: ``local.in`` / ``local.txt`` - Herramientas y utilidades de desarrollo

source: ``test.in`` / ``test.txt`` - Testing frameworks and tools
es: ``test.in`` / ``test.txt`` - Marcos y herramientas de prueba

source: ``production.txt`` - Production dependencies (inherits from base)
es: ``production.txt`` - Dependencias de producción (heredadas de la base)

source: **`.in` files:** Source files with high-level dependencies
es: **Archivos `.in`:** Archivos fuente con dependencias de alto nivel

source: **`.txt` files:** Compiled files with pinned versions (generated by pip-compile)
es: **Archivos `.txt`:** Archivos compilados con versiones fijadas (generadas por pip-compile)

source: Requirements Structure
es: Estructura de requisitos

source: File Organization
es: Organización de archivos

source: **Workflow:**
es: **Flujo de trabajo:**

source: Edit ``.in`` files to add/remove packages
es: Edite archivos ``.in`` para agregar/eliminar paquetes

source: Run ``make pipcompile`` to generate ``.txt`` files
es: Ejecute ``make pipcompile`` para generar archivos ``.txt``

source: Install from ``.txt`` files with ``pip install -r requirements/<env>.txt``
es: Instale desde archivos ``.txt`` con ``pip install -r requisitos/<env>.txt``

source: Core Dependencies (base.txt)
es: Dependencias principales (base.txt)

source: Django and Extensions
es: Django y Extensiones

source: Long-term support (LTS) version with security updates until April 2024.
es: Versión de soporte a largo plazo (LTS) con actualizaciones de seguridad hasta abril de 2024.

source: **Django Extensions:**
es: **Extensiones de Django:**

source: **Why these extensions?**
es: **¿Por qué estas extensiones?**

source: **django-environ:** Manage settings via environment variables (12-factor app)
es: **django-environ:** Administre la configuración a través de variables de entorno (aplicación de 12 factores)

source: **django-allauth:** Complete authentication with email, social auth
es: **django-allauth:** Autenticación completa con correo electrónico, autenticación social

source: **django-treebeard:** Hierarchical contract structure (materialized path)
es: **django-treebeard:** Estructura de contrato jerárquica (ruta materializada)

source: **django-autocomplete-light:** User-friendly select widgets for foreign keys
es: **django-autocomplete-light:** Widgets de selección fáciles de usar para claves externas

source: Database and Caching
es: Base de datos y almacenamiento en caché

source: **Why PostgreSQL?**
es: **¿Por qué PostgreSQL?**

source: ACID compliance for financial data
es: Cumplimiento ACID para datos financieros

source: Advanced features (JSON fields, full-text search)
es: Funciones avanzadas (campos JSON, búsqueda de texto completo)

source: Production-ready and scalable
es: Listo para producción y escalable

source: **Why Redis?**
es: **¿Por qué Redis?**

source: Caching layer for performance
es: Capa de almacenamiento en caché para rendimiento

source: Celery message broker
es: Corredor de mensajes de apio

source: Session storage (optional)
es: Almacenamiento de sesiones (opcional)

source: REST API
es: API DESCANSO

source: **Features:**
es: **Características:**

source: JWT token authentication (stateless)
es: Autenticación de token JWT (sin estado)

source: Browsable API for development
es: API navegable para desarrollo

source: Automatic API documentation with Swagger
es: Documentación API automática con Swagger

source: Task Queue
es: Cola de tareas

source: **Use cases:**
es: **Casos de uso:**

source: Sending emails asynchronously
es: Envío de correos electrónicos de forma asincrónica

source: Generating PDF reports in background
es: Generando informes PDF en segundo plano

source: Scheduled data synchronization
es: Sincronización de datos programada

source: Document Generation
es: Generación de documentos

source: Generate construction estimates as PDF
es: Generar presupuestos de construcción como PDF

source: Import catalog data from Excel
es: Importar datos del catálogo desde Excel

source: Process uploaded images
es: Procesar imágenes cargadas

source: Email
es: Correo electrónico

source: **Supported providers:**
es: **Proveedores admitidos:**

source: Mailgun
es: pistola de correo

source: SendGrid
es: EnviarGrid

source: Postmark
es: Matasellos

source: Utilities
es: Utilidades

source: **Why Argon2?**
es: **¿Por qué Argón2?**

source: More secure than PBKDF2 or bcrypt
es: Más seguro que PBKDF2 o bcrypt

source: Recommended by OWASP
es: Recomendado por OWASP

source: Resistant to GPU/ASIC attacks
es: Resistente a ataques GPU/ASIC

source: Development Dependencies (local.txt)
es: Dependencias de desarrollo (local.txt)

source: Debugging Tools
es: Herramientas de depuración

source: **Usage:**
es: **Uso:**

source: Code Quality
es: Calidad del código

source: **Pre-commit hooks:**
es: **Ganchos de confirmación previa:**

source: Documentation
es: Documentación

source: **Build docs:**
es: **Documentos de compilación:**

source: Testing Dependencies (test.txt)
es: Prueba de dependencias (test.txt)

source: Test Frameworks
es: Marcos de prueba

source: **Why pytest over Django's built-in?**
es: **¿Por qué pytest en lugar del integrado de Django?**

source: Better fixtures and parametrization
es: Mejores accesorios y parametrización.

source: Cleaner test syntax
es: Sintaxis de prueba más limpia

source: Rich plugin ecosystem
es: Rico ecosistema de complementos

source: Better output formatting
es: Mejor formato de salida

source: Test Utilities
es: Utilidades de prueba

source: **Example usage:**
es: **Uso de ejemplo:**

source: Production Dependencies (production.txt)
es: Dependencias de producción (producción.txt)

source: **Why these additions?**
es: **¿Por qué estas adiciones?**

source: **gunicorn:** Production WSGI server (not runserver)
es: **gunicorn:** Servidor WSGI de producción (no servidor de ejecución)

source: **whitenoise:** Efficient static file serving
es: **whitenoise:** Servicio eficiente de archivos estáticos

source: **sentry-sdk:** Error tracking and monitoring
es: **sentry-sdk:** Seguimiento y supervisión de errores

source: **django-storages:** Store media files in S3
es: **django-storages:** Almacena archivos multimedia en S3

source: Managing Dependencies
es: Gestión de dependencias

source: Installing Dependencies
es: Instalación de dependencias

source: **Development:**
es: **Desarrollo:**

source: **Testing:**
es: **Pruebas:**

source: **Production:**
es: **Producción:**

source: Adding New Dependencies
es: Agregar nuevas dependencias

source: **Step 1:** Add to appropriate ``.in`` file
es: **Paso 1:** Agregar al archivo ``.in`` apropiado

source: **Step 2:** Compile requirements
es: **Paso 2:** Compile los requisitos

source: This runs ``pip-compile`` on all ``.in`` files and generates ``.txt`` files with pinned versions.
es: Esto ejecuta ``pip-compile`` en todos los archivos ``.in`` y genera archivos ``.txt`` con versiones fijadas.

source: **Step 3:** Install new requirements
es: **Paso 3:** Instalar nuevos requisitos

source: **Step 4:** Commit both files
es: **Paso 4:** Confirma ambos archivos

source: Updating Dependencies
es: Actualización de dependencias

source: **Update specific package:**
es: **Actualizar paquete específico:**

source: **Update all packages:**
es: **Actualizar todos los paquetes:**

source: **Sync environment:**
es: **Entorno de sincronización:**

source: Removing Dependencies
es: Eliminar dependencias

source: **Step 1:** Remove from ``.in`` file
es: **Paso 1:** Eliminar del archivo ``.in``

source: **Step 2:** Recompile
es: **Paso 2:** Recompilar

source: **Step 3:** Uninstall package
es: **Paso 3:** Desinstalar el paquete

source: Pinning Versions
es: Versiones de fijación

source: Why Pin Versions?
es: ¿Por qué fijar versiones?

source: **Benefits:**
es: **Beneficios:**

source: **Reproducibility:** Same environment every time
es: **Reproducibilidad:** El mismo entorno siempre

source: **Stability:** Avoid breaking changes
es: **Estabilidad:** Evite cambios importantes

source: **Security:** Control when to upgrade
es: **Seguridad:** Controla cuándo actualizar

source: **Approach:**
es: **Acercarse:**

source: Pin exact versions in ``.txt`` files (``Django==3.2.19``)
es: Anclar versiones exactas en archivos ``.txt`` (``Django==3.2.19``)

source: Use ranges in ``.in`` files (``Django>=3.2,<4.0``)
es: Usar rangos en archivos ``.in`` (``Django>=3.2,<4.0``)

source: Version Constraints
es: Restricciones de versión

source: Security Updates
es: Actualizaciones de seguridad

source: **Check for vulnerabilities:**
es: **Compruebe si hay vulnerabilidades:**

source: **Update vulnerable packages:**
es: **Actualizar paquetes vulnerables:**

source: Dependency Analysis
es: Análisis de dependencia

source: View Dependency Tree
es: Ver árbol de dependencias

source: Find Unused Dependencies
es: Buscar dependencias no utilizadas

source: Check for Updates
es: Buscar actualizaciones

source: Common Issues
es: Problemas comunes

source: Dependency Conflicts
es: Conflictos de dependencia

source: **Error:** "Cannot install package-a and package-b"
es: **Error:** "No se pueden instalar el paquete a y el paquete b"

source: **Solution:** Check dependency constraints
es: **Solución:** Verifique las restricciones de dependencia

source: Compilation Errors
es: Errores de compilación

source: **Error:** "Could not find a version that satisfies the requirement"
es: **Error:** "No se pudo encontrar una versión que cumpla con el requisito"

source: **Cause:** Incompatible version constraints
es: **Causa:** Restricciones de versión incompatibles

source: **Solution:**
es: **Solución:**

source: Installation Failures
es: Fallos de instalación

source: **Error:** "Failed building wheel for psycopg2"
es: **Error:** "Error en la rueda de construcción para psycopg2"

source: **Cause:** Missing PostgreSQL development headers
es: **Causa:** Faltan encabezados de desarrollo de PostgreSQL

source: **Error:** "Failed building wheel for Pillow"
es: **Error:** "Error en la rueda de construcción de Pillow"

source: **Cause:** Missing image libraries
es: **Causa:** Faltan bibliotecas de imágenes

source: Virtual Environment Issues
es: Problemas del entorno virtual

source: **Problem:** Dependencies installed globally
es: **Problema:** Dependencias instaladas globalmente

source: **Solution:** Always use virtual environment
es: **Solución:** Utilice siempre un entorno virtual

source: Best Practices
es: Mejores prácticas

source: **Always use .in files** - Don't edit .txt files manually
es: **Utilice siempre archivos .in** - No edite archivos .txt manualmente

source: **Pin exact versions in .txt** - For reproducibility
es: **Fijar versiones exactas en .txt** - Para reproducibilidad

source: **Use ranges in .in** - Allow flexibility during compilation
es: **Utilice rangos en .in**: permita flexibilidad durante la compilación

source: **Regular updates** - Monthly dependency review
es: **Actualizaciones periódicas** - Revisión mensual de dependencias

source: **Security scanning** - Use safety or pip-audit
es: **Escaneo de seguridad** - Utilice seguridad o auditoría pip

source: **Test after updates** - Run full test suite
es: **Prueba después de las actualizaciones** - Ejecute el conjunto de pruebas completo

source: **Document reasons** - Add comments for unusual constraints
es: **Motivos del documento** - Agregue comentarios para restricciones inusuales

source: Example Workflow
es: Flujo de trabajo de ejemplo

source: See Also
es: Ver también

source: `pip-tools documentation <https://github.com/jazzband/pip-tools>`_
es: `Documentación de pip-tools <https://github.com/jazzband/pip-tools>`_
