Repository: javier-llamas/construbot
Catalog: docs/locale/*/LC_MESSAGES/developer/models/index.po
Languages: es

source: Models
es: Modelos

source: Data model documentation for Construbot.
es: Documentación del modelo de datos para Construbot.

source: Overview
es: Descripción general

source: Construbot's data models are organized into several apps:
es: Los modelos de datos de Construbot están organizados en varias aplicaciones:

source: **users:** User, Company, Customer, NivelAcceso
es: **usuarios:** Usuario, Empresa, Cliente, NivelAcceso

source: **proyectos:** Contrato, Contraparte, Sitio, Estimate, Concept, Retenciones
es: **proyectos:** Contrato, Contraparte, Sitio, Estimación, Concepto, Retenciones

source: **core:** Base models and utilities
es: **núcleo:** Modelos básicos y utilidades

source: Multi-Tenant Architecture
es: Arquitectura multiinquilino

source: **All business models include:**
es: **Todos los modelos de negocio incluyen:**

source: See :doc:`../architecture/multi-tenancy` for details.
es: Consulte :doc:`../architecture/multi-tenancy` para obtener más detalles.

source: Key Models
es: Modelos clave

source: User Models (users app)
es: Modelos de usuario (aplicación de usuarios)

source: **Customer** - Top-level account
es: **Cliente** - Cuenta de nivel superior

source: **Company** - Business entity (tenant)
es: **Empresa** - Entidad comercial (inquilino)

source: **User** - Custom user model with email authentication
es: **Usuario**: modelo de usuario personalizado con autenticación de correo electrónico

source: **NivelAcceso** - Permission levels (1-6)
es: **NivelAcceso** - Niveles de permiso (1-6)

source: See :doc:`users` for complete reference.
es: Consulte :doc:`users` para obtener una referencia completa.

source: Business Models (proyectos app)
es: Modelos de Negocio (aplicación de proyectos)

source: **Contrato** - Contract/Project (hierarchical using django-treebeard)
es: **Contrato** - Contrato/Proyecto (jerárquico usando django-treebeard)

source: **Contraparte** - Counterparty (Client, Subcontractor, Piecework Contractor)
es: **Contraparte** - Contraparte (Cliente, Subcontratista, Contratista a destajo)

source: **Sitio** - Construction site
es: **Sitio** - Sitio de construcción

source: **Estimate** - Progress payment/estimate
es: **Estimado** - Pago de progreso/estimado

source: **Concept** - Line item in contract catalog
es: **Concepto**: artículo de línea en el catálogo de contratos

source: **Retenciones** - Financial retentions/withholdings
es: **Retenciones** - Retenciones/retenciones financieras

source: See :doc:`proyectos` for complete reference.
es: Ver :doc:`proyectos` para una referencia completa.

source: Model Relationships
es: Relaciones modelo

source: Common Patterns
es: Patrones comunes

source: **Company-scoped queries:**
es: **Consultas específicas de la empresa:**

source: **Tree operations:**
es: **Operaciones de árbol:**

source: **Unique per company:**
es: **Único por empresa:**

source: See Also
es: Ver también
